[
  {
    "Link": "The author, a budding designer since high school, shares a pivotal experience that shattered their confidence when a major client underpaid for a significant branding project due to personal reasons. Despite having dedicated immense effort to the project, the disappointing outcome led them to pause their design work and focus on college. As they near graduation, they struggle with low self-esteem, charging low rates out of fear of rejection, and facing persistent doubts about their value. They seek advice from others who have faced similar challenges, expressing a desire to overcome these issues and rebuild their confidence.",
    "Subreddit": "",
    "Title": "The author of this Reddit post is a design student who has faced a major setback after being underpaid for a significant branding project due to personal reasons. Despite their dedication, this experience has shattered their confidence and led them to put their design work on hold to focus on college. As they near graduation, they struggle with low self-esteem, charging low rates out of fear of rejection, and persistent doubts about their value. The commenters offered words of encouragement, advice, and personal experiences to help the author overcome their challenges. They emphasized the importance of valuing their skills, setting boundaries, and not being afraid to ask for what they deserve. Some raised concerns about the impact of mental health on their creative work, while others shared their own experiences of overcoming similar obstacles. Overall, the sentiment of the commenters was positive and supportive, with many expressing empathy and understanding for the author's struggles. The most upvoted comment reads: \"You are more than worthy of being paid for your work and sticking up for yourself when it comes to finances. Don't ever undervalue yourself. Believe in your worth and know that your talent has value.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]