[
  {
    "Link": "The author shares their journey of building and selling their first business, Rustplus, a skin trading platform for the game Rust, while being a full-time college student with no prior business experience. Starting in Spring 2017 with a $20 gift card, they grew their inventory to $500 by trading Steam skins, then developed a trading site with the help of a developer. Through influencer marketing, strategic investments, and iterative improvements, they expanded the platform to over 40,000 users and processed $250,000 in trades. Despite initial success, profits declined due to ineffective ads and backend issues. In Spring 2018, they sold 90% of the business for $2,200, retaining a 10% stake. Highlights include earning $12,000 in profits, gaining valuable entrepreneurial experience, and learning about development, marketing, and investing. The author reflects on the journey as a valuable learning experience and expresses interest in future business endeavors.",
    "Subreddit": "",
    "Title": "The Reddit post shares the story of the author's journey in building and selling their first business, Rustplus, a skin trading platform for the game Rust. Despite being a full-time college student with no prior business experience, the author started with a $20 gift card and grew the inventory to $500 through trading steam skins. Working with a developer, they developed a trading site and employed influencer marketing and strategic investments to expand to over 40,000 users and process $250,000 in trades. Although initial success was seen, profits declined due to ineffective ads and backend issues, leading them to sell 90% of the business for $2,200 in Spring 2018 while retaining a 10% stake. The highlights of the post include earning $12,000 in profits, gaining valuable entrepreneurial experience, and learning about development, marketing, and investing. The author reflects on the journey as a valuable learning experience and expresses an interest in future business endeavors. Most commenters in the post are impressed by the author's success and admire their determination and hard work. Many readers also commend the author for their entrepreneurial skills and express interest in learning more about their journey. However, some raised concerns about the potential legal issues surrounding skin trading and the risks involved in investing in a volatile market. The overall sentiment from the commenters is positive, with many congratulating the author on their achievements and encouraging them to continue their entrepreneurial journey. The comment with the most upvotes is \"Wow, this is really impressive for a college student with no prior experience. Congratulations on your success and all the valuable lessons you've learned along the way! Best of luck for your future endeavors.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]