[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "In a recent Reddit post, a struggling entrepreneur shared their story of accumulating 8 million pesos in debt over the past few years while trying to achieve success. Despite initially experiencing success through a physical store selling clothing, the COVID-19 pandemic forced them to shift to online sales, leading to further debt. Although they generated 29 million pesos in sales, mismanagement ultimately caused their business to fail. The narrator also tried other ventures, such as affiliate marketing and launching an ebook, but these also resulted in failures. This has left them feeling defeated, regretful, and worried about the burden on their family. They sought advice on whether to give up on their dreams and consider a stable path, like freelancing. \n\nThe discussion on the post revolved around understanding the mistakes made and offering support and encouragement to the narrator. Many commenters empathized with their struggles and highlighted the important lessons learned from their failures. Some positive points raised were the narrator's perseverance and determination to keep trying, as well as the valuable experience gained through their entrepreneurial journey. Others shared their own experiences and provided helpful tips and resources to manage debts and start anew. \n\nThe main concerns raised were the financial burden on the narrator and their family, and the mental toll these failures have taken on their well-being. Many commenters urged them to seek professional help and not let their failures define them. Some suggested considering alternative paths, like freelancing, as a more stable option. \n\nThe overall sentiment of the commenters was sympathetic and understanding, with a focus on learning from mistakes and looking towards the future with hope. The most upvoted comment highlighted the importance of self-reflection and taking responsibility for one's actions, but also not letting failures hinder future success: \"Take responsibility for your past actions, but don't let it burden your family's future. Use this experience to learn and grow in your next endeavors.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]