[
  {
    "Link": "The author has been freelancing as a design engineer for 13 years, generating around $464,616 in income but struggling financially and feeling unfulfilled. Despite starting an LLC and pursuing government funding through the Small Business Innovation Research (SBIR) program, they have yet to achieve any income from their business. Their health and social life have deteriorated, and they are currently behind on bills and rent. A potential full-time job opportunity has arisen, but the author is conflicted about taking it due to the perceived distraction from their business. They are preparing to submit new proposals for funding while grappling with feelings of isolation and uncertainty about the future. Overall, the author acknowledges past mistakes but remains hopeful about the potential for future success while expressing frustration and desperation over their current financial situation.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post describes a freelance design engineer who has been struggling financially and feeling unfulfilled despite 13 years of experience and generating over $464,616 in income. They have started an LLC and pursued government funding through the SBIR program, but have yet to see any income from their business. This has caused their health and social life to deteriorate, and they are currently behind on bills and rent. Some commenters expressed empathy and offered helpful advice, citing the author's determination and hard work as positive points. Concerns were raised about the author's financial management, work-life balance, and reliance on government funding. The overall sentiment from commenters was a mix of sympathy and frustration, with many offering words of encouragement and reminding the author to take care of their mental health. The comment with the most upvotes reminded the author to have a backup plan and not put all their eggs in one basket.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]