[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "The Reddit post discusses a person in their 40s who has been successfully managing a side hustle for the past three years, which has now surpassed their full-time job in terms of income. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. The company offered to adjust their schedule to retain them, but the author doubts the feasibility of maintaining the same workload with reduced hours. They are now considering asking for a raise, even though it may put them at risk for future layoffs, as they value the remote work flexibility provided by their current job. \n\nPositive points include the author's success in their side hustle and the flexibility of their current job allowing them to manage it. Some commenters also applaud the author for prioritizing their health and making a difficult but necessary decision. Others encourage the author to take the risk and ask for a raise, while some suggest exploring other job opportunities that may offer better work-life balance. \n\nThe main concerns raised by commenters include the fear of potential layoffs and the uncertainty of how reduced hours would affect their workload. Some also express skepticism about the likelihood of a successful negotiation for a raise. \n\nThe overall sentiment of the commenters is generally supportive of the author and their decision to prioritize their well-being. Many suggest considering alternative job options that offer a better work-life balance, while some acknowledge the risk of asking for a raise but encourage the author to take a chance. \n\nThe comment with the most upvotes reads, \"It's always better to put your health first. You can always find another job, but you only have one mind and body.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]