[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post shares the struggles of an entrepreneur who accumulated 8 million pesos ($141,000) in debt after achieving initial success with a physical store selling clothing. Despite generating 29 million pesos ($512,000) in sales, the shift to online sales and mismanagement led to the business's closure. Furthermore, attempts at affiliate marketing and launching an ebook also failed, causing feelings of defeat and regret for the narrator. Many commenters highlighted the importance of learning from mistakes and not giving up, while also acknowledging the difficulties faced during the COVID-19 pandemic. Main concerns raised include the impact of the debt on the narrator's family and the fear of letting go of their dreams. The overall sentiment of commenters is one of empathy and support, with many sharing their own experiences and offering advice on new paths to pursue. The comment with the most upvotes reminds the narrator that failure is a learning experience and that their perseverance and determination are admirable.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]