[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post shares the story of a struggling entrepreneur who has accumulated a debt of 8 million pesos ($141,000) over the past few years. Despite initial success with a physical store, the COVID-19 pandemic forced the business to shift to online sales, resulting in significant loans and mismanagement leading to its closure. The narrator expresses feelings of defeat, regret, and concern for their family's burden, seeking advice on letting go of their dreams and potentially freelancing instead. Commenters expressed empathy towards the narrator's struggles and offered words of encouragement and advice. Some key positive points included the importance of seeking help from professionals, taking a break to recharge, and not giving up despite failures. Main concerns raised were the lack of financial management and balancing personal life with entrepreneurship. Overall, the sentiment of commenters showed a mix of understanding and support towards the narrator, with the most upvoted comment offering a reminder to not let failures define one's worth. ?Remember, your [financial] failures do not make you who you are as a person. Keep moving forward, don't let them defeat you.? - u/realns3nse.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]