[
  {
    "Link": "A customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After realizing the item wasn't suitable, they returned it, paying $14 for shipping. However, USPS marked the package as \"unclaimed\" after three delivery attempts, and it was returned to the sender. The customer contacted the business for a refund, but the business refused to pay for the return shipping and insisted on receiving the item to process the refund, resulting in the customer facing an additional $14 cost. The customer is frustrated and considering a chargeback, feeling the business is not honoring its return policy fairly.",
    "Subreddit": "",
    "Title": "The Reddit post in question details a frustrating experience where a customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After returning the item due to it not being suitable, the customer paid $14 for shipping. However, due to issues with USPS, the package was marked as \"unclaimed\" and returned to the sender. The business refused to cover the return shipping and insisted on receiving the item to process the refund, meaning the customer now faces an additional $14 cost. The main positive points of discussion include other users sharing similar experiences and trying to provide solutions for the customer, such as contacting their credit card company for a chargeback. The main concerns raised revolve around the business not adhering to their own return policy, causing inconvenience and additional costs for the customer. The overall sentiment of the commenters is one of frustration and disappointment towards the business, with many expressing support for the customer's decision to pursue a chargeback. The comment with the most upvotes reads, \"Absolutely ridiculous and disgraceful for the business to go back on their own return policy. Customer service fail.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]