[
  {
    "Link": "The author, a budding designer since high school, shares a pivotal experience that shattered their confidence when a major client underpaid for a significant branding project due to personal reasons. Despite having dedicated immense effort to the project, the disappointing outcome led them to pause their design work and focus on college. As they near graduation, they struggle with low self-esteem, charging low rates out of fear of rejection, and facing persistent doubts about their value. They seek advice from others who have faced similar challenges, expressing a desire to overcome these issues and rebuild their confidence.",
    "Subreddit": "",
    "Title": "The post on Reddit details the experience of a designer who has struggled with low self-esteem and confidence after a major client underpaid for a significant branding project. Despite their dedication to the project, the disappointing outcome led them to pause their design work and focus on college. As they near graduation, they seek advice from others who have faced similar challenges in rebuilding their confidence and overcoming their fear of rejection. Commenters were quick to offer messages of support and encouragement, reminding the author of their value and talent. They also shared personal experiences and tips on dealing with rejection and charging fair rates. However, there were also concerns raised about the competitive nature of the design industry and the need for the author to prioritize their mental health and well-being. Overall, the sentiment was one of empathy and understanding, with a strong sense of camaraderie and a shared desire to help the author succeed. The most upvoted comment, with 320 upvotes, reads: \"Always remember that your worth and value as a designer cannot be defined by the actions of one client. Keep pushing forward, and don't be afraid to take risks and charge what you deserve.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]