[
  {
    "Link": "The author started a small baking business in January 2024, initially selling baked goods at farmers markets, which allowed them to leave their jobs at Starbucks. After obtaining wholesale licensing, they began selling to restaurants, but business has slowed, leading them to take two additional jobs to make ends meet. They now work 16-hour days but feel burnt out and trapped, questioning whether continuing the business is worth it. Despite their husband's support, the author struggles with motivation, faces repeated rejection, and feels like an imposter in their role as a business owner, contemplating whether to abandon their entrepreneurial dreams in favor of a more stable job.",
    "Subreddit": "#N/A",
    "Title": "Discussion Summary:\n\nThis Reddit post features a small business owner who started a baking business in 2024 and went through a transition from selling at farmers markets to supplying to restaurants. However, due to a slowdown in business, the author finds themselves taking on additional jobs to make ends meet, leading to burnout and questioning the worth of continuing the business. Despite their husband's support, the author struggles with motivation, rejection, and impostor syndrome, considering giving up their entrepreneurial dreams for a stable job. The commenters expressed sympathy and understanding for the author's situation, highlighting the challenges and sacrifices that come with being a small business owner. Many emphasized the importance of taking care of oneself and exploring new strategies to improve the business. The overall sentiment of the commenters is one of support and encouragement, with some suggesting seeking professional help. The most upvoted comment reads, \"Running your own business is tough, and takes a lot of persistence and resilience. Don't give up just yet, take a step back and reassess your goals and strategies. You can do this!\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]