[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "The author of the post is a person in their 40s who has been managing a successful side hustle for the past three years. They recently resigned from their full-time job due to declining mental and physical health, without disclosing their side hustle. The company offered to adjust their schedule to retain them, but the author is unsure if reduced hours would allow them to maintain the same workload. They are now considering asking for a raise, even if it could put them at risk for future layoffs. They value their current job for its remote work flexibility and see it as the end of their corporate career. The commenters largely praise the author for their successful side hustle and encourage them to prioritize their health and well-being. Some suggest negotiating with the company for a fair salary and reasonable hours, while others caution against asking for a raise and risking potential layoffs. The overall sentiment is one of support and understanding, with many commenters sharing their own personal experiences and offering advice on balancing a side hustle with a demanding job. The most upvoted comment advises the author to prioritize their mental and physical health and reminds them that their worth is not solely based on their job performance.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]