[
  {
    "Link": " The author recounts their journey of building and selling their first business, Rustplus, a platform for trading in-game skins for \"Rust,\" starting with a $20 investment in 2017. Over two years, they grew the inventory from $500 to $6,000, attracted over 40,000 users, and processed $250,000 in trades. They experimented with influencer ads, Google AdWords, and hired developers for site improvements, earning around $17,000 in revenue. However, declining profits, increased competition, and the need to focus on school led to selling 90% of the business for $2,200. Despite challenges, the author highlights the valuable entrepreneurial experience, problem-solving skills, and earnings, concluding with optimism for future ventures.",
    "Subreddit": "",
    "Title": "In this Reddit post, the author shares their experience of building and selling their business, Rustplus, which allowed users to trade in-game skins for a popular game called Rust. The post starts with the author's initial investment of $20 in 2017 and how they were able to grow their inventory to $6,000, attract over 40,000 users, and process $250,000 in trades over two years. The author also discusses their strategies for marketing, such as using influencer ads and Google AdWords, as well as hiring developers for site improvements, which led to a revenue of $17,000. However, the decline in profits, increased competition, and the need to focus on school ultimately led to the author selling 90% of the business for $2,200. Despite the challenges, many commenters highlight the valuable entrepreneurial experience gained by the author, their problem-solving skills, and the earnings achieved. Some concerns raised by commenters include the declining profits and the decision to sell the business for a relatively small amount. Overall, the sentiment of the commenters is positive, with many acknowledging the author's determination and entrepreneurial spirit. The comment with the most upvotes reads, \"Congratulations on your successful venture! It may not have ended as you hoped, but the experience gained is invaluable. Good luck on your future ventures.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]