[
  {
    "Link": "A customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After realizing the item wasn't suitable, they returned it, paying $14 for shipping. However, USPS marked the package as \"unclaimed\" after three delivery attempts, and it was returned to the sender. The customer contacted the business for a refund, but the business refused to pay for the return shipping and insisted on receiving the item to process the refund, resulting in the customer facing an additional $14 cost. The customer is frustrated and considering a chargeback, feeling the business is not honoring its return policy fairly.",
    "Subreddit": "",
    "Title": "In this Reddit post, a customer shares their frustration with a small business's return policy. The business offered a 30-day return and 100% satisfaction guarantee, but when the customer returned a $50 item, it was marked as \"unclaimed\" by USPS and sent back to the sender. The business refused to pay for return shipping and insisted on receiving the item to process the refund, leading the customer to face an additional $14 cost. \nMost commenters were sympathetic towards the customer and expressed their disappointment with the business's handling of the situation. They felt that the business was not honoring their return policy fairly, putting the burden on the customer and causing additional expenses. Some praised the customer for trying to resolve the issue with the business directly before considering a chargeback. \nThe main concern raised was the lack of communication and understanding from the business. Many suggested that the business should have covered the return shipping cost or offered a partial refund to compensate for the customer's inconvenience. \nComment with the most upvotes: \"If a business can't handle a simple return like this, they don't deserve anyone's business. Definitely pursue a chargeback and make sure to leave a review warning others of their poor customer service.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]