[
  {
    "Link": "The author, a small business owner shipping 30 to 50 boxes daily, reports a decline in sales largely attributed to high shipping costs, with nearly 90% of cart abandoners citing shipping prices as a deterrent. They use USPS and FedEx for shipments but find UPS uncooperative in terms of discounts and negotiations. Despite attempts to lower shipping costs at the expense of profit margins, price adjustments have not helped. The owner expresses frustration with unsolicited offers from Unishippers, citing poor transparency and negative reviews. They seek advice on securing better shipping rates from FedEx or UPS.",
    "Subreddit": "#N/A",
    "Title": "In the Reddit post, the author, a small business owner shipping 30 to 50 boxes daily, shares their struggle with declining sales due to high shipping costs. The majority of cart abandoners cite shipping prices as the main deterrent. The owner mentions using USPS and FedEx for shipments but expresses frustration with UPS's uncooperative attitude towards discounts and negotiations. Despite attempts to lower shipping costs, price adjustments have not been successful. The owner also expresses their displeasure with Unishippers' unsolicited offers, citing poor transparency and negative reviews. Seeking advice on securing better shipping rates from FedEx or UPS, the owner receives various responses. Most commenters suggest negotiating with the shipping companies or using alternative services such as ShipStation or Pirate Ship. Some also mention the importance of properly estimating and factoring in shipping costs while setting prices. The main sentiment among commenters is that high shipping costs are a major concern for small businesses, with many agreeing that it is a challenging issue to solve. The most upvoted comment is from a user who shares their own experience with UPS and encourages the owner to reach out to their account manager for better deals and discounts.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]