[
  {
    "Link": "The author, a sole W2 employee running a one-man marketing agency that recently transitioned from an LLC to an S-Corp, is facing a dilemma regarding expense categorization on the 1120S form. There?s a disagreement between their bookkeeper and tax preparer on how to categorize subcontractor expenses. Historically categorized as \"Contract Labor\" on Schedule C, there is no such option on the 1120S form. The CPA suggests labeling these expenses as \"Other Deductibles\" and setting \"Cost of Goods Sold\" to zero, while the bookkeeper argues they should fall under \"Cost of Goods Sold\" (CoGS) due to their direct link to business revenue. The author is inclined to agree with the bookkeeper, who believes that excessive use of \"Other Deductibles\" could raise audit flags. They seek additional opinions on this matter.",
    "Subreddit": "#N/A",
    "Title": "The author, a sole W2 employee who recently transitioned from an LLC to an S-Corp, is seeking advice on how to categorize subcontractor expenses on the 1120S form. The main disagreement is between the CPA, who suggests labeling these expenses as \"Other Deductibles\" and setting \"Cost of Goods Sold\" to zero, and the bookkeeper, who argues they should be categorized as \"Cost of Goods Sold\" due to their direct link to business revenue. Many commenters agree with the bookkeeper's argument, stating that it makes more sense to categorize subcontractor expenses as CoGS. However, others express concern about potential audit flags if the \"Other Deductibles\" category is overused. The overall sentiment of the commenters is that the bookkeeper's suggestion is the most logical and practical solution. The comment with the most upvotes states, \"Categorizing subcontractor expenses as CoGS seems more appropriate and in line with generally accepted accounting principles. It's important to be accurate and transparent with expense categorization to avoid any potential issues with audits.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]