[
  {
    "Link": "The author has spent 13 years freelancing as a design engineer, often feeling undervalued and struggling financially, with their health deteriorating over time. They transitioned to starting their own business but have yet to generate income, mainly focusing on securing Small Business Innovation Research (SBIR) funding, which is highly competitive. Despite the challenges, they see potential for significant income if successful. Currently facing financial strain, including late bills and rent, they have been offered a full-time job that may distract from their business efforts, but they feel it necessary for immediate income. They express frustration over their situation, the cyclical nature of their struggles, and the difficulty in finding quality freelance work outside of Craigslist, ultimately seeking advice and support.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the struggles of a design engineer who has been freelancing for 13 years. Despite their experience and skills, they feel undervalued and have been facing financial strain. They have recently transitioned to starting their own business, but have yet to generate income. Their main focus has been securing Small Business Innovation Research (SBIR) funding, which is highly competitive. While they see potential for significant income if successful, they are currently facing financial difficulties, including late bills and rent. They have been offered a full-time job that may distract from their business efforts, but they feel it is necessary for immediate income. The author expresses frustration over their situation and the cyclical nature of their struggles. They also mention the difficulty in finding quality freelance work outside of Craigslist. The commenters offer advice and support, with many acknowledging the challenges of freelancing and expressing empathy for the author's situation. The overall sentiment is one of understanding and encouragement, with users sharing their own experiences and offering practical tips. The comment with the most upvotes states, \"Freelancing can definitely be tough, especially in the design/engineering field. But don't give up yet, keep pushing and seeking out opportunities. You never know when the next big break will come.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]