[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "#N/A",
    "Title": "The author, a person in their 40s, has been successfully managing a side hustle for the past three years that surpasses their full-time job. However, due to declining mental and physical health, they made the difficult decision to resign without disclosing their side hustle. The company offered to adjust their schedule to keep them, but the author was unsure if they could maintain the same workload with reduced hours. Now, they are considering asking for a raise, even though they know it may put them at risk for future layoffs. They highly value the flexibility of remote work in their current job and see it as the end of their corporate career. Comments expressed support for the author's successful side hustle and encouraged them to prioritize their health. Some also shared personal experiences with balancing side hustles and full-time jobs and offered advice on managing workload and negotiating a raise. The main concerns raised were around the author's long-term prospects at their job and the potential impact on their mental and physical well-being. Commenters expressed a mix of empathy and admiration for the author's success and highlighted the importance of prioritizing self-care and making strategic decisions for one's career. The comment with the most upvotes was, \"If your side hustle can support you, go ahead and leave the job. Even if you have to drop to part time, take them up on it. I couldn't imagine retiring from my job, but, man I have had enough employers\".",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]