[
  {
    "Link": "The author has been a freelance design engineer for 13 years, earning an estimated $464,616 before taxes, primarily through Craigslist gigs. Despite loving the work when it?s challenging and collaborative, they?ve struggled with low income, poor treatment, declining health, isolation, and financial stress. In recent years, they started a business focused on securing SBIR (Small Business Innovation Research) grants, which could potentially provide significant income and fulfilling work. However, the process is highly competitive, and they?ve yet to secure funding. Currently, they?re facing severe financial difficulties, with overdue bills and rent, and are considering taking a full-time job offered by a former coworker, though it would distract from their business. Despite the challenges, they remain hopeful about the potential of SBIR funding and are preparing multiple proposals for 2020, aiming for a significant financial turnaround. The author feels stuck but is reluctant to give up on their business due to its potential.",
    "Subreddit": "",
    "Title": "In this Reddit post, the author, a freelance design engineer for 13 years, discusses their struggles with low income, poor treatment, declining health, isolation, and financial stress. Despite these challenges, they remain hopeful about their business focused on securing SBIR grants, which could potentially provide significant income and fulfilling work. However, the highly competitive nature of the process has made it difficult to secure funding, leading to severe financial difficulties. While some commenters express admiration for the author's perseverance and hope for their business, others raise concerns about the sustainability and practicality of relying on SBIR funding. The overarching sentiment of the commenters is one of encouragement and support, with many offering advice and resources to help the author succeed. The most upvoted comment reads, \"Hang in there and continue preparing those proposals! It sounds like you have a lot of potential and determination. Don't give up on your business just yet.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]