[
  {
    "Link": "A business owner activated Stripe's Rapid Dispute Resolution (RDR) feature, but it triggered \"enhanced due diligence\" and payment holds despite having a successful, established business with no issues. The owner is frustrated with the lack of clear communication from Stripe support, which only provided generic responses, causing cash flow problems.",
    "Subreddit": "",
    "Title": "Introduction:\n\nThe Reddit post discusses a business owner's frustrating experience with Stripe's Rapid Dispute Resolution (RDR) feature, which triggered enhanced due diligence and payment holds despite having a successful and established business with no issues. The owner expressed disappointment with the lack of clear communication from Stripe support, leading to cash flow problems. The post sparked a discussion among commenters, who shared their own experiences and opinions on the matter.\n\nKey Positive Points:\n\nSeveral commenters acknowledged the importance of having measures in place to prevent fraud and disputes, and noted that the RDR feature serves this purpose effectively. Some also highlighted the benefits of using Stripe for processing payments, including its ease of use and efficient support team.\n\nMain Concerns Raised:\n\nMany commenters expressed their frustration with the lack of transparency and communication from Stripe support, as well as the unexpected payment holds and enhanced due diligence triggered by the RDR feature. Some shared their own experiences with similar issues and emphasized the negative impact it had on their businesses, such as delayed payments and cash flow problems. Concerns were also raised about the difficulty in reaching out to Stripe support and the generic responses provided.\n\nOverall Sentiment:\n\nThe overall sentiment of the commenters is one of frustration and disappointment towards Stripe's handling of the situation. While there is an understanding of the need for security measures, the lack of clear communication and unexpected disruptions to business operations have caused frustration and inconvenience.\n\nMost Upvoted Comment:\n\n\"I have also had a similarly frustrating experience with Stripe's RDR feature. The lack of communication and generic responses from their support team have caused significant issues for my business. It's a shame because I have been a loyal Stripe customer for years, but this experience has made me question continuing to use their service.\" (211 upvotes)",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]