[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the author, in their 40s, successfully managing a side hustle that surpasses their full-time job for the past three years. Due to declining health, the author resigned without disclosing their side hustle. The company offered to adjust their schedule, but the author doubts the feasibility. They are now considering asking for a raise, even though it might put them at risk for future layoffs, as they see this job as the end of their corporate career and value the remote work flexibility it provides. \n\nThe main concern raised by commenters is the author's declining mental and physical health and how it has affected their decision to resign. Many commenters sympathize and offer support, while others suggest seeking a balance between the side hustle and full-time job, rather than resigning. They also discuss the potential risk of asking for a raise and the possibility of it backfiring. However, there are also positive points raised, such as valuing the remote work flexibility and the success of the side hustle. The overall sentiment of commenters is supportive and understanding, with many offering valuable advice and sharing their own experiences. The comment with the most upvotes highlights the importance of prioritizing one's own health and well-being over a corporate career, stating \"Your health is more important than any job. Don't let corporate culture pressure you into sacrificing it.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]