[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "Introduction:\n\nThe Reddit post discusses the struggles of an entrepreneur who accumulated 8 million pesos in debt due to mismanagement and setbacks in their business ventures. Despite generating 29 million pesos in sales, the narrator expresses feelings of defeat and regret, questioning their ambitions and considering freelancing as a more stable path forward. \n\nKey Positive Points:\n\nMany commenters empathized with the narrator's situation and offered words of encouragement, reminding them that failure is a part of the entrepreneurial journey. Some highlighted the narrator's perseverance and determination, as evidenced by their continued efforts to find success through different ventures. Others praised the narrator for recognizing the need to pivot and move towards a more stable career path.\n\nMain Concerns Raised:\n\nThe main concerns raised by commenters revolved around the narrator's financial situation and the impact it could have on their family. Some urged the narrator to seek professional help in managing their debts, while others cautioned against blindly pursuing entrepreneurship without proper planning and contingency measures. Many expressed concern for the narrator's mental well-being and advised them to prioritize their health over financial success.\n\nOverall Sentiment:\n\nThe overall sentiment of the commenters was one of support and understanding. Many shared their own experiences with failure and acknowledged the courage it takes to share such personal struggles. Some reminded the narrator that true success is not measured by financial wealth, but rather by personal growth and resilience. \n\nMost Upvoted Comment:\n\nThe comment with the most upvotes offered words of encouragement and reminded the narrator that their worth and value is not defined by their failures or successes in business. It urged the narrator to focus on their well-being and loved ones, and not to give up on their dreams completely, but to reassess and redefine their goals. \n\nMost Upvoted Comment:\n\n\"Your ambition is a beautiful thing to have, and while it may not seem like it now, it will lead to bigger and better things. Just remember that your worth is not defined by your financial success or failures. Take this time to prioritize your mental and emotional health, and your loved ones. Don't give up on your dreams completely, but maybe take a step back and reassess, redefine your goals. You got this.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]