[
  {
    "Link": "An assistant manager at a small retail liquor store discovered suspicious patterns in the voided sales log, indicating potential employee theft. After reviewing security footage, he observed an employee scanning products, taking cash from customers, and voiding the sales while keeping the cash in the till. Although the manager couldn't find evidence of the employee pocketing items, he expressed concern about falsely accusing him. Ultimately, the manager shared the findings with the owner, who confirmed that a significant amount of theft occurred. The employee confessed to the theft, and the owner decided not to pursue charges if he paid back the stolen amount, raising concerns about the impact on the employee's career. The assistant manager felt frustration over the situation and urged for stricter theft prevention measures.",
    "Subreddit": "",
    "Title": "The Reddit post discusses a case of employee theft in a small retail liquor store. The assistant manager discovered suspicious patterns in the voided sales log and upon reviewing security footage, observed an employee scanning products, taking cash from customers, and voiding sales while keeping the cash in the till. The manager shared these findings with the owner who confirmed a significant amount of theft had occurred. The employee confessed to the theft and the owner decided not to pursue charges if he paid back the stolen amount, sparking discussions about the impact on the employee's career and calling for stricter theft prevention measures. Commenters expressed frustration over the situation and raised concerns about the impact on both the store and the employee. The overall sentiment was divided with some showing sympathy towards the employee while others believed that he should face consequences for his actions in order to prevent future theft. The top-voted comment highlights the need for stricter measures to prevent theft in the future.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]