[
  {
    "Link": "An assistant manager at a small retail liquor store discovered suspicious patterns in the voided sales log, indicating potential employee theft. After reviewing security footage, he observed an employee scanning products, taking cash from customers, and voiding the sales while keeping the cash in the till. Although the manager couldn't find evidence of the employee pocketing items, he expressed concern about falsely accusing him. Ultimately, the manager shared the findings with the owner, who confirmed that a significant amount of theft occurred. The employee confessed to the theft, and the owner decided not to pursue charges if he paid back the stolen amount, raising concerns about the impact on the employee's career. The assistant manager felt frustration over the situation and urged for stricter theft prevention measures.",
    "Subreddit": "",
    "Title": "In a Reddit post, an assistant manager at a small retail liquor store shared their discovery of an employee committing theft. After reviewing security footage, the manager observed the employee scanning products, taking cash from customers, and voiding the sales while keeping the cash. The manager expressed concerns about falsely accusing the employee and shared their findings with the owner, who confirmed a significant amount of theft. The employee confessed and the owner decided to not press charges if the stolen amount was paid back, causing concern about the employee's future. The assistant manager called for stricter theft prevention measures. Overall, commenters were supportive of the manager's actions and expressed frustration over the situation, with many agreeing that stricter measures should be implemented. The comment with the most upvotes stated, \"It's unfortunate that this employee chose to steal, but the manager did the right thing by confronting the issue and seeking a resolution that benefited everyone involved.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]