[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "This Reddit post follows the story of an individual in their 40s who has been successfully managing a side hustle that outperforms their full-time job for the past three years. However, due to declining mental and physical health, the author resigned from their job without disclosing their side hustle. The company offered to adjust their schedule to retain them, but the author doubts the feasibility of reduced hours while maintaining the same workload. They are now considering asking for a raise, even though it may put them at risk for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.\n\nThe majority of commenters seem to praise the author for their entrepreneurial success and offer support for their decision to prioritize their health and well-being over their job. They also commend the author's dedication to their side hustle and offer advice on how to navigate the potential risks of asking for a raise. Some commenters raise concerns about the feasibility of maintaining a successful side hustle while working reduced hours and warn the author to carefully consider the potential consequences of asking for a raise. Overall, the sentiment of the commenters is one of understanding and support for the author's decision to prioritize their health and seek out career opportunities that align with their values and goals.\n\nThe comment with the most upvotes is from a user who writes, \"You have clearly proven your capabilities by successfully managing a side hustle while working full-time. Trust your instincts and prioritize your health above all else. It's important to recognize your worth and not be afraid to advocate for yourself, but also be prepared for the repercussions of asking for a raise.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]