[
  {
    "Link": "The owner of a custom suit shop on Etsy, with 450 sales and $54.8K revenue since launching online in October 2023, details the sudden suspension of their shop. Despite a history of handmade products and attempts to communicate with customers about overdue custom orders, Etsy suspended the shop without prior warnings. The suspension was triggered by customers opening cases due to overdue orders, leading to immediate refunds from Etsy. The owner suspects a false review from a dissatisfied customer and points out inconsistencies in Etsy's enforcement, such as other shops using stolen images remaining active. The situation has caused severe anxiety, as they have outstanding orders, employees to support, and significant materials on hand. The owner expresses frustration with Etsy's policies and urges caution for other small businesses reliant on the platform.",
    "Subreddit": "",
    "Title": "The discussion on this Reddit post revolves around the sudden suspension of a custom suit shop on Etsy, which has had 450 sales and generated $54.8K in revenue since its launch in October 2023. The shop owner details their frustration with Etsy's policies and lack of communication prior to the suspension. Many commenters express support for the shop owner and share similar experiences with Etsy, highlighting the platform's inconsistent enforcement and lack of transparency. Some positive points include the shop's history of handmade products and attempts to communicate with customers about overdue orders. However, the main concerns raised revolve around the owner's anxiety and financial loss due to the suspension, as they have outstanding orders, employees to support, and significant materials on hand. The overall sentiment of the commenters is one of frustration and disappointment with Etsy's handling of the situation, with many urging caution for other small businesses relying on the platform. The comment with the most upvotes states, \"Etsy's policies are often inconsistent and unfair, and small business owners are left to suffer the consequences. It's time for more transparency and accountability from the platform.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]