[
  {
    "Link": "The owner of a handmade suit shop on Etsy, which generated $54.8K in revenue with around 450 sales, faced suspension in October 2023 due to a backlog of custom orders and customer satisfaction issues. Despite having a good track record and providing detailed sizing guides and consultations, many overdue orders resulted in customer complaints, leading to case openings and automatic refunds from Etsy. A dispute with a Japanese customer over customs fees and a negative review contributed to the situation. With active orders pending, thousands of dollars in fabric stock, and four employees relying on the business, the owner expressed panic and frustration over the suspension, claiming their attempts to communicate with customers were misconstrued. They urged others in the small business community to diversify their platforms and voiced their discontent with Etsy's handling of the matter.",
    "Subreddit": "#N/A",
    "Title": "In October 2023, the owner of a handmade suit shop on Etsy faced suspension due to a backlog of custom orders and customer satisfaction issues, despite generating $54.8K in revenue with 450 sales. Many customers complained about overdue orders, leading to case openings and automatic refunds from Etsy. A dispute with a Japanese customer over customs fees and a negative review contributed to the situation. Despite providing detailed sizing guides and consultations, the owner expressed panic and frustration over the suspension, claiming their attempts to communicate with customers were misconstrued. Commenters praised the owner's successful revenue and provided support and advice, such as diversifying platforms and improving communication with customers. They also expressed concern over Etsy's handling of the matter and empathized with the owner's difficult situation. The top upvoted comment stated, \"It's unfortunate that Etsy handles these situations poorly and penalizes small businesses instead of providing support.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]