[
  {
    "Link": "The author started a small baking business in January 2024, initially selling baked goods at farmers markets, which allowed them to leave their jobs at Starbucks. After obtaining wholesale licensing, they began selling to restaurants, but business has slowed, leading them to take two additional jobs to make ends meet. They now work 16-hour days but feel burnt out and trapped, questioning whether continuing the business is worth it. Despite their husband's support, the author struggles with motivation, faces repeated rejection, and feels like an imposter in their role as a business owner, contemplating whether to abandon their entrepreneurial dreams in favor of a more stable job.",
    "Subreddit": "#N/A",
    "Title": "This Reddit post follows a small baking business owner who started their venture in January 2024, leaving their job at Starbucks to pursue their dream. Despite initially finding success at farmers markets and obtaining wholesale licensing, business has slowed down, requiring the owner to take on two additional jobs to make ends meet. They now work 16-hour days and are feeling burnt out and trapped, questioning the worth of continuing their business. While their husband is supportive, the owner struggles with motivation and faces repeated rejection, feeling like an imposter. Many commenters expressed admiration for the owner's determination and hard work, emphasizing the importance of self-care and taking breaks. The main concern raised is the balance between chasing entrepreneurial dreams and prioritizing financial stability and well-being. Overall, the sentiment of the commenters was one of empathy and encouragement, with the majority urging the owner to take a break or seek outside help. The top upvoted comment highlights the importance of mental health and self-care, stating, \"Take care of yourself first. A successful business isn't worth sacrificing your well-being.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]