[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post reflects on the struggles of an entrepreneur who incurred 8 million pesos in debt after a successful physical store was forced to shift to online sales due to the COVID-19 pandemic. Despite generating 29 million pesos in sales, mismanagement and failed attempts at affiliate marketing and launching an ebook led to the business's closure. The narrator expresses feelings of defeat, regret, and concern for their family's burden, seeking advice on letting go of their dreams and considering freelancing as a more stable option. Many commenters offered encouraging words, highlighting the narrator's resilience and determination, with some sharing their own experiences of failure and the lessons learned. However, there were concerns raised about the lack of proper research and planning, and the need to prioritize family and financial stability. The overall sentiment was one of empathy and understanding, with many offering practical solutions and words of support. The most upvoted comment highlights the importance of learning from mistakes and having a support system to bounce back stronger.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]