[
  {
    "Link": "A customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After realizing the item wasn't suitable, they returned it, paying $14 for shipping. However, USPS marked the package as \"unclaimed\" after three delivery attempts, and it was returned to the sender. The customer contacted the business for a refund, but the business refused to pay for the return shipping and insisted on receiving the item to process the refund, resulting in the customer facing an additional $14 cost. The customer is frustrated and considering a chargeback, feeling the business is not honoring its return policy fairly.",
    "Subreddit": "",
    "Title": "The post describes a situation where a customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee,\" but after realizing the item wasn't suitable, they returned it for a $14 shipping fee. However, the package was marked as \"unclaimed\" and sent back to the sender by USPS. The business refused to cover the return shipping and insisted on receiving the item for a refund, causing the customer to incur an additional $14 cost. The customer expressed frustration and is considering a chargeback. Many commenters praised the customer for trying to resolve the issue with the business first and highlighted the importance of honoring return policies. Others shared similar experiences and recommended the customer to stand firm and demand a full refund. The main concern raised was the business's lack of communication and refusal to cover the return shipping cost, despite advertising a \"satisfaction guarantee.\" Overall, the sentiment of the commenters was supportive of the customer's frustration and suggested taking further action if necessary. The most upvoted comment had 285 upvotes and stated, \"This is unacceptable behavior from the business. A customer should not incur extra costs because of their mistake. Definitely try to resolve it with the business, but if they refuse, file a chargeback and leave a negative review.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]