[
  {
    "Link": "The author started their business in 2007 after 18 years at a failing company, leveraging 22 years of experience and client loyalty. They worked from home, avoiding real estate costs, and survived the 2008 crash. Both the author and their husband are self-employed. Despite enduring the COVID-19 pandemic, rising costs (up 50% in 2020) made the business unsustainable. They are now considering a part-time 1099 contract with a long-term vendor, acknowledging they were fortunate not to close in 2020 like many other small businesses.",
    "Subreddit": "",
    "Title": "The author of this Reddit post shared their experience of starting a business in 2007 after 18 years at a failing company. They leveraged their 22 years of experience and client loyalty and worked from home to avoid real estate costs. Despite the challenges, the business survived the 2008 crash and the author and their husband were able to remain self-employed. However, the rising costs in 2020, including a 50% increase, made the business unsustainable. The author is now considering a part-time 1099 contract with a long-term vendor, recognizing their fortunate situation compared to many other small businesses that were forced to close in 2020 due to the COVID-19 pandemic. \n\nOverall, the commenters were sympathetic towards the author and acknowledged the difficult decision to close their business. Many praised their resilience in navigating through multiple challenges and admired their determination to explore alternative options for their livelihood. However, some raised concerns over the sustainability of relying on a single vendor and the potential for lack of job security. Some also emphasized the importance of seeking professional advice before making a decision. \n\nThe overall sentiment of the commenters was a mix of appreciation and empathy for the author's situation. Many shared their own experiences in starting or running a small business and offered words of encouragement. One comment, with the most upvotes, stated, \"It takes a lot of courage to build a business from scratch and even more to let it go when it's no longer viable. You should be proud of what you've accomplished and be optimistic for what's to come.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]