[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "This Reddit post follows the story of an individual in their 40s who has been successfully managing a side hustle that surpasses their full-time job for the past three years. Due to declining mental and physical health, they made the decision to resign from their job without disclosing their side hustle. The company offered to adjust their schedule to retain them, but the author has doubts about being able to maintain the same workload with reduced hours. Now, they are considering asking for a raise, despite the potential of being designated for future layoffs. The author values the remote work flexibility their current job provides and sees it as the end of their corporate career. \n\nThe discussion reveals several positive points, including the success of the author's side hustle and their strong work ethic for being able to manage both their job and side hustle. Many commenters empathized with the author's decision to prioritize their health and applauded their achievements. However, the main concerns raised include the potential consequences of asking for a raise and the risk of losing the flexible work arrangement. Some also questioned the feasibility of maintaining the same workload with reduced hours and suggested finding a balance between the job and side hustle. \n\nThe overall sentiment of the commenters is supportive and understanding of the author's personal struggles and their decision to prioritize their health. Some offered practical advice and tips for finding the right balance, while others shared similar experiences. The top-rated comment with the most upvotes highlighted the importance of taking care of one's self and not being afraid to make decisions that prioritize well-being over career advancement.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]