[
  {
    "Link": "The author has been a freelance design engineer for 13 years, earning an estimated $464,616 before taxes, primarily through Craigslist gigs. Despite loving the work when it?s challenging and collaborative, they?ve struggled with low income, poor treatment, declining health, isolation, and financial stress. In recent years, they started a business focused on securing SBIR (Small Business Innovation Research) grants, which could potentially provide significant income and fulfilling work. However, the process is highly competitive, and they?ve yet to secure funding. Currently, they?re facing severe financial difficulties, with overdue bills and rent, and are considering taking a full-time job offered by a former coworker, though it would distract from their business. Despite the challenges, they remain hopeful about the potential of SBIR funding and are preparing multiple proposals for 2020, aiming for a significant financial turnaround. The author feels stuck but is reluctant to give up on their business due to its potential.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the struggles of a freelance design engineer who has been facing low income, poor treatment, declining health, and financial stress despite having a passion for their work. In recent years, they have focused on securing SBIR grants, but have yet to secure funding, leading to severe financial difficulties. While the author remains hopeful about the potential of SBIR funding and is preparing proposals for 2020, many commenters express concerns about the competitiveness of the process and suggest considering other options, such as taking a full-time job in the meantime. However, the overall sentiment is hopeful and encouraging, with commenters offering support and advice to help the author succeed. The top voted comment advises the author to prioritize their financial stability while still pursuing their business dreams.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]