[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the struggles of an entrepreneur who accumulated 8 million pesos ($141,000) in debt due to failed ventures. Despite initially finding success with a physical store, the shift to online sales during the pandemic proved to be unsuccessful, leading to even more debt. Although the business generated 29 million pesos ($512,000) in sales, mismanagement and other failures ultimately led to its closure. The narrator expresses feelings of regret, defeat, and concern for their family's financial burden, questioning their ambitions and purpose. Many commenters offered advice and support, emphasizing the importance of learning from mistakes and not giving up, while also highlighting the realities and challenges of entrepreneurship. Some suggested alternative paths, such as freelancing, as a more stable option. The overall sentiment of the commenters is empathetic and understanding, with many offering encouraging words and sharing their own experiences of failure and success in business. The highest upvoted comment was: \"Remember that failure is just a step towards success, if you learn from it and keep pushing forward. Don't give up on your dreams, just pivot and keep moving forward.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]