[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "#N/A",
    "Title": "This Reddit post tells the story of an individual's struggles with entrepreneurship, culminating in millions of pesos in debt. They had initial success with a physical store but faced challenges when transitioning to online sales due to the COVID-19 pandemic. Despite generating significant sales, mismanagement and failures led to the business's closure. Additional attempts at affiliate marketing and launching an ebook also failed, causing the narrator to question their ambitions and purpose. They seek advice on moving forward and are considering freelancing as a more stable path. The overall sentiment of the commenters is sympathetic, with many sharing their own experiences with entrepreneurship and offering words of encouragement. Key positive points include the narrator's determination and resilience, and the recognition that failures are a part of the entrepreneurial journey. Main concerns raised revolve around the impact on the narrator's family and the advice to carefully assess future ventures. The comment with the most upvotes advises the individual to not let go of their dreams, but rather, to use their experiences to learn, grow and try again.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]