[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post shares the struggles of an entrepreneur who accumulated 8 million pesos ($141,000) in debt over the past few years. After achieving success with a physical store, the business was forced to shift to online sales due to the COVID-19 pandemic, which led to significant debts from loans taken to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures resulted in the business's closure. The narrator expresses feelings of defeat, regret, and concern for their family's financial burden. They question their ambitions and purpose and seek advice on moving on from their dreams and pursuing freelancing as a more stable path. While some commenters sympathized with the narrator's struggles and offered words of encouragement, others pointed out the importance of proper planning and management in entrepreneurship and the potential risks involved. The overall sentiment among commenters was one of support and hope for the narrator's future endeavors, with one of the most upvoted comments stating, \"It's important to learn from failures and mistakes and use them as lessons for future successes.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]