[
  {
    "Link": "A woman reflects on her journey of entrepreneurship, having accumulated 8 million pesos ($141,000) in debt while pursuing ambitious dreams. She initially found success in 2019 with a clothing store, but her plans unraveled due to the COVID-19 pandemic and subsequent poor decisions, such as taking out loans and failing to track expenses. Despite generating 29 million pesos ($512,000) in sales, she repeatedly faced setbacks, leading to the closure of her business in 2023. Attempts at affiliate marketing and creating an ebook to help others also ended in failure, further deepening her financial and emotional struggles. Feeling defeated, she questions her dreams and purpose at 31 years old, expressing regret over the burden placed on her supportive parents. Moving forward, she aims to focus on freelancing to regain financial stability.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post follows a woman's journey of entrepreneurship, which initially led to success with a clothing store in 2019, but ultimately resulted in 8 million pesos ($141,000) of debt due to poor decisions and the impact of the COVID-19 pandemic. Despite generating 29 million pesos ($512,000) in sales, the business eventually closed in 2023 and attempts at affiliate marketing and creating an ebook also failed. The commenters expressed empathy for the woman's struggles, highlighting the importance of managing finances, seeking professional advice, and having a strong support system. They also acknowledged her determination and perseverance in trying to rebuild her financial stability through freelancing. The overall sentiment was one of support and encouragement, with the most upvoted comment stating, \"Your resilience and willingness to start afresh is commendable. Keep pushing forward and don't let setbacks define you.\" This post serves as a reminder of the challenges and risks associated with entrepreneurship, but also the strength and resilience required to overcome them.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]