[
  {
    "Link": "A customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After realizing the item wasn't suitable, they returned it, paying $14 for shipping. However, USPS marked the package as \"unclaimed\" after three delivery attempts, and it was returned to the sender. The customer contacted the business for a refund, but the business refused to pay for the return shipping and insisted on receiving the item to process the refund, resulting in the customer facing an additional $14 cost. The customer is frustrated and considering a chargeback, feeling the business is not honoring its return policy fairly.",
    "Subreddit": "",
    "Title": "The post on Reddit discussed a customer's negative experience with a small business that had a \"30-day return\" and \"100% satisfaction guarantee\" policy. The customer ordered a $50 item but returned it after realizing it wasn't suitable, paying $14 for shipping. However, due to USPS marking the package as \"unclaimed,\" the item was returned to the sender. The customer contacted the business for a refund but was refused and faced an extra $14 cost for return shipping. Several commenters expressed frustration with the business not honoring its return policy fairly. Some key positive points raised included acknowledging that the business may have their own return policy and the fact that the customer was willing to pay for return shipping. However, the main concerns raised were the lack of communication and empathy from the business, the additional cost incurred by the customer, and the inconvenience of the situation. The overall sentiment of the commenters was that the business should honor their return policy and take responsibility for the mistake made by USPS. The top upvoted comment stated, \"If your return policy says 30 days and customer is trying within that time, it shouldn't matter if they have the item or not, they're trying to return it.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]