[
  {
    "Link": "The author reflects on their tumultuous journey in entrepreneurship, which began in 2019 with a small clothing store that initially thrived but ultimately led to significant debt?8 million pesos (about $141,000). After early success, including a profitable pivot to online sales during COVID-19, the business faltered due to poor financial management and mounting loans. Despite generating 29 million pesos in sales, operational costs and failed attempts at various ventures resulted in closure and deepening depression. The author feels like a failure, especially towards their supportive family, and grapples with the pressure of big dreams versus a stable life. They express a desire to move forward by focusing on freelancing and reducing debt, while reflecting on the lessons learned from their experiences and seeking a more manageable path.",
    "Subreddit": "#N/A",
    "Title": "This Reddit post discusses the journey of a small business owner, who reflects on the ups and downs of their entrepreneurial experience that ultimately led to significant debt. Despite early success and a profitable pivot to online sales during COVID-19, the business struggled due to poor financial management and mounting loans. The author expresses feelings of failure and pressure to balance big dreams with stability, while also acknowledging the support of their family. Many commenters offer words of encouragement and share similar struggles, emphasizing the importance of learning from mistakes and focusing on the present. Concerns about the author?s mental health and financial stability are raised, with some suggesting seeking professional help and others offering practical advice on managing debt and pivoting to freelancing. Overall, the sentiment among commenters is sympathetic and supportive, with many offering words of wisdom and reassurance during difficult times. The top-rated comment with the most upvotes is ?A setback is a setup for a comeback. It?s not how you fall, it?s how you get back up and what you do after that.?",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]