[
  {
    "Link": "A small UK engineering company specializing in waterproof cables faced difficulties when an overseas customer in the UAE requested a custom product. After successfully agreeing on specifications, issues arose during the onboarding process, particularly around payment terms. The customer insisted on net 60 payments, which the owner found untenable due to the upfront costs of custom work. After much negotiation, the best offer was net 30, still risky for the owner. Ultimately, the owner chose not to proceed with the order, prioritizing peace of mind over financial risk. They sought to hear from others about similar experiences with large companies.",
    "Subreddit": "",
    "Title": "In this Reddit post, a small UK engineering company faced difficulties in fulfilling a custom order from an overseas customer in UAE due to payment terms. Despite successfully agreeing on specifications, the customer insisted on net 60 payment terms which were perceived as risky for the owner. After seeking advice from other Redditors, key positive points were raised such as the importance of prioritizing peace of mind over financial risk, the option of requesting a deposit from the customer or seeking alternative payment options. Main concerns included the difficult nature of negotiating with large companies, the risks involved in custom work and overall challenges faced by small businesses in international transactions. The overall sentiment of the commenters leaned towards understanding the owner's decision not to proceed with the order and highlighting the need for proper risk assessment and clear communication in business transactions. The comment with the most upvotes was, \"Small business owners need to protect themselves first and foremost. It's unfortunate that this deal fell through, but it's better to be safe than sorry in such situations. I hope you find better opportunities in the future.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]