[
  {
    "Link": "The owner of a custom suit shop on Etsy, with 450 sales and $54.8K revenue since launching online in October 2023, details the sudden suspension of their shop. Despite a history of handmade products and attempts to communicate with customers about overdue custom orders, Etsy suspended the shop without prior warnings. The suspension was triggered by customers opening cases due to overdue orders, leading to immediate refunds from Etsy. The owner suspects a false review from a dissatisfied customer and points out inconsistencies in Etsy's enforcement, such as other shops using stolen images remaining active. The situation has caused severe anxiety, as they have outstanding orders, employees to support, and significant materials on hand. The owner expresses frustration with Etsy's policies and urges caution for other small businesses reliant on the platform.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the suspension of a custom suit shop on Etsy, which has achieved 450 sales and $54.8K revenue since its launch in October 2023. The owner expresses frustration with the sudden suspension of their shop, despite a history of handmade products and attempts to communicate with customers about overdue custom orders. The suspension was triggered by customers opening cases due to late orders, resulting in immediate refunds from Etsy. The owner suspects a false review from a dissatisfied customer and points out inconsistencies in Etsy's enforcement, such as other shops using stolen images remaining active. Concerns raised include the owner's severe anxiety from having outstanding orders, employees to support, and significant materials on hand. Commenters share similar frustrations with Etsy's policies and urge caution for other small businesses reliant on the platform. The most upvoted comment reads, \"It's disheartening to see Etsy treat their sellers with such disregard and inconsistency. This situation highlights the need for small businesses to diversify and not solely rely on one platform for their success.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]