[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "The author of the Reddit post is in their 40s and has been successfully managing a side hustle that outperforms their full-time job for three years. They resigned from their job due to declining mental and physical health and did not disclose their side hustle. The company offered to adjust their schedule but the author doubts the feasibility. They are contemplating asking for a raise, even though it may designate them for future layoffs, as they value the remote work flexibility they currently have. \n\nThe key positive points that emerged from the discussion include the success of the author's side hustle and their recognition of their own declining health. Many commenters empathized with the author's situation and encouraged them to prioritize their well-being. Another positive aspect mentioned was the author's willingness to take risks and consider asking for a raise.\n\nThe main concerns raised were the potential negative consequences of asking for a raise, such as job security and the author's professional reputation. Some commenters also expressed doubts about the feasibility of the reduced schedule offered by the company and suggested negotiating for better working conditions.\n\nOverall, the sentiment among the commenters was supportive and encouraging. Many offered advice and personal experiences, with a common theme of valuing one's health and well-being over a job. The comment with the most upvotes echoed this sentiment, stating, \"Your health is the most important thing. No job is worth putting that at risk. Take care of yourself first.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]