[
  {
    "Link": "The author observes that many small businesses are struggling but is investigating which industries are genuinely growing and profitable. They have noted that construction and tradespeople appear to be doing better recently.",
    "Subreddit": "",
    "Title": "The Reddit post in question investigates industries that are currently thriving amidst the struggles faced by small businesses. The author notes that construction and tradespeople seem to be doing better, but is looking for further insight into this observation. \n\nThe key positive points discussed by commenters include the resilience and adaptability of small businesses in finding new ways to stay afloat, such as offering virtual services or implementing safety measures. The construction and trades industries were also praised for their essential services and ability to continue operating during the pandemic. Additionally, some commenters noted that certain industries, such as technology and e-commerce, have seen growth during this time.\n\nMain concerns raised in the discussion revolve around the lack of government support for small businesses, especially in terms of financial aid. Many commenters expressed frustration with the unequal distribution of resources and the impact on small businesses. The uncertainty of when things will return to normal and the possibility of a second wave were also mentioned as major concerns.\n\nOverall, the sentiment of the commenters is mixed. While there is recognition of the challenges faced by small businesses, there is also optimism and admiration for those who have found ways to thrive in this difficult time. However, the lack of support and uncertainty regarding the future has resulted in a sense of frustration and worry among many. \n\nThe comment with the most upvotes is from user u/Squiddlyfish53, who shares their experience as a small business owner and addresses the importance of community support. They state, \"Sometimes small businesses are surviving not because of government support but because of the support of the local community. It's important to remember to shop local and support those businesses struggling right now.\" This comment highlights the resilience and determination of small businesses, as well as the crucial role played by community support.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]