[
  {
    "Link": "A customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After realizing the item wasn't suitable, they returned it, paying $14 for shipping. However, USPS marked the package as \"unclaimed\" after three delivery attempts, and it was returned to the sender. The customer contacted the business for a refund, but the business refused to pay for the return shipping and insisted on receiving the item to process the refund, resulting in the customer facing an additional $14 cost. The customer is frustrated and considering a chargeback, feeling the business is not honoring its return policy fairly.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post in question follows a customer's frustrating experience with a small business's return policy. The customer ordered a $50 item with a \"30-day return\" and \"100% satisfaction guarantee,\" but after realizing the item was not suitable, they returned it and paid $14 for shipping. However, USPS marked the package as \"unclaimed\" and returned it to the sender, resulting in the customer facing an additional $14 cost for shipping. The business refused to cover the return shipping and insisted on receiving the item for a refund, causing frustration for the customer and leading them to consider a chargeback. Key positive points raised by commenters include praising the customer's decision to try and return the item even though it resulted in additional costs, and applauding the business for having a return policy in the first place. Main concerns raised by commenters include the lack of transparency from the business regarding their return process, and the unfairness of the customer having to bear the burden of the return shipping costs. The overall sentiment of commenters is one of frustration and disappointment with the business's handling of the situation. The most upvoted comment expresses sympathy for the customer and calls for businesses to have more reasonable return policies.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]