[
  {
    "Link": "A customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After realizing the item wasn't suitable, they returned it, paying $14 for shipping. However, USPS marked the package as \"unclaimed\" after three delivery attempts, and it was returned to the sender. The customer contacted the business for a refund, but the business refused to pay for the return shipping and insisted on receiving the item to process the refund, resulting in the customer facing an additional $14 cost. The customer is frustrated and considering a chargeback, feeling the business is not honoring its return policy fairly.",
    "Subreddit": "#N/A",
    "Title": "This Reddit post discusses a customer's experience with a small business's return policy. The company advertised a \"30-day return\" and \"100% satisfaction guarantee,\" but after the customer returned the item and paid $14 for shipping, USPS marked it as \"unclaimed.\" The customer is frustrated because the business refused to pay for return shipping and insisted on receiving the item in order to process the refund, resulting in an additional cost for the customer. \n\nMany commenters praised the customer for trying to return the item instead of simply filing a chargeback. Some also commended them for supporting a small business. However, others raised concerns about the business's lack of communication and not honoring their return policy fairly. Multiple users shared their own personal experiences with similar situations, with some siding with the business and others with the customer. Ultimately, the overall sentiment of the commenters is that the business should have communicated better and been more understanding of the customer's situation. \n\nThe most upvoted comment was, \"As a small business owner myself, I can understand the frustration with returns, but I believe in honoring our policies and treating our customers with respect. The lack of communication and insistence on receiving the item back, resulting in additional costs for the customer, is not a good business practice. The return policy should be honored, and the customer should be refunded for their shipping costs.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]