[
  {
    "Link": "The author started a small baking business in January 2024, initially selling baked goods at farmers markets, which allowed them to leave their jobs at Starbucks. After obtaining wholesale licensing, they began selling to restaurants, but business has slowed, leading them to take two additional jobs to make ends meet. They now work 16-hour days but feel burnt out and trapped, questioning whether continuing the business is worth it. Despite their husband's support, the author struggles with motivation, faces repeated rejection, and feels like an imposter in their role as a business owner, contemplating whether to abandon their entrepreneurial dreams in favor of a more stable job.",
    "Subreddit": "#N/A",
    "Title": "This Reddit post details the struggles of a small business owner who started a baking business in 2024 but is now feeling burnt out and unsure if continuing the business is worth it. The author initially had success selling at farmers markets and getting wholesale licensing, but business has slowed and they are now working 16-hour days to make ends meet. While the author's husband is supportive, they face rejection and question their abilities as a business owner. In the comments, many readers express empathy for the author's situation and encourage them to seek a better work-life balance, while also offering practical advice and words of encouragement. Some key positive points include the author's dedication and passion for their business and the support from their husband. However, the main concerns raised revolve around the author's mental and physical well-being, as well as the financial strain of their business. The overall sentiment of the commenters is one of understanding and support, with many offering words of encouragement and practical advice. The most upvoted comment reads: \"It's important to prioritize your mental and physical health, and it sounds like running this business is taking a toll on both. Remember that it's okay to take a step back and reassess your priorities. You've already accomplished so much, and there's no shame in changing direction if it means taking care of yourself.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]