[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "#N/A",
    "Title": "In this Reddit post, the narrator shares their struggle with entrepreneurship, describing their journey of success with a physical store selling clothing but then encountering difficulties with the shift to online sales due to the pandemic. Despite generating high sales, mismanagement and subsequent failures resulted in the closure of the business and leaving the narrator with 8 million pesos in debt. The attempts at affiliate marketing and launching an ebook also failed, causing feelings of defeat and regret, and raising concerns about their family's financial burden and questioning their ambitions and purpose. Commenters sympathize with the narrator and applaud their bravery in sharing their story. Many offer words of encouragement and suggest taking a break and focusing on freelancing as a more stable option. The most upvoted comment highlights the importance of learning from mistakes and failures and finding new opportunities for success. Overall, the commenters show understanding and empathy towards the narrator's struggles and offer practical advice and support for their future endeavors.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]