[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the author, in their 40s, who has been successfully managing a side hustle that surpasses their full-time job for the past three years. However, due to declining mental and physical health, they resigned without revealing their side hustle. The company offered to adjust their schedule to retain them, but the author questions the feasibility of maintaining the same workload with reduced hours. The author is now considering asking for a raise, despite the risk of future layoffs, as they value the remote work flexibility their current job provides. \n\nThe majority of commenters admire the author's success in their side hustle and commend their decision to prioritize their health. They also praise the author's courage in resigning and considering a raise. However, some raise concerns about the potential negative consequences of asking for a raise, such as being labeled as \"difficult\" by the company and jeopardizing their job security. The overall sentiment of the commenters is supportive and understanding, with many offering advice and sharing personal experiences. \n\nThe most upvoted comment suggests that the author's worth does not solely depend on their job, and they should not be afraid to advocate for themselves and their value. It further emphasizes that one's career should not be prioritized over their mental and physical health.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]