[
  {
    "Link": "The author started their business in 2007 after 18 years at a failing company, leveraging 22 years of experience and client loyalty. They worked from home, avoiding real estate costs, and survived the 2008 crash. Both the author and their husband are self-employed. Despite enduring the COVID-19 pandemic, rising costs (up 50% in 2020) made the business unsustainable. They are now considering a part-time 1099 contract with a long-term vendor, acknowledging they were fortunate not to close in 2020 like many other small businesses.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the author's journey of starting a successful business in 2007 after 18 years at a failing company. The author and their husband are both self-employed and were able to survive the 2008 crash by working from home and avoiding real estate costs. Despite the challenges of the COVID-19 pandemic, the business was unable to sustain due to a 50% rise in costs. The author is now considering a part-time 1099 contract with a long-term vendor and acknowledges their luck in not having to close their business like many others in 2020. \n\nSome key positive points raised in the discussion include the author's resilience and ability to successfully navigate a tough economic climate. Many commenters praised the author's determination and praised their decision to explore alternative options, rather than completely shutting down the business. Additionally, the discussion highlighted the importance of being adaptable and flexible as a small business owner, especially during uncertain times.\n\nMain concerns raised by commenters revolve around the rising costs and the lack of government support for small businesses during the pandemic. Many expressed frustration and empathy for the author's situation and shared their own personal struggles as small business owners. Some also questioned the viability of the 1099 contract option and suggested exploring other options.\n\nOverall, the sentiment of the commenters was sympathetic and supportive towards the author's business struggles. The community shared words of encouragement, advice, and personal experiences, creating a sense of camaraderie and understanding. The comment with the most upvotes highlighted the importance of not giving up and persevering through difficult times, saying, \"Hang in there, many small businesses have gone through this and come out stronger on the other side.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]