[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post revolves around a narrator's struggles with entrepreneurship, which resulted in 8 million pesos ($141,000) in debt. Despite initial success with a physical store, the shift to online sales due to the pandemic and subsequent mismanagement resulted in the business's closure. Attempts at affiliate marketing and launching an ebook also failed, leading to feelings of defeat, regret, and concern for their family's burden. The main positive points discussed by commenters include the narrator's resilience and determination, as well as their willingness to seek advice and explore alternative paths. Concerns were raised about the challenges and risks of entrepreneurship, as well as the impact of failure on one's mental health and relationships. The overall sentiment of the commenters was empathetic and understanding, with many offering words of encouragement and advice. The most upvoted comment emphasizes the importance of self-reflection and learning from past mistakes in pursuing future endeavors.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]