[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post details the struggles of an entrepreneur who incurred 8 million pesos ($141,000) in debt due to mismanagement and failed business ventures, including a physical store, online sales, affiliate marketing, and launching an ebook. Despite generating 29 million pesos ($512,000) in sales, the narrator expresses feelings of defeat, regret, and concern for their family's burden, questioning their ambitions and purpose. Commenters offer words of support and encouragement, urging the narrator to not give up and learn from their mistakes. Some suggest seeking professional help or considering freelancing as a stable path forward. Main concerns raised include the impact on the narrator's family and their financial situation, as well as the difficult decision of letting go of their dreams. The overall sentiment of commenters is empathetic and understanding, with many sharing their own struggles and offering advice and lessons learned. The top comment, with the most upvotes, reads: \"Don't give up! Failure is part of the journey towards success. Keep pushing and never stop learning.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]