[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "#N/A",
    "Title": "This Reddit post discusses the struggles of an entrepreneur who has accumulated 8 million pesos in debt due to failed business endeavors. Despite initial success with a physical store, the shift to online sales during the COVID-19 pandemic led to taking out loans and ultimately closure of the business. Attempts at affiliate marketing and launching an ebook also resulted in failure, causing the narrator to question their ambitions and purpose. They seek advice on whether to let go of their dreams and consider freelancing as a more stable path. The commenters sympathize with the narrator's situation and commend their bravery for opening up about their failures. Some suggest taking a break and reevaluating their options, while others offer practical advice on managing debt and finding a mentor. The main concerns raised include the impact of the narrator's financial struggles on their family and the fear of further failure. The overall sentiment of the commenters is one of empathy and support, with many sharing their own experiences and lessons learned from failures. The top upvoted comment advises the narrator to shift their focus from \"making money\" to \"building something valuable.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]