[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "The Reddit post discusses a person in their 40s who has successfully managed a side hustle for the past three years that outperforms their full-time job. Due to declining mental and physical health, the author resigned from their job without disclosing their side hustle. While the company offered to adjust their schedule to retain them, the author doubts the feasibility of this arrangement. They are now considering asking for a raise, which may designate them for future layoffs, but value the remote work flexibility their current job provides. \nMany commenters praise the author for their success and offer support for their decision to prioritize their health and side hustle. Others suggest negotiating with the company for better benefits or finding a new job that aligns with their passion and side hustle. The main concerns raised revolve around the uncertainty of job security and the importance of finding a balance between work and personal life. The overall sentiment is one of encouragement and understanding, with many urging the author to prioritize their well-being and not let fear hold them back. The most upvoted comment summarizes this sentiment, stating \"Your health and happiness should always come first. A new job with a schedule that better aligns with your side hustle may be a better option.?",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]