[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post discusses an entrepreneur's struggles with building a successful business, leading to 8 million pesos in debt. Despite initially achieving success with a physical store, the shift to online sales during the pandemic and attempts at affiliate marketing and launching an ebook all resulted in further financial failure. This has left the narrator feeling defeated, regretful, and worried for their family's well-being. The comments on the post sympathize with the narrator's situation and offer support and advice, acknowledging the difficult reality of entrepreneurship and the impact of the pandemic. Many suggest seeking a stable job or freelancing as a more secure path forward, while others encourage the narrator to learn and improve from their past mistakes. As one commenter with the most upvotes states, \"Don't be too hard on yourself. Learn from this experience and move on.\" Overall, the discussion shows a mix of empathy and practical advice for the narrator's difficult situation.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]