[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post discusses a person in their 40s who has been successfully managing a side hustle for the past three years, which has outperformed their full-time job. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. The company offered to adjust their schedule to retain them, but the author doubts the feasibility of reduced hours while maintaining the same workload. They are now considering asking for a raise, even at the risk of future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides. \n\nMany commenters praise the author for their success in their side hustle and commend them for prioritizing their mental and physical health. They also applaud the author for having the courage to leave their job and pursue their side hustle full-time. Several commenters also advise the author to negotiate for a raise or better working conditions. However, some express caution about asking for a raise, as it may make the author a target for future layoffs. Others suggest seeking employment with a company that values remote work and work-life balance. The overall sentiment of the commenters is supportive and understanding, with many also sharing similar experiences and offering advice. \n\nThe comment with the most upvotes reads, \"Congratulations on your success with your side hustle! That takes a lot of hard work and dedication. Don't be afraid to negotiate for what you deserve. Your mental and physical health should always come first.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]