[
  {
    "Link": "The author is reading Walter Deibel's \"Buy then Build,\" which outlines the concept of acquisition entrepreneurship. He presents a scenario where an entrepreneur buys a $1M business with $200k SDE, invests $100k, and finances the rest with a 90% SBA loan. The entrepreneur aims to grow the business's revenue by 10% annually and sell it for $3-4M in ten years. The author questions the feasibility of consistently achieving a 10% growth rate over a decade and seeks insights on business niches that could support this growth.",
    "Subreddit": "",
    "Title": "The post discussed the concept of acquisition entrepreneurship and its application to buying a $1M business with a 90% SBA loan. The author questions the feasibility of consistently achieving a 10% annual growth rate over a decade and seeks insights on business niches that could support this growth. Commenters generally agree that the idea of acquisition entrepreneurship is a good way to start a business, highlighting the benefits of buying an established business compared to starting from scratch. They also acknowledge the potential challenges and risks, such as the difficulty in achieving consistent growth and the possibility of overvaluing the business. Some suggest focusing on industries with high demand, such as technology, healthcare, and renewable energy, to sustain long-term growth. However, others caution against relying solely on industry trends and emphasize the importance of careful market analysis and solid business strategy. The overall sentiment leans towards caution and realism, with some expressing a more optimistic outlook. The top upvoted comment states, \"It's a great beginning, without a doubt - but there are many factors to think about before buying a business. Market research and analysis, the underlying management and employees, and your own leadership skills all play a big role in the ultimate success.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]