[
  {
    "Link": "A customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After realizing the item wasn't suitable, they returned it, paying $14 for shipping. However, USPS marked the package as \"unclaimed\" after three delivery attempts, and it was returned to the sender. The customer contacted the business for a refund, but the business refused to pay for the return shipping and insisted on receiving the item to process the refund, resulting in the customer facing an additional $14 cost. The customer is frustrated and considering a chargeback, feeling the business is not honoring its return policy fairly.",
    "Subreddit": "",
    "Title": "This Reddit post centers around a customer's frustrating experience with a small business's return policy. The customer had ordered a $50 item and returned it within the 30-day return window, but due to issues with delivery, the package was marked as \"unclaimed\" and returned to the business. The customer was then faced with additional return shipping costs and felt that the business was not honoring their return policy fairly. \n\nThe majority of commenters sympathized with the customer and expressed disappointment with the business's handling of the situation. Many praised the customer for being understanding and patient, and for following the proper steps in trying to return the item. There was also appreciation for the customer's efforts in supporting a small business. \n\nThe main concerns raised were the lack of communication and cooperation from the business, as well as the added cost and inconvenience for the customer. Commenters also highlighted the importance of clear return policies and proper handling of customer returns. \n\nOverall, the sentiment of the commenters leaned towards frustration and disappointment with the business. Many expressed that they would also consider a chargeback if faced with a similar situation. The comment with the most upvotes was from a user who suggested the use of a credit card chargeback as a last resort, and also advised the customer to leave a negative review to warn others.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]