[
  {
    "Link": "The owner of a custom suit shop on Etsy, with 450 sales and $54.8K revenue since launching online in October 2023, details the sudden suspension of their shop. Despite a history of handmade products and attempts to communicate with customers about overdue custom orders, Etsy suspended the shop without prior warnings. The suspension was triggered by customers opening cases due to overdue orders, leading to immediate refunds from Etsy. The owner suspects a false review from a dissatisfied customer and points out inconsistencies in Etsy's enforcement, such as other shops using stolen images remaining active. The situation has caused severe anxiety, as they have outstanding orders, employees to support, and significant materials on hand. The owner expresses frustration with Etsy's policies and urges caution for other small businesses reliant on the platform.",
    "Subreddit": "",
    "Title": "In this Reddit post, craft business owner shared their experience with the sudden suspension of their Etsy shop, despite having a successful history on the platform. Despite having a loyal customer base and communicating with them about delayed orders, the shop was suspended without any prior warnings. This was triggered by customers opening cases for overdue orders, resulting in immediate refunds from Etsy. The owner believes their shop was unfairly targeted due to a false review, and points out inconsistencies in Etsy's enforcement of policies, such as allowing shops using stolen images to remain active. This has caused severe anxiety for the owner, as they have outstanding orders, employees to support, and a significant amount of materials on hand. Many commenters expressed frustration with Etsy's policies and urged caution for other small businesses relying on the platform. The top comment, with the most upvotes, stated, \"Etsy needs to be more transparent and consistent in their enforcement of policies, or else they risk driving away small businesses that rely on the platform.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]