[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post shares the struggles of an entrepreneur who accumulated 8 million pesos in debt despite initial success with a physical store before the COVID-19 pandemic. Despite generating 29 million pesos in sales, mismanagement, and failed attempts at affiliate marketing and launching an ebook led to the business's closure. The narrator expresses feelings of defeat, regret, and concern for their family's burden, questioning their ambitions and purpose. Commenters offered support and advice, encouraging the narrator to not give up on their dreams and consider freelancing as a more stable path. Concerns were raised about financial management and taking on too much debt. The overall sentiment was empathetic and positive, with commenters sharing their own experiences and offering practical tips and words of encouragement. The most upvoted comment highlighted the importance of seeking professional help and being open to pivoting in a difficult business climate: \"Don't give up on your dreams, but also be open to pivoting and seeking guidance from experts in managing your finances. Freelancing can be a great option for now, but don't abandon your entrepreneurial spirit.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]