[
  {
    "Link": "The author started a product-based business in 2019 and, despite raising $400,000 and generating $100,000 in sales, ultimately shut down in January due to poor sales. They emphasized the learning experience gained, particularly in SEO, which generated some revenue. Transitioning to a full-time videographer role allowed for better income and travel opportunities. The author has since launched a new venture, Biking West, focusing on the niche of bikepacking with a diversified revenue model including e-commerce, affiliate marketing, and more. They aim for modest financial goals and hope to create a remote business that allows them to split time between Colorado and Tucson. The desire to stay entrepreneurial remains strong.",
    "Subreddit": "#N/A",
    "Title": "The author of a 2019 product-based business that received $400,000 in funding and generated $100,000 in sales, but ultimately shut down due to poor sales, shared their experience on Reddit. They highlighted the valuable knowledge gained in SEO, which led to some revenue, and their transition to a full-time videographer role for better income and travel opportunities. They have now launched a new venture, Biking West, with a diverse revenue model, including e-commerce and affiliate marketing. The author's goals are modest and they hope to create a remote business that allows them to split time between Colorado and Tucson, while remaining entrepreneurial. The discussion was mostly positive, with commenters praising the author's determination and ability to learn from their previous business venture. Concerns were raised about the potential lack of focus on their new project and the possibility of burning out. Overall, the sentiment was supportive and encouraging, with many offering suggestions and advice for the author's new venture. The comment with the most upvotes was: \"The fact that you're able to pivot and learn from your previous business shows that you have the drive and skills to be successful in your new venture. Good luck!\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]