[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "In this Reddit post, the author, in their 40s, reveals that they have been successfully managing a side hustle for the past three years, which has been outperforming their full-time job. However, due to declining mental and physical health, they have resigned from their job without disclosing their side hustle. While their company offered to reduce their hours in order to retain them, the author doubts the feasibility of maintaining their workload with reduced hours. Now, they are considering asking for a raise, despite the potential risk of being designated for future layoffs, as they value the remote work flexibility of their current job and see it as the end of their corporate career. \n\nThe commenters in this thread have generally applauded the author for their success in managing a side hustle and support their decision to prioritize their well-being. Many have also shared similar experiences, with some advising the author to take care of themselves first and pursue their side hustle as a full-time job. Some have suggested that the author may be more productive and successful with the flexibility and autonomy that their side hustle provides. However, concerns have been raised about the potential impact on the author's financial stability, especially considering the current economic climate. \n\nOverall, the sentiment among commenters is one of admiration for the author's entrepreneurial spirit and concern for their well-being. The comment with the most upvotes is one that encourages the author to prioritize their mental and physical health and pursue their side hustle full-time.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]