[
  {
    "Link": "The owner of a handmade custom suit shop on Etsy detailed their sudden suspension from the platform after achieving $54.8K in sales with around 450 orders since launching online in October 2023. Despite having a solid operation, they received multiple emails from customers opening cases due to overdue orders, primarily because many buyers failed to provide necessary measurements for custom suits. The owner highlighted that they had not received any prior warnings from Etsy and had numerous satisfied customers, although there were some negative reviews, including a false claim from a customer in Japan. The shop?s suspension has created significant financial strain, as they have outstanding orders and fabric stock, leading to anxiety and uncertainty about fulfilling commitments. The owner expressed frustration with Etsy and cautioned others about relying too heavily on a single platform for their business.",
    "Subreddit": "#N/A",
    "Title": "The owner of a handmade custom suit shop on Etsy recently shared their experience of being suddenly suspended from the platform, despite achieving $54.8K in sales and having around 450 orders since launching in October 2023. While the shop had a solid operation and many satisfied customers, they received multiple emails from customers opening cases due to overdue orders, mainly due to buyers failing to provide necessary measurements for custom suits. The owner expressed frustration with Etsy and warned others about relying too heavily on a single platform for their business. Many commenters pointed out that the shop's suspension seemed unjustified, especially given their high sales and positive reviews. However, some also raised concerns about the shop's customer service and urged them to be more proactive in communicating with customers about measurement requirements. Overall, there was a sense of empathy and frustration towards the shop's situation, with many offering advice and support. The comment with the most upvotes stated, \"Etsy really needs to do better in terms of communication and transparency. This situation could have been avoided if they had given the shop owner proper warnings and guidelines.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]