[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "In a Reddit post, a person in their 40s shares their success in managing a lucrative side hustle while also working full-time. However, due to declining health, they have resigned from their job without revealing the side hustle. The company offered to adjust their schedule to keep them, but the author is unsure if it is feasible while maintaining the same workload. They are considering asking for a raise, even if it puts them at risk for future layoffs, because they view their current job as the end of their corporate career and value the flexibility it offers. The discussion highlights the positive aspect of the author's success in their side hustle, as well as the potential repercussions of disclosing it to their employer. Many commenters express support for the author's decision to prioritize their health and side hustle, but also raise concerns about the possible consequences of asking for a raise and navigating a reduced work schedule. Some suggest discussing the situation with a lawyer or seeking other job opportunities with better work-life balance. The overall sentiment is sympathetic towards the author's situation, but also highlights the complexities and risks involved in their decision. The comment with the most upvotes is: \"Your health and happiness should come first, and it seems like you've found a great work-life balance with your side hustle. It's a tough decision, but ultimately, you have to do what's best for you.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]