[
  {
    "Link": "The author started their business in 2007 after 18 years at a failing company, leveraging 22 years of experience and client loyalty. They worked from home, avoiding real estate costs, and survived the 2008 crash. Both the author and their husband are self-employed. Despite enduring the COVID-19 pandemic, rising costs (up 50% in 2020) made the business unsustainable. They are now considering a part-time 1099 contract with a long-term vendor, acknowledging they were fortunate not to close in 2020 like many other small businesses.",
    "Subreddit": "",
    "Title": "After reviewing the comments on the Reddit post about a small business owner who started her business in 2007, there were a few key themes that emerged. The author had 22 years of experience and was able to leverage client loyalty to start her business. They also worked from home, avoiding real estate costs, and were able to survive the 2008 economic crash. Despite enduring the challenges of the COVID-19 pandemic, rising costs made the business unsustainable, and now the author is considering a part-time contract with a long-term vendor. \n\nMany commenters applauded the author's resilience and ability to adapt to difficult situations, citing her successful business as a testament to her hard work and determination. The fact that the author and her husband are both self-employed was also seen as a positive, with some commenters pointing out the benefits of being your own boss. However, concerns were raised about the rising costs and their impact on the business' sustainability. Some commenters also shared their own struggles as small business owners and how the pandemic has affected their businesses. \n\nOverall, the sentiment among commenters was empathetic and supportive, with many offering words of encouragement and advice for the author. One of the top-voted comments summarized it well: \"Hats off to you for surviving this long in the small business world. It's never easy, especially during a pandemic.\" This comment highlights the challenges faced by small business owners and acknowledges the author's determination and resilience.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]