[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "This Reddit post shares the struggles of an entrepreneur who accumulated 8 million pesos in debt due to a series of failed business ventures, including a physical store, online sales, affiliate marketing, and an ebook launch. Despite generating 29 million pesos in sales, mismanagement and other issues led to the closure of the business. The narrator expresses feelings of defeat and regret and seeks advice on whether to let go of their dreams and pursue freelancing instead. \n\nMany commenters offer words of encouragement and remind the narrator not to give up, as failure is a natural part of entrepreneurship. They suggest seeking professional help to manage the debt and moving on to more profitable ventures. Some also share their own experiences with failure and reiterate that it is not the end but rather an opportunity to learn and improve. \n\nOn the other hand, some express concern for the narrator's financial and mental well-being, cautioning against taking on more debt and advising to prioritize stability and family. They suggest taking a break and reevaluating their goals and values before moving forward. \n\nThe overall sentiment is one of empathy and support, with many expressing admiration for the narrator's determination and resilience. The most upvoted comment reminds the narrator that \"a failed business doesn't reflect on your worth as a person\" and encourages them to prioritize their mental health and well-being above all else.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]