[
  {
    "Link": "The author has spent 13 years freelancing as a design engineer, often feeling undervalued and struggling financially, with their health deteriorating over time. They transitioned to starting their own business but have yet to generate income, mainly focusing on securing Small Business Innovation Research (SBIR) funding, which is highly competitive. Despite the challenges, they see potential for significant income if successful. Currently facing financial strain, including late bills and rent, they have been offered a full-time job that may distract from their business efforts, but they feel it necessary for immediate income. They express frustration over their situation, the cyclical nature of their struggles, and the difficulty in finding quality freelance work outside of Craigslist, ultimately seeking advice and support.",
    "Subreddit": "",
    "Title": "The author of this Reddit post has been freelancing as a design engineer for 13 years and has faced challenges with feeling undervalued and struggling financially. Their health has also deteriorated over time, leading them to transition to starting their own business. However, they have yet to generate income and are mainly focused on securing highly competitive Small Business Innovation Research (SBIR) funding. They express frustration with their cyclical struggles and the difficulty in finding quality freelance work outside of Craigslist. Despite the potential for significant income, the author is currently facing financial strain and has been offered a full-time job that may distract from their business efforts. The commenters offered advice and support, highlighting the importance of balance and self-care. The overall sentiment was sympathetic and encouraging, with many sharing their own experiences and offering suggestions for alternative sources of income. The most upvoted comment emphasizes the need for self-care and cautions against taking on too much to the detriment of one's mental health.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]