[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post follows the struggles of an entrepreneur who has accumulated 8 million pesos in debt after initially finding success with a physical store selling clothing. Despite generating 29 million pesos in sales, the entrepreneur's shift to online sales and mismanagement resulted in the business's closure. They describe feelings of defeat, regret, and concern for their family's financial burden and seek advice on potentially giving up their dreams. However, many commenters offer words of encouragement, noting the narrator's determination and effort in trying to make their business work. Some suggest seeking financial counseling or taking on freelance work as a more stable path forward. Key concerns raised include the impact of COVID-19 on small businesses and the need for proper business management skills. The overall sentiment of the commenters is empathetic, with many sharing their own experiences and offering support to the entrepreneur. The comment with the most upvotes reads, \"You've got to admire the tenacity... Sometimes starting over can be the best thing you can do, learn from your mistakes, but never give up on your dreams.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]