[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "In this Reddit post, a narrator shares their struggles with entrepreneurship, including accumulating 8 million pesos in debt from failed ventures. They initially found success with a physical store but faced challenges when the COVID-19 pandemic shifted their business online. Despite achieving 29 million pesos in sales, mismanagement and further failures led to the business's closure. The narrator expresses regret, defeat, and concern for their family's financial burden, questioning their ambitions and purpose. Commenters offer empathy and advice, highlighting the importance of learning from mistakes, seeking help, and not giving up. Some suggest utilizing their past experiences to improve in the future or considering other business opportunities. The overall sentiment is understanding and supportive, with many encouraging the narrator not to let go of their dreams entirely. The most upvoted comment shares personal experiences and encourages the narrator to take care of themselves emotionally and financially before pursuing new opportunities.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]