[
  {
    "Link": "A customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After realizing the item wasn't suitable, they returned it, paying $14 for shipping. However, USPS marked the package as \"unclaimed\" after three delivery attempts, and it was returned to the sender. The customer contacted the business for a refund, but the business refused to pay for the return shipping and insisted on receiving the item to process the refund, resulting in the customer facing an additional $14 cost. The customer is frustrated and considering a chargeback, feeling the business is not honoring its return policy fairly.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post outlines a customer's frustration with a small business's return policy. The business offered a 30-day return and 100% satisfaction guarantee, but when the customer tried to return a $50 item, they were charged an additional $14 for shipping. After USPS marked the package as \"unclaimed,\" the customer contacted the business for a refund, but the business refused to cover the return shipping and insisted on receiving the item before issuing a refund. This has left the customer considering a chargeback and feeling that the business is not honoring its return policy fairly. \nThe main positive points raised by commenters include the customer's right to a refund and the importance of honoring a stated return policy. Many also highlighted the need for clear communication and understanding between both the customer and the business. However, the main concerns raised revolve around the additional cost incurred by the customer and the lack of understanding from the business's end. The overall sentiment of the commenters is one of frustration towards the business's handling of the situation. The most upvoted comment, with over 200 upvotes, directly addresses the customer's predicament and suggests reaching out to the business's customer service to resolve the issue.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]