[
  {
    "Link": "A customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After realizing the item wasn't suitable, they returned it, paying $14 for shipping. However, USPS marked the package as \"unclaimed\" after three delivery attempts, and it was returned to the sender. The customer contacted the business for a refund, but the business refused to pay for the return shipping and insisted on receiving the item to process the refund, resulting in the customer facing an additional $14 cost. The customer is frustrated and considering a chargeback, feeling the business is not honoring its return policy fairly.",
    "Subreddit": "#N/A",
    "Title": "The group discussion on Reddit revolves around a customer's negative experience with a small business's return policy. The customer ordered a $50 item with a 30-day return and 100% satisfaction guarantee but returned it after realizing it wasn't suitable, paying $14 for shipping. However, the package was marked as \"unclaimed\" by USPS and returned to the sender. The business refused to cover the return shipping and insisted on receiving the item before issuing a refund, leaving the customer facing an additional $14 cost. Commenters expressed frustration and disappointment, feeling the business is not honoring its return policy fairly. Key positive points include support for the customer and suggestions for the business to improve its communication and policies. Main concerns raised include the inconvenience and extra cost for the customer, as well as the business's lack of empathy and transparency. The overall sentiment is negative towards the business, with many commenters considering a chargeback and urging others to avoid supporting the company. The top comment with the most upvotes states, \"This is a prime example of a business not standing by their policies and causing inconvenience and frustration for the customer. I would definitely avoid buying from them again.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]