[
  {
    "Link": "The author shares their journey of selling their first business, which involved trading Steam skins while being a full-time college student. They started with a $20 gift card in Spring 2017 and gradually built an inventory worth $6,000 through strategic marketing and influencer ads. Over time, they faced challenges like declining profits and issues with an investor, ultimately leading to a slowdown in business activity to focus on school. They sold 90% of the site for $2,200 in Spring 2019. Key highlights include a user base growth to over 40,000, $12,000 in withdrawals, and a total revenue of approximately $17,000. The experience exposed them to entrepreneurship, marketing, and development, and they are now considering future business opportunities.",
    "Subreddit": "#N/A",
    "Title": "In this Reddit post, the author shares their journey of selling their first business, which involved trading Steam skins while being a full-time college student. They started with a $20 gift card in Spring 2017 and built an inventory worth $6,000 through strategic marketing and influencer ads. Despite facing challenges such as declining profits and issues with an investor, they managed to grow their user base to over 40,000 and make $12,000 in withdrawals, resulting in a total revenue of approximately $17,000. The experience exposed them to entrepreneurship, marketing, and development, and they are now considering future business opportunities. The post generated a lot of positive feedback, with commenters praising the author for their creativity and determination. However, some raised concerns about the potential risks of trading in the Steam skin market and the importance of balancing school and business. Overall, the sentiment among commenters was encouraging and supportive, with many sharing their own experiences and offering advice. The top upvoted comment highlighted the valuable lessons the author learned through this experience.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]