[
  {
    "Link": "In Spring 2017, a college student began trading Steam skins with a small investment, eventually developing a trading site for Rust with the help of a programmer, Michel. By the end of 2017, the business had grown significantly, reaching 16,000 users and generating $1,100 monthly profit. However, by Winter 2018, profits declined due to marketing challenges and increased expenses. After ceasing development to focus on school, the owner sold 90% of the site for $2,200 in Spring 2019. Key takeaways include learning about development, marketing, and entrepreneurship, and ultimately withdrawing over $12,000 in profits from initial investments. The experience fostered a newfound interest in the business world.",
    "Subreddit": "",
    "Title": "This Reddit post discusses the journey of a college student who started trading Steam skins with a small investment in Spring 2017, eventually developing a successful trading site for Rust with a programmer's help. The business grew significantly, reaching 16,000 users and generating $1,100 monthly profit by the end of 2017 but faced challenges such as marketing issues and increased expenses in Winter 2018, leading to a decline in profits. The owner then sold 90% of the site for $2,200 in Spring 2019, after ceasing development to focus on school. The experience taught valuable lessons in development, marketing, and entrepreneurship, ultimately yielding over $12,000 in profits from initial investments and sparking a newfound interest in the business world. \n\nMany commenters praised the college student for their entrepreneurial spirit and for learning important skills through this experience. Some also highlighted the impressive growth of the business in a short period, generating significant profits. \n\nHowever, the main concerns raised were the decline in profits and the owner's decision to sell the site, which many deemed as undervalued at $2,200. Some also questioned the long-term sustainability of this type of business and the owner's decision to prioritize school over the site's development. \n\nOverall, the sentiment of the commenters was positive, with many admiring the owner's success and determination. Some also shared similar experiences and offered valuable advice for future endeavors in the business world. \n\nThe comment with the most upvotes was, \"It's inspiring to see how much you've achieved at such a young age. This experience will definitely serve you well in the future, no matter what path you choose.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]