[
  {
    "Link": "The author has spent 13 years freelancing as a design engineer, often feeling undervalued and struggling financially, with their health deteriorating over time. They transitioned to starting their own business but have yet to generate income, mainly focusing on securing Small Business Innovation Research (SBIR) funding, which is highly competitive. Despite the challenges, they see potential for significant income if successful. Currently facing financial strain, including late bills and rent, they have been offered a full-time job that may distract from their business efforts, but they feel it necessary for immediate income. They express frustration over their situation, the cyclical nature of their struggles, and the difficulty in finding quality freelance work outside of Craigslist, ultimately seeking advice and support.",
    "Subreddit": "",
    "Title": "The author of the Reddit post has spent 13 years as a design engineer and has faced constant struggles, feeling undervalued and struggling financially, while their health has deteriorated. They have recently transitioned to starting their own business, but the focus on securing highly competitive Small Business Innovation Research (SBIR) funding has yet to generate income. Despite potential for significant income, the author is currently facing financial strain and has been offered a full-time job, which may take away from their business efforts. The cyclical nature of their struggles and difficulty finding quality freelance work, outside of Craigslist, has led to frustration and the author is seeking advice and support. Commenters have expressed empathy and offered advice, with many highlighting the potential for success with the author's business and applauding their determination to make it work. The main concerns raised include the need for immediate income and balancing the demands of a full-time job with the pursuit of the author's own business. The overall sentiment of the commenters is one of understanding and encouragement, highlighting the challenges of freelance work and the potential rewards of perseverance. The top upvoted comment reads, \"Hang in there, it may be tough now but it sounds like your business has a lot of potential.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]