[
  {
    "Link": "A small UK engineering company specializing in waterproof cables faced difficulties when an overseas customer in the UAE requested a custom product. After successfully agreeing on specifications, issues arose during the onboarding process, particularly around payment terms. The customer insisted on net 60 payments, which the owner found untenable due to the upfront costs of custom work. After much negotiation, the best offer was net 30, still risky for the owner. Ultimately, the owner chose not to proceed with the order, prioritizing peace of mind over financial risk. They sought to hear from others about similar experiences with large companies.",
    "Subreddit": "",
    "Title": "This Reddit post discusses a small UK engineering company's difficulties when dealing with an overseas customer's request for a custom product. Despite reaching an agreement on specifications, issues arose during the onboarding process, particularly with payment terms. The customer insisted on net 60 payments, which the owner found challenging due to upfront costs. After much negotiation, the best offer was net 30, still considered risky for the owner. Ultimately, the owner chose not to proceed with the order, prioritizing peace of mind over financial risk. The comments on the post expressed sympathy for the company's experience and shared similar struggles with large companies. Key positive points included the owner's wise decision to prioritize peace of mind and the community's support and advice for dealing with difficult clients. Main concerns raised revolved around the power imbalance between small businesses and large companies, as well as the challenges of international trade. The overall sentiment among commenters was one of understanding and empathy towards the small business owner's difficult decision. The comment with the most upvotes was from a commenter who shared their personal experience with a similar situation: \"I had a similar experience with a large company, ended up losing money rather than risking my peace of mind.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]