[
  {
    "Link": "The author, a budding designer since high school, shares a pivotal experience that shattered their confidence when a major client underpaid for a significant branding project due to personal reasons. Despite having dedicated immense effort to the project, the disappointing outcome led them to pause their design work and focus on college. As they near graduation, they struggle with low self-esteem, charging low rates out of fear of rejection, and facing persistent doubts about their value. They seek advice from others who have faced similar challenges, expressing a desire to overcome these issues and rebuild their confidence.",
    "Subreddit": "",
    "Title": "The Reddit post shares the experience of a budding designer who faced a setback in their confidence after being underpaid by a major client for a branding project due to personal reasons. Despite their dedication, the disappointing outcome led them to pause their design work and focus on college. As they near graduation, they struggle with low self-esteem, charging low rates out of fear of rejection, and doubts about their value. The post received a lot of positive responses, with many commenters sharing their own experiences and offering advice for overcoming similar challenges. Many highlighted the importance of valuing oneself and charging fair rates, while also acknowledging that facing rejection is a normal part of being a designer. The main concerns raised were the impact of the disappointment on the author's self-confidence and ability to value their work, as well as the fear of facing similar situations in the future. The overall sentiment of the commenters was one of support and encouragement, with many offering words of wisdom and expressing their belief in the author's abilities. The comment with the most upvotes, by user u/DesignsByEmma, reads: \"I can relate to your situation and I want to remind you that your worth as a designer is not determined by one client's actions. Stay resilient and don't let this experience define you.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]