[
  {
    "Link": "A customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After realizing the item wasn't suitable, they returned it, paying $14 for shipping. However, USPS marked the package as \"unclaimed\" after three delivery attempts, and it was returned to the sender. The customer contacted the business for a refund, but the business refused to pay for the return shipping and insisted on receiving the item to process the refund, resulting in the customer facing an additional $14 cost. The customer is frustrated and considering a chargeback, feeling the business is not honoring its return policy fairly.",
    "Subreddit": "",
    "Title": "The Reddit post in question discusses a customer's frustrating experience with a small business's return policy. The business offers a 30-day return policy and 100% satisfaction guarantee, but the customer encountered issues when trying to return a $50 item. The customer paid $14 for shipping but the package was marked as \"unclaimed\" by USPS and returned to the sender. Despite reaching out to the business for a refund, they were told to pay for the return shipping and send back the item before receiving their refund, resulting in an additional $14 cost. Many commenters sympathized with the customer and expressed frustration with the business's handling of the situation. The key positive points mentioned include the small business's return policy and the customer's willingness to give them a chance. However, main concerns were raised about the lack of transparency and fairness in the business's return process, and some suggested the customer consider a chargeback. Overall, the commenters had a negative sentiment towards the business, feeling that they were not honoring their return policy fairly. The top voted comment, with over 200 upvotes, stated, \"Sounds like the business is not honoring their return policy. If they want the item back, they should cover the return shipping cost.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]