[
  {
    "Link": "The author has been a freelance design engineer for 13 years, earning an estimated $464,616 before taxes, primarily through Craigslist gigs. Despite loving the work when it?s challenging and collaborative, they?ve struggled with low income, poor treatment, declining health, isolation, and financial stress. In recent years, they started a business focused on securing SBIR (Small Business Innovation Research) grants, which could potentially provide significant income and fulfilling work. However, the process is highly competitive, and they?ve yet to secure funding. Currently, they?re facing severe financial difficulties, with overdue bills and rent, and are considering taking a full-time job offered by a former coworker, though it would distract from their business. Despite the challenges, they remain hopeful about the potential of SBIR funding and are preparing multiple proposals for 2020, aiming for a significant financial turnaround. The author feels stuck but is reluctant to give up on their business due to its potential.",
    "Subreddit": "",
    "Title": "In this Reddit post, the author shares their struggles as a freelance design engineer, earning a decent income through Craigslist gigs but facing financial difficulties, isolation, and declining health. They started a business focused on securing SBIR grants but have yet to receive funding. While considering a full-time job, they remain hopeful about the potential of SBIR funding and are preparing multiple proposals for 2020. The community offers words of encouragement and highlights the potential of their business. There is also discussion about the challenges and competitiveness of securing SBIR grants. The overall sentiment is positive, with many commenters expressing sympathy for the author's situation and offering advice and support. The comment with the most upvotes states, \"Hang in there. Your business sounds promising and it can take time to secure funding. Keep pushing and stay positive.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]