[
  {
    "Link": "The owner of a custom suit shop on Etsy, with 450 sales and $54.8K revenue since launching online in October 2023, details the sudden suspension of their shop. Despite a history of handmade products and attempts to communicate with customers about overdue custom orders, Etsy suspended the shop without prior warnings. The suspension was triggered by customers opening cases due to overdue orders, leading to immediate refunds from Etsy. The owner suspects a false review from a dissatisfied customer and points out inconsistencies in Etsy's enforcement, such as other shops using stolen images remaining active. The situation has caused severe anxiety, as they have outstanding orders, employees to support, and significant materials on hand. The owner expresses frustration with Etsy's policies and urges caution for other small businesses reliant on the platform.",
    "Subreddit": "",
    "Title": "This Reddit post discusses the suspension of a custom suit shop on Etsy, with 450 sales and $54.8K revenue since launching online in October 2023. The owner expresses frustration with Etsy's sudden suspension of their shop, which was triggered by customers opening cases for overdue orders and resulted in immediate refunds from Etsy. The owner suspects a false review from a dissatisfied customer and highlights inconsistencies in Etsy's enforcement, such as other shops using stolen images remaining active. Key positive points mentioned by commenters include the owner's attempts to communicate with customers about overdue orders and their handmade products. The main concerns raised include the owner's anxiety about outstanding orders, supporting employees, and significant materials on hand. The overall sentiment of the commenters is one of frustration and caution for other small businesses reliant on Etsy. The most upvoted comment states, \"This is a wake-up call for all small businesses on Etsy to reassess their reliance on the platform and have backup plans in place.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]