[
  {
    "Link": "A small UK engineering company specializing in waterproof cables faced difficulties when an overseas customer in the UAE requested a custom product. After successfully agreeing on specifications, issues arose during the onboarding process, particularly around payment terms. The customer insisted on net 60 payments, which the owner found untenable due to the upfront costs of custom work. After much negotiation, the best offer was net 30, still risky for the owner. Ultimately, the owner chose not to proceed with the order, prioritizing peace of mind over financial risk. They sought to hear from others about similar experiences with large companies.",
    "Subreddit": "",
    "Title": "The Reddit post highlights a small UK engineering company facing challenges when dealing with an overseas customer in the UAE. The customer requested a custom product, but issues arose during the onboarding process, particularly around payment terms. The owner found the customer's request of net 60 payments unreasonable due to upfront costs, but after negotiation, they were able to agree on net 30. However, this was still considered risky and the owner ultimately decided not to proceed with the order, prioritizing peace of mind over financial risk. Commenters in the discussion shared similar experiences with large companies, with some providing positive insights such as recommending the company to seek out a middleman to handle payment issues. Main concerns raised included the difficulties small companies face when dealing with large companies and the need for clearer communication and negotiation from both parties. Overall, the sentiment of the commenters was sympathetic towards the owner and understanding of the challenges they faced. The most upvoted comment read, \"It's unfortunate that small companies often have to take on such risks, but it's important to prioritize one's own financial security.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]