[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "#N/A",
    "Title": "Introduction:\nThe post discusses a 40-year-old individual who has successfully managed a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned without disclosing the side hustle. They are now contemplating asking for a raise, even though it might designate them for future layoffs, as they value their current job for its remote work flexibility.\n\nKey Positive Points:\nMany commenters praised the author for their success with their side hustle and recognized the importance of prioritizing one's health. Some also commended the author for taking a bold step in resigning from their job and pursuing their passion. Others offered advice on ways to approach asking for a raise and finding a work-life balance.\n\nMain Concerns Raised:\nThe main concerns raised by commenters were the potential consequences of asking for a raise, such as being targeted for future layoffs and losing the remote work flexibility. Some also expressed skepticism about the feasibility of maintaining the same workload with reduced hours and warned against making hasty decisions without thoroughly considering all options.\n\nOverall Sentiment:\nThe overall sentiment of the commenters was supportive and empathetic towards the author's situation. Many encouraged the author to prioritize their health and pursue their passion, while also cautioning against the potential risks.\n\nComment with most upvotes:\n\"I think you should definitely ask for a raise. Your health and happiness should come first, and if your side hustle is performing well, you deserve to be compensated for it. Just make sure to have a clear plan in place for how you will manage your workload within reduced hours and be prepared for any potential consequences. Don't let fear hold you back from advocating for yourself.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]