[
  {
    "Link": "The owner of a handmade suit shop on Etsy, which generated $54.8K in revenue with around 450 sales, faced suspension in October 2023 due to a backlog of custom orders and customer satisfaction issues. Despite having a good track record and providing detailed sizing guides and consultations, many overdue orders resulted in customer complaints, leading to case openings and automatic refunds from Etsy. A dispute with a Japanese customer over customs fees and a negative review contributed to the situation. With active orders pending, thousands of dollars in fabric stock, and four employees relying on the business, the owner expressed panic and frustration over the suspension, claiming their attempts to communicate with customers were misconstrued. They urged others in the small business community to diversify their platforms and voiced their discontent with Etsy's handling of the matter.",
    "Subreddit": "#N/A",
    "Title": "In October 2023, the owner of a successful handmade suit shop on Etsy faced suspension due to a backlog of custom orders and customer satisfaction issues. Despite having a good track record and providing thorough sizing guides and consultations, the owner received multiple complaints from customers, resulting in case openings and automatic refunds from Etsy. A dispute with a customer over customs fees and a negative review only added to their troubles. The owner expressed panic and frustration, as their business was their livelihood, and they had four employees relying on it. Many commenters highlighted the need for small businesses to diversify their platforms, as reliance on one platform can be risky. The overall sentiment of the commenters was one of empathy for the owner's situation and criticism towards Etsy's handling of the matter. One comment with the most upvotes stated, \"It's a shame that Etsy is punishing a successful small business like this instead of offering support and understanding.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]