[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post shares the struggles of an entrepreneur who accumulated 8 million pesos in debt over the past few years. Despite initially finding success in a physical store selling clothing, the COVID-19 pandemic forced a shift to online sales, resulting in further debt from loans taken out to expand. Despite generating 29 million pesos in sales, poor management led to business closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden, questioning their ambitions and purpose. Commenters offer understanding and empathy, acknowledging the difficult circumstances the narrator faced. Some suggest taking a break and reflecting on lessons learned, while others suggest finding a stable job. Many encourage the narrator to continue pursuing their dreams and not give up. The overall sentiment is one of support and encouragement, with the top-voted comment being, \"Failures are mere stepping stones on the path to success. Take a breather, regroup and start afresh.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]