[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "#N/A",
    "Title": "In this Reddit post, the author, who is in their 40s, shares their success in managing a side hustle that surpasses their full-time job for the past three years. However, due to declining mental and physical health, they resigned without disclosing their side hustle. The company offered to adjust their schedule, but the author doubts the feasibility of reduced hours with the same workload. They are now considering asking for a raise, even though it may lead to future layoffs, as they value the remote work flexibility and see their current job as the end of their corporate career. \n\nMany commenters on this post applaud the author for their entrepreneurial spirit and successful side hustle, with some sharing similar experiences of juggling a full-time job and a side hustle. They also empathize with the author's struggles with health and understand their decision to resign. However, some express concerns about the author's potential future layoffs and advise them to carefully consider their next steps. Some also raise issues about the company's treatment of employees and suggest seeking legal advice before asking for a raise. The overall sentiment amongst commenters is one of support and encouragement, with many wishing the author the best and offering practical advice. \n\nThe most upvoted comment is one that praises the author for their hard work and suggests that they focus on their side hustle and look for other similar opportunities. The commenter also emphasizes the importance of prioritizing mental and physical health, rather than staying in a toxic job situation.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]