[
  {
    "Link": "The owner of a handmade suit shop on Etsy, which generated $54.8K in revenue with around 450 sales, faced suspension in October 2023 due to a backlog of custom orders and customer satisfaction issues. Despite having a good track record and providing detailed sizing guides and consultations, many overdue orders resulted in customer complaints, leading to case openings and automatic refunds from Etsy. A dispute with a Japanese customer over customs fees and a negative review contributed to the situation. With active orders pending, thousands of dollars in fabric stock, and four employees relying on the business, the owner expressed panic and frustration over the suspension, claiming their attempts to communicate with customers were misconstrued. They urged others in the small business community to diversify their platforms and voiced their discontent with Etsy's handling of the matter.",
    "Subreddit": "#N/A",
    "Title": "This Reddit post discusses the suspension of a successful handmade suit shop on Etsy due to a backlog of custom orders and customer satisfaction issues. Despite the owner's good track record and efforts to provide detailed sizing guides and consultations, numerous customer complaints resulted in case openings and automatic refunds. A dispute with a Japanese customer over customs fees and a negative review added to the situation. The owner expressed panic and frustration over the suspension, as it affected their active orders, fabric stock, and employees. They advised others in the small business community to diversify their platforms and criticized Etsy's handling of the matter. Commenters discussed the importance of clear communication with customers, the need for diversifying sales platforms, and the challenges faced by small businesses on Etsy. The top-rated comment expressed empathy for the owner's situation and questioned Etsy's actions, stating, \"This is a great example of why small businesses need to diversify and not rely on one platform, no matter how successful they may be.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]