[
  {
    "Link": "The author has spent 13 years freelancing as a design engineer, often feeling undervalued and struggling financially, with their health deteriorating over time. They transitioned to starting their own business but have yet to generate income, mainly focusing on securing Small Business Innovation Research (SBIR) funding, which is highly competitive. Despite the challenges, they see potential for significant income if successful. Currently facing financial strain, including late bills and rent, they have been offered a full-time job that may distract from their business efforts, but they feel it necessary for immediate income. They express frustration over their situation, the cyclical nature of their struggles, and the difficulty in finding quality freelance work outside of Craigslist, ultimately seeking advice and support.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the author's 13 years of struggles as a freelance design engineer, with financial instability, deteriorating health, and difficulty finding quality work. They have transitioned to starting their own business, but have yet to generate income due to the highly competitive nature of securing Small Business Innovation Research (SBIR) funding. Despite potential for significant income, they are currently facing financial strain and considering a full-time job for immediate income. Commenters express sympathy for the author's situation, admire their perseverance, and offer practical advice on finding freelance work and managing finances. The main concerns raised include the author's health and well-being, the challenge of securing SBIR funding, and the cyclical nature of their struggles. The overall sentiment is sympathetic and supportive, with expressions of encouragement and helpful resources. The comment with the most upvotes suggests the author should prioritize their health and focus on finding a more stable source of income.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]