[
  {
    "Link": "The author shares their journey of building and selling their first business while being a full-time college student with no prior business experience. Starting with a $20 Steam giftcard in Spring 2017, they traded skins, developed a trading site for Rust, and grew it to 40,000 users and $250,000 in processed trades. Key milestones include hiring developers, investing in influencer ads, and achieving $17,000 in revenue. Despite challenges like scams, declining profits, and balancing school, they sold 90% of the site for $2,200 in Spring 2018, retaining a 10% stake. The experience taught them about entrepreneurship, marketing, and development, netting over $12,000 in profits and valuable lessons for future ventures.",
    "Subreddit": "",
    "Title": "In this Reddit post, the author shares their journey of building and selling their first business while being a full-time college student with no prior business experience. They started with a $20 Steam giftcard in Spring 2017 and through trading skins, developed a successful trading site for the game Rust, with 40,000 users and $250,000 in processed trades. The key milestones include hiring developers, investing in influencer ads, and reaching $17,000 in revenue. Despite facing challenges such as scams, declining profits, and balancing school, they managed to sell 90% of the site for $2,200 in Spring 2018, keeping a 10% stake. This experience taught them valuable lessons in entrepreneurship, marketing, and development, ultimately netting them over $12,000 in profits. \n\nThe commenters on this post had predominantly positive reactions, praising the author for their determination and success in building a profitable business while still in college. They also appreciated the author's openness in sharing their challenges and lessons learned. Some commenters even shared their own similar experiences and offered tips for future ventures. \n\nHowever, there were also some concerns raised, particularly about the author's decision to sell 90% of the business for a relatively low amount. Some also questioned the sustainability and legality of the trading site. \n\nOverall, the sentiment of the commenters was one of admiration for the author's achievement and gratitude for their insights and advice. \n\nThe comment with the most upvotes was from a user who said, \"As someone who is currently studying business and struggling to make ends meet, I find this post incredibly inspiring. Congratulations on your success and thank you for sharing your journey with us!\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]