[
  {
    "Link": "The author has been a freelance design engineer for 13 years, earning an estimated $464,616 before taxes, primarily through Craigslist gigs. Despite loving the work when it?s challenging and collaborative, they?ve struggled with low income, poor treatment, declining health, isolation, and financial stress. In recent years, they started a business focused on securing SBIR (Small Business Innovation Research) grants, which could potentially provide significant income and fulfilling work. However, the process is highly competitive, and they?ve yet to secure funding. Currently, they?re facing severe financial difficulties, with overdue bills and rent, and are considering taking a full-time job offered by a former coworker, though it would distract from their business. Despite the challenges, they remain hopeful about the potential of SBIR funding and are preparing multiple proposals for 2020, aiming for a significant financial turnaround. The author feels stuck but is reluctant to give up on their business due to its potential.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the struggles of a freelance design engineer who has been working for 13 years, primarily through Craigslist gigs, earning an estimated $464,616 before taxes. The author is facing financial difficulties, overdue bills, and rent, and is considering taking a full-time job that may distract from their business, which is focused on securing SBIR grants. Despite the challenges, the author remains hopeful about the potential of SBIR funding and is preparing multiple proposals for 2020. Many commenters empathized with the author's situation and offered words of encouragement, highlighting the author's determination and work ethic. Others shared their own experiences with the SBIR process and offered advice and resources. However, a common concern raised was the highly competitive nature of SBIR grants and the uncertainty of securing funding. Overall, the sentiment of the commenters was sympathetic, with a sense of admiration for the author's perseverance. One comment, which received the most upvotes, advised the author to be open to taking a full-time job if necessary, as financial stability is crucial for the long-term success of their business.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]