[
  {
    "Link": "The writer is concerned about an apparent increase in Stripe payment processor horror stories, where small businesses are having their funds frozen, being asked for enhanced due diligence, and being \"held hostage\". They've noticed a spike in such incidents, particularly when enabling Stripe's RDR feature, and are worried about the power payment processors have over small businesses.",
    "Subreddit": "",
    "Title": "The discussion on the Reddit post revolves around the growing concern over Stripe payment processor horror stories, where small businesses are experiencing frozen funds, requests for enhanced due diligence, and feeling \"held hostage\". The writer has noticed a significant increase in such incidents, especially when enabling Stripe's RDR feature, and is worried about the power that payment processors have over small businesses. \n\nThe main positive points mentioned by commenters include the convenience and ease of use of Stripe as a payment processor and its access to a wide range of customers. Additionally, some have had positive experiences with Stripe and believe that these horror stories are isolated cases.\n\nThe major concerns raised in the discussion revolve around the lack of transparency and clear communication from Stripe when issues arise, leaving businesses feeling frustrated and vulnerable. The possibility of Stripe freezing funds without proper justification or due process is also a cause for concern. The RDR feature also received criticism for potentially making businesses more vulnerable to these issues.\n\nOverall, the sentiment among commenters is one of anxiety and frustration regarding the power that payment processors like Stripe have over small businesses. Many are calling for more transparency, fair treatment, and better communication from Stripe to address these issues. The most upvoted comment reflects this sentiment, stating, \"Payment processors like Stripe need to be held accountable for their actions and provide better support for small businesses.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]