[
  {
    "Link": "A customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After realizing the item wasn't suitable, they returned it, paying $14 for shipping. However, USPS marked the package as \"unclaimed\" after three delivery attempts, and it was returned to the sender. The customer contacted the business for a refund, but the business refused to pay for the return shipping and insisted on receiving the item to process the refund, resulting in the customer facing an additional $14 cost. The customer is frustrated and considering a chargeback, feeling the business is not honoring its return policy fairly.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post discusses a customer's negative experience with a small business's return policy. The business offered a 30-day return and 100% satisfaction guarantee, but after the customer returned the item for not being suitable and paid $14 for shipping, the package was marked as \"unclaimed\" and returned to the sender by USPS. The business refused to pay for the return shipping and insisted on receiving the item back before processing a refund, resulting in an additional $14 cost for the customer. Many commenters express frustration with the business's handling of the situation and suggest that the business should honor their return policy and cover the return shipping costs to provide a truly satisfactory experience for the customer. The overall sentiment is negative, with commenters feeling that the business is not being fair and is potentially losing a customer over this situation. One comment with the most upvotes states, \"If the business truly stands behind their return policy, they should cover the return shipping costs for the customer. Otherwise, they risk losing future business and potentially receiving negative reviews. Customer satisfaction should be a top priority for any business.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]