[
  {
    "Link": "The owner of a handmade suit shop on Etsy, which generated $54.8K in revenue with around 450 sales, faced suspension in October 2023 due to a backlog of custom orders and customer satisfaction issues. Despite having a good track record and providing detailed sizing guides and consultations, many overdue orders resulted in customer complaints, leading to case openings and automatic refunds from Etsy. A dispute with a Japanese customer over customs fees and a negative review contributed to the situation. With active orders pending, thousands of dollars in fabric stock, and four employees relying on the business, the owner expressed panic and frustration over the suspension, claiming their attempts to communicate with customers were misconstrued. They urged others in the small business community to diversify their platforms and voiced their discontent with Etsy's handling of the matter.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post discusses the suspension of a handmade suit shop on Etsy, which has generated a revenue of $54.8K and 450 sales. Despite having a good track record and providing detailed sizing guides and consultations, the shop faced customer dissatisfaction due to a backlog of custom orders, resulting in negative reviews, case openings, and automatic refunds from Etsy. A dispute over customs fees with a Japanese customer also contributed to the owner's panic and frustration over the suspension. The owner urged others in the small business community to diversify their platforms and expressed discontent with Etsy's handling of the situation. Many commenters sympathized with the owner's struggle and agreed that diversifying platforms is necessary in today's competitive market. However, some also pointed out that the owner should have anticipated the risks of relying solely on one platform and should have communicated better with customers. Overall, the commenters expressed concern for the owner's business and emphasized the importance of diversifying platforms to avoid such situations in the future. The comment with the most upvotes stated, \"It's unfortunate, but relying solely on one platform is always a risk, especially with a backlog of custom orders. Diversifying is key in today's market.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]