[
  {
    "Link": "The owner of a handmade suit shop on Etsy, which generated $54.8K in revenue with around 450 sales, faced suspension in October 2023 due to a backlog of custom orders and customer satisfaction issues. Despite having a good track record and providing detailed sizing guides and consultations, many overdue orders resulted in customer complaints, leading to case openings and automatic refunds from Etsy. A dispute with a Japanese customer over customs fees and a negative review contributed to the situation. With active orders pending, thousands of dollars in fabric stock, and four employees relying on the business, the owner expressed panic and frustration over the suspension, claiming their attempts to communicate with customers were misconstrued. They urged others in the small business community to diversify their platforms and voiced their discontent with Etsy's handling of the matter.",
    "Subreddit": "#N/A",
    "Title": "In October 2023, the owner of a successful handmade suit shop on Etsy faced suspension due to a backlog of orders and resulting customer complaints. Despite providing detailed sizing guides and consultations, customer dissatisfaction led to automatic refunds and case openings. A dispute with a Japanese customer and negative review only added to the situation, leaving the owner panicked and frustrated. Many commenters expressed sympathy for the owner and urged others in the small business community to diversify their sales platforms. The main concerns raised were about the suspension process and Etsy's handling of the matter. Some commenters also pointed out that the owner should have been more proactive in communicating with customers about delays. Overall, the sentiment among commenters was one of frustration with Etsy and concern for the owner's business and employees. The comment with the most upvotes was: \"Etsy needs to do better with supporting small businesses and addressing issues like this. The owner did all they could, and it's unfair for them and their employees to suffer because of a backlog and a single negative review.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]