[
  {
    "Link": "https://www.reddit.com/r/news/comments/1ec5955/video_game_performers_will_go_on_strike_over/",
    "Subreddit": "video_game_performers_will_go_on_strike_over",
    "Title": "Introduction: In this Reddit post, users discuss the announcement that video game performers will go on strike over unfair treatment and insufficient compensation. The topic sparks a lively conversation with users sharing both positive points and concerns.\n\nKey Positive Points: Many commenters express support for video game performers, noting the importance of their contributions to the industry and the need for fair treatment. Several users applaud the performers for standing up for their rights and defending their craft. They also appreciate the visibility this strike brings to the issue and hope it will result in better conditions for all performers.\n\nMain Concerns Raised: The main concerns raised in the discussion revolve around the discrepancies between the compensation and treatment of video game performers compared to other entertainment industries. Users highlight the physically and mentally demanding nature of the work and criticize the widespread use of non-union actors in the industry. There are also concerns about the impact of the strike on the production and release of highly anticipated video game titles.\n\nOverall Sentiment: The overall sentiment in the comments is one of support for the strike and the performers' demands for fair treatment and better compensation. Users express frustration with the current state of the industry and hope that this strike will bring about positive change for video game performers.\n\nComment with Most Upvotes: The comment with the most upvotes highlights the need for solidarity among all parties involved in video game production, stating, \"The developers and voice actors need to unite. Without the developers there is no game. Without the voice actors, there is no soul to the game.\" This comment received over 2,500 upvotes, demonstrating the sentiment that unity and collaboration is crucial in achieving fair treatment for all parties involved in the making of video games.",
    "CommentsPerDay": 2.6166666666666667,
    "NumberOfComments": 314,
    "URL": "r/news"
  }
]