[
  {
    "Link": "A small business owner is desperate and lost after losing ?4,000, their entire savings, due to a failed advertising campaign with an agency. Despite 390 orders over 3 years, the business is struggling financially, and the owner is unsure how to proceed, considering quitting or finding alternative solutions, with health issues preventing them from getting a regular job to raise funds.",
    "Subreddit": "",
    "Title": "This Reddit discussion revolves around a small business owner who is facing financial struggles and health issues after losing ?4,000 due to a failed advertising campaign with an agency. Despite having 390 orders over 3 years, the business is still struggling and the owner is feeling lost and desperate for solutions. \n\nThe key positive points mentioned by commenters include offering words of encouragement and support for the business owner, as many can relate to their struggles with small businesses. Some also suggest alternative solutions such as crowdfunding or seeking help from a financial advisor. \n\nThe main concerns raised include the lack of transparency and effectiveness of the advertising agency, the difficulty for small businesses to compete with bigger brands, and the impact of health issues on the owner's ability to raise funds. \n\nThe overall sentiment of the commenters is sympathetic and understanding towards the business owner's struggles, with many offering advice and sharing their own experiences. However, there is also a sense of frustration towards the advertising agency and the challenging nature of running a small business. \n\nThe comment with the most upvotes reads, \"Get advice from someone who knows about small business cash flow and finances, get some help and advice before you stop because that would be very sad.\" This comment highlights the importance of seeking help and advice in difficult situations, and offers a sense of hope for the business owner to find a solution.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]