[
  {
    "Link": "The author has been a freelance design engineer for 13 years, earning an estimated $464,616 before taxes, primarily through Craigslist gigs. Despite loving the work when it?s challenging and collaborative, they?ve struggled with low income, poor treatment, declining health, isolation, and financial stress. In recent years, they started a business focused on securing SBIR (Small Business Innovation Research) grants, which could potentially provide significant income and fulfilling work. However, the process is highly competitive, and they?ve yet to secure funding. Currently, they?re facing severe financial difficulties, with overdue bills and rent, and are considering taking a full-time job offered by a former coworker, though it would distract from their business. Despite the challenges, they remain hopeful about the potential of SBIR funding and are preparing multiple proposals for 2020, aiming for a significant financial turnaround. The author feels stuck but is reluctant to give up on their business due to its potential.",
    "Subreddit": "",
    "Title": "The Reddit post centers around the struggles of a freelance design engineer who has been in the field for 13 years and has earned an estimated $464,616 before taxes, mostly through Craigslist gigs. Despite enjoying challenging and collaborative work, the author has faced numerous difficulties such as low income, poor treatment, declining health, isolation, and financial stress. In recent years, they have shifted their focus towards securing SBIR grants, which has the potential to provide significant income and fulfilling work. However, the highly competitive nature of the process has led to the author facing severe financial difficulties, with overdue bills and rent. The option of taking a full-time job, offered by a former coworker, has also been considered, but it may distract from the author's business. Despite the challenges, the author remains hopeful about the potential of securing SBIR funding and is working towards submitting multiple proposals in 2020. The main concerns raised by commenters include the competitive nature of SBIR grants, the potential distraction of a full-time job, and the author's overall financial stability. The overall sentiment of the commenters is one of empathy and support, with many offering helpful advice and encouragement to the author. The comment with the most upvotes reads, \"Keep pushing forward and don't give up on your dreams. Your hard work and determination will lead to success eventually.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]