[
  {
    "Link": "A small business owner is desperate and lost after losing ?4,000, their entire savings, due to a failed advertising campaign with an agency. Despite 390 orders over 3 years, the business is struggling financially, and the owner is unsure how to proceed, considering quitting or finding alternative solutions, with health issues preventing them from getting a regular job to raise funds.",
    "Subreddit": "",
    "Title": "In this Reddit post, a small business owner shares their struggle after losing their entire savings of ?4,000 due to a failed advertising campaign with an agency. Despite receiving 390 orders over 3 years, the business is still struggling financially and the owner is unsure of what to do next, considering quitting or finding alternative solutions. Health issues are also preventing them from getting a regular job to raise funds. \n\nThe majority of commenters sympathize with the owner's situation and offer words of encouragement and advice. Many suggest reaching out to friends or family for financial support, or finding alternative methods of advertising such as social media or collaborating with other businesses. Some highlight the importance of doing thorough research before working with an agency and learning from the experience. \n\nThe main concerns raised include the financial struggle of the business, the owner's health issues, and the frustration with the failed advertising campaign. Some also mention the possibility of the owner not having enough experience or knowledge in running a successful business. \n\nOverall, the sentiment of the commenters is one of understanding and support for the owner. While there is disappointment and concern for the future of the business, many offer words of encouragement and practical solutions to help the owner overcome this setback. \n\nThe most upvoted comment on this post is \"As someone who has had to deal with the aftermath of a failed business, my advice is to pick yourself up and learn from it. Use this experience to make better decisions in the future.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]