[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "In this Reddit post, the author, in their 40s, has been managing a successful side hustle for the past three years that outperforms their full-time job. They recently resigned due to declining mental and physical health, without disclosing their side hustle. The company offered to adjust their schedule to retain them, but the author is doubtful of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even if it may lead to future layoffs, as they value the remote work flexibility of their current job, which they see as the end of their corporate career. \n\nThe key positive points mentioned by commenters include the author's successful side hustle and their commitment to taking care of their mental and physical health. Many also applaud the author for taking control of their career and contemplating a raise, despite the risk of future layoffs. The overall sentiment is supportive of the author's actions and recognizes the importance of work-life balance. \n\nHowever, some main concerns are raised about the feasibility of reduced hours and whether the company will actually follow through on their offer. Others worry that asking for a raise may jeopardize the author's job security. \n\nThe comment with the most upvotes sums up the general sentiment by stating, \"It takes a lot of courage to prioritize your health and make tough decisions. Kudos to you for doing what is best for you.\" Overall, the discussion centers on the importance of self-care and the challenges of navigating a career while managing physical and mental health.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]