[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "The Reddit post discusses a person in their 40s who has been successfully managing a side hustle for the past three years that has outperformed their full-time job. They have recently resigned from their job due to declining mental and physical health but have not disclosed their side hustle to their employer. The company offered to adjust their schedule to retain them, but the author doubts the feasibility of maintaining the same workload with reduced hours. They are now considering asking for a raise, even though it may lead to future layoffs. The author values their current job as the end of their corporate career and appreciates the flexibility of remote work. \n\nSome commenters commend the author for their successful side hustle and applaud their decision to prioritize their health. Many also express concerns about the potential consequences of asking for a raise or pursuing their side hustle full-time. Some suggest using the leverage of their successful side hustle to negotiate a better schedule or higher salary. Others caution against risking their current job without a solid plan. The overall sentiment of the commenters is one of support and understanding, with many offering helpful advice and sharing similar experiences. \n\nThe most upvoted comment highlights the importance of finding a balance between pursuing passions and maintaining financial stability, stating, \"You have to be brave to leave one job for another or to follow your dreams. But you also have to be smart and strategize for long-term success.\" This comment resonated with many other commenters and received the most upvotes, reflecting the overall sentiment of the thread.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]