[
  {
    "Link": "In Walter Deibel's book \"Buy then Build,\" he explores the concept of acquisition entrepreneurship through a scenario where an entrepreneur buys a $1M business (generating $1.5M in revenue and $200k in seller's discretionary earnings) with a $100k investment and a 90% SBA loan. The author posits that if the business grows at a rate of 10% per year, it could be sold for $3-4M in ten years. The reader raises questions about the feasibility of consistent 10% annual growth and seeks insights on small business niches that could achieve this growth trajectory.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post in question sparked a discussion on Walter Deibel's book \"Buy then Build,\" which discusses the concept of acquisition entrepreneurship through a scenario where an entrepreneur buys a $1M business with a $100k investment and a 90% SBA loan. According to the author's calculations, if the business grows at a rate of 10% per year, it could potentially be sold for $3-4M in ten years. Many commenters view this as a feasible plan, citing examples of successful businesses that have achieved consistent growth. However, there are also concerns raised about the sustainability of 10% growth in the long term and the variability of specific industries and niches. While some believe that certain niche markets, such as technology and healthcare, have the potential to achieve this growth trajectory, others express doubts and highlight the challenges and risks involved. Overall, the sentiment of the commenters is mixed, with some viewing the idea as a sound investment while others are more skeptical. The top-rated comment comes from a user who encourages caution and advises thorough research before embarking on such a venture, stating, \"Just make sure you do thorough market research and due diligence before jumping in. Sometimes the best investments are those that you pass on.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]