[
  {
    "Link": "The author has been a freelance design engineer for 13 years, earning an estimated $464,616 before taxes, primarily through Craigslist gigs. Despite loving the work when it?s challenging and collaborative, they?ve struggled with low income, poor treatment, declining health, isolation, and financial stress. In recent years, they started a business focused on securing SBIR (Small Business Innovation Research) grants, which could potentially provide significant income and fulfilling work. However, the process is highly competitive, and they?ve yet to secure funding. Currently, they?re facing severe financial difficulties, with overdue bills and rent, and are considering taking a full-time job offered by a former coworker, though it would distract from their business. Despite the challenges, they remain hopeful about the potential of SBIR funding and are preparing multiple proposals for 2020, aiming for a significant financial turnaround. The author feels stuck but is reluctant to give up on their business due to its potential.",
    "Subreddit": "",
    "Title": "In this Reddit post, the author, a freelance design engineer for 13 years, shares their struggles with low income, poor treatment, declining health, isolation, and financial stress. Despite these challenges, they started a business focused on securing SBIR grants, which could potentially provide significant income and fulfilling work. However, the competitive process has yet to yield funding, leading to severe financial difficulties. Many commenters acknowledge the potential of SBIR funding and empathize with the author's determination to make their business successful. However, concerns are also raised about the feasibility of relying solely on grants and the potential need for a steady income through a full-time job. The overall sentiment is one of support and encouragement for the author to keep fighting for their business while also being practical about their financial situation. One commenter's sentiment sums it up well, \"You should definitely keep trying for those grants, but in the meantime, it might be necessary to take the full-time job offered by your coworker.\" (Most upvotes: 66)",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]