[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post follows the narrator's journey in entrepreneurship, which left them with 8 million pesos in debt. They had initial success with a physical store, but the COVID-19 pandemic forced a shift to online sales, leading to even more debts. Despite generating 29 million pesos in sales, mismanagement and failed attempts at affiliate marketing and launching an ebook ultimately led to the business's closure. The post expresses feelings of defeat, regret, and concern for their family's burden and questions the narrator's ambitions and purpose. The commenters offered advice on letting go of their dreams and considering freelancing as a more stable path. Key positive points highlighted the importance of learning from past mistakes, taking a break to regroup, and seeking professional help for financial planning. Concerns raised included the need for realistic expectations in entrepreneurship, understanding the risks involved, and not letting failures define one's worth. The overall sentiment of the commenters was empathetic and supportive, with a few sharing their similar struggles and offering words of encouragement. The comment with the most upvotes encouraged the narrator to focus on their own well-being and prioritize taking care of themselves during this difficult time.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]