[
  {
    "Link": "The author has been a freelance design engineer for 13 years, earning an estimated $464,616 before taxes, primarily through Craigslist gigs. Despite loving the work when it?s challenging and collaborative, they?ve struggled with low income, poor treatment, declining health, isolation, and financial stress. In recent years, they started a business focused on securing SBIR (Small Business Innovation Research) grants, which could potentially provide significant income and fulfilling work. However, the process is highly competitive, and they?ve yet to secure funding. Currently, they?re facing severe financial difficulties, with overdue bills and rent, and are considering taking a full-time job offered by a former coworker, though it would distract from their business. Despite the challenges, they remain hopeful about the potential of SBIR funding and are preparing multiple proposals for 2020, aiming for a significant financial turnaround. The author feels stuck but is reluctant to give up on their business due to its potential.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the struggles of a freelance design engineer who has been in the industry for 13 years, earning an estimated $464,616 primarily through Craigslist gigs. While they love their work when it is challenging and collaborative, they have faced low income, poor treatment, declining health, isolation, and financial stress. They have started a business focused on securing SBIR grants for significant income and fulfilling work, but the process is highly competitive and has yet to secure funding. The author is currently facing severe financial difficulties and is considering taking a full-time job, which could distract from their business. The overall sentiment from commenters is one of empathy towards the author's situation, with many offering words of encouragement and advice. Many point out the potential of SBIR funding and the importance of perseverance, while some express concerns about the author's financial stability. The most upvoted comment reinforces the idea of staying hopeful and not giving up, saying \"Don't give up. Best of luck in securing that funding!\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]