[
  {
    "Link": "The author has been a freelance design engineer for 13 years, earning an estimated $464,616 before taxes, primarily through Craigslist gigs. Despite loving the work when it?s challenging and collaborative, they?ve struggled with low income, poor treatment, declining health, isolation, and financial stress. In recent years, they started a business focused on securing SBIR (Small Business Innovation Research) grants, which could potentially provide significant income and fulfilling work. However, the process is highly competitive, and they?ve yet to secure funding. Currently, they?re facing severe financial difficulties, with overdue bills and rent, and are considering taking a full-time job offered by a former coworker, though it would distract from their business. Despite the challenges, they remain hopeful about the potential of SBIR funding and are preparing multiple proposals for 2020, aiming for a significant financial turnaround. The author feels stuck but is reluctant to give up on their business due to its potential.",
    "Subreddit": "",
    "Title": "This Reddit post features the struggles of a freelance design engineer who has been earning a decent income for the past 13 years primarily through Craigslist gigs. However, the author has faced challenges such as low income, poor treatment, declining health, isolation, and financial stress. Despite having a passion for challenging and collaborative work, they are currently facing severe financial difficulties and are considering taking a full-time job to make ends meet. The author remains hopeful about securing SBIR grants for their business, but is struggling with the highly competitive process. The main concerns raised by commenters include the author's declining health and the potential distraction of a full-time job from their business. However, the overall sentiment of the commenters is positive, with many showing support and offering advice to help the author in their financial struggles. The comment with the most upvotes acknowledges the author's dedication and suggests that they reach out to a mentor for guidance and support.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]