[
  {
    "Link": "The author started their business in 2007 after 18 years at a failing company, leveraging 22 years of experience and client loyalty. They worked from home, avoiding real estate costs, and survived the 2008 crash. Both the author and their husband are self-employed. Despite enduring the COVID-19 pandemic, rising costs (up 50% in 2020) made the business unsustainable. They are now considering a part-time 1099 contract with a long-term vendor, acknowledging they were fortunate not to close in 2020 like many other small businesses.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the experience of a business owner who started their business in 2007 after being with a struggling company for 18 years. They were able to leverage their 22 years of experience and client loyalty to work from home and survive the 2008 crash. Despite being self-employed and enduring the COVID-19 pandemic, the business became unsustainable due to rising costs. The author is now considering a part-time 1099 contract with a long-term vendor. \n\nMany commenters praised the author for their resilience and ability to adapt to changing circumstances. They were impressed by the author's work ethic and initiatives, such as working from home to reduce real estate costs. Others commended the author for being able to survive the 2008 crash and the current pandemic. \n\nHowever, the main concerns raised by commenters were the challenges faced by small businesses, especially in terms of rising costs and sustainability. Some shared similar experiences, while others offered advice and suggestions for alternative strategies. \n\nThe overall sentiment of the commenters was supportive and empathetic. Many expressed admiration for the author's determination and empathy towards their predicament. \n\nThe comment with the most upvotes was, \"It's tough being a small business owner, especially in this climate. Hopefully, the author can find a sustainable solution with the contract work.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]