[
  {
    "Link": "The author started a product-based business in 2019 and participated in a 2020 online accelerator, raising $400,000 but ultimately shutting down the business in January due to poor sales. Despite the setback, they gained valuable skills in SEO, which contributed to some revenue. They have since transitioned to a full-time videography job while launching a new venture called Biking West, focused on bikepacking. This new business model includes multiple revenue streams and leverages their SEO expertise to target a niche market. The author aims for modest growth to cover expenses and dreams of creating a remote-operated business to split time between Colorado and Tucson. They express a strong commitment to entrepreneurship.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post discusses the journey of a product-based business owner who participated in an online accelerator and raised $400,000 in funding before ultimately closing down the business due to poor sales. Despite this setback, the author gained valuable skills in SEO, which led to some revenue. They have since shifted to a videography job and launched a new venture called Biking West, utilizing their SEO expertise to target a niche market. The new business model includes multiple revenue streams and the author hopes for modest growth to cover expenses while dreaming of a remote-operated business split between Colorado and Tucson. Commenters express praise for the author's resilience and determination in entrepreneurship, with some highlighting the potential of the new venture and the benefits of leveraging existing skills. Concerns are raised about the financial risks and sustainability of the new business, as well as the need for a solid contingency plan in case of failure. The overall sentiment is one of encouragement and support, with commenters urging the author to continue pursuing their dreams. The top upvoted comment reads, \"I admire your resilience and determination. Keep pushing forward and never give up on your dreams.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]