[
  {
    "Link": "A small business owner with over a decade of experience is struggling with declining sales this year, largely due to high shipping costs. After surveying abandoned cart customers, nearly 90% cited shipping prices as a deterrent. The business primarily ships via FedEx, as most packages exceed a cubic foot, while UPS offers no discounts. Attempts to lower shipping costs resulted in losses, leading to price hikes that didn?t help sales. The owner has received unsolicited offers from Unishippers but found them untrustworthy. They seek advice on obtaining better shipping rates from FedEx and UPS.",
    "Subreddit": "",
    "Title": "In this Reddit post, a small business owner with over a decade of experience shares their struggles with declining sales due to high shipping costs. After surveying abandoned cart customers, it was found that nearly 90% cited shipping prices as a deterrent. The business mainly uses FedEx for shipping, but attempts to lower costs resulted in losses and price hikes that did not improve sales. The owner has also received unsolicited offers from Unishippers, but found them untrustworthy. They are seeking advice on obtaining better rates from FedEx and UPS.\n\nMany commenters offered helpful suggestions, such as negotiating with the shipping companies and looking into different packaging options, such as using flat rate boxes or lightweight packaging. There were also recommendations to explore alternative shipping services such as USPS or regional carriers. Some commenters shared their own experiences with similar issues and offered support to the small business owner.\n\nThe main concerns raised in the discussion were the impact of high shipping costs on small businesses, the lack of transparency and trustworthiness from shipping companies, and the difficulty of finding a solution that balances cost and quality of service. There were also concerns about the potential loss of customers due to the high shipping costs.\n\nOverall, the sentiment of the commenters was sympathetic towards the small business owner and the struggles they were facing. Many emphasized the importance of finding a balance between cost and quality of service and offered helpful tips and advice. The comment with the most upvotes encouraged the small business owner to reach out directly to FedEx to negotiate better rates.\n\nOverall, the discussion highlighted the challenges faced by small businesses with high shipping costs and the importance of finding a solution that works for both the business and its customers.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]