[
  {
    "Link": "A civil engineering student received $10,000 in grants from his university to support his dog collar business, which he integrated as part of his co-op requirements. He highlights the benefits of utilizing university resources, mentorship, and funding opportunities while in school, countering the common notion that one must drop out to succeed in business. He encourages others to explore the resources available at their educational institutions.",
    "Subreddit": "",
    "Title": "The Reddit post discusses a civil engineering student who received $10,000 in grants from his university to support his dog collar business, which he integrated as part of his co-op requirements. The post highlights the importance and benefits of utilizing university resources, mentorship, and funding opportunities while in school, countering the common belief that one must drop out to succeed in business. The student encourages others to take advantage of the resources available at their educational institutions.\n\nThe key positive points raised by commenters include the value of hands-on experience and the practical application of skills learned in school, the potential for networking and mentorship opportunities, and the overall support and encouragement from the university. Many commenters also highlight the potential for growth and success in starting a business while still in school, rather than waiting until after graduation.\n\nHowever, some concerns were raised about the potential risks and financial burden of starting a business while in school, the availability of resources and support for students in different fields of study, and the potential for distractions from academic responsibilities. There were also discussions about the importance of having a solid business plan and being prepared for the challenges of entrepreneurship.\n\nOverall, the sentiment of commenters was largely positive and supportive of the student's success and his advice to others. The top upvoted comment expressed admiration for the student's determination and the valuable lessons that can be learned from the experience: \"What a great example of using your university experience in a practical and entrepreneurial way. Being able to work with a mentor and get funding from the university while still in school is a huge advantage.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]