[
  {
    "Link": "The author has spent 13 years freelancing as a design engineer, often feeling undervalued and struggling financially, with their health deteriorating over time. They transitioned to starting their own business but have yet to generate income, mainly focusing on securing Small Business Innovation Research (SBIR) funding, which is highly competitive. Despite the challenges, they see potential for significant income if successful. Currently facing financial strain, including late bills and rent, they have been offered a full-time job that may distract from their business efforts, but they feel it necessary for immediate income. They express frustration over their situation, the cyclical nature of their struggles, and the difficulty in finding quality freelance work outside of Craigslist, ultimately seeking advice and support.",
    "Subreddit": "",
    "Title": "The author of the Reddit post has been a freelance design engineer for 13 years, facing financial struggles and deteriorating health. They have transitioned to starting their own business, focusing on securing Small Business Innovation Research (SBIR) funding, which is highly competitive. Despite facing financial strain and being offered a distracting full-time job for immediate income, they see potential for significant income if successful. However, they express frustration over the cyclical nature of their struggles and the difficulty in finding quality freelance work outside of Craigslist. The commenters offer advice and support, highlighting the positives of the author's determination and potential success, while also expressing concern for their health and well-being. The overall sentiment is empathetic and supportive, with many offering advice on alternative sources of income and encouragement to keep pursuing their business. The comment with the most upvotes states, \"It takes a lot of courage to start your own business, and it seems like you have a real passion for it. Don't give up and keep pushing forward, I truly believe you can make it work.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]