[
  {
    "Link": "The author, who has run a small business for over a decade, is struggling with declining sales due to high shipping costs, which nearly 90% of cart abandoners attribute to their decision not to purchase. Despite offering various shipping options through USPS and FedEx, the author faces challenges with shipping rates, particularly with UPS, which refuses to negotiate prices or offer discounts. Attempts to lower shipping costs have led to losses and subsequent price hikes on products. The author has also been unresponsive to marketing from Unishippers, citing a lack of transparency and poor reviews. They seek advice on how to secure better shipping rates with FedEx or UPS.",
    "Subreddit": "#N/A",
    "Title": "The author of this Reddit post is a small business owner who has been struggling with declining sales due to high shipping costs, with nearly 90% of abandoned carts citing shipping as the main reason for not making a purchase. Despite offering various shipping options through USPS and FedEx, the author is facing challenges with shipping rates, specifically with UPS, which has refused to negotiate or offer discounts. The attempts made by the author to lower shipping costs have led to losses and subsequent price hikes on products. The author has also been unresponsive to marketing efforts from Unishippers, citing lack of transparency and poor reviews. The main concern raised by commenters is the inability to secure better rates with FedEx or UPS, and many have suggested looking into alternative shipping providers. There is also frustration towards UPS and its lack of flexibility when it comes to pricing. Overall, the sentiment of commenters is sympathetic towards the author's struggles and many have offered potential solutions or advice to help reduce shipping costs. The most upvoted comment, with 38 upvotes, suggests that the author should switch to USPS for all their shipping needs as it has more affordable rates and better customer service.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]