[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "The post in question discusses a situation in which the author, in their 40s, has successfully managed a side hustle that outperforms their full-time job for the past three years. The author recently resigned from their job due to declining mental and physical health and did not disclose their side hustle. The company offered to adjust the author's schedule to retain them, but the author is uncertain about the feasibility of maintaining the same workload with reduced hours. The author is considering asking for a raise, despite the possibility of being designated for future layoffs. They value the remote work flexibility their current job provides and see it as the end of their corporate career. \n\nMany commenters praise the author for their successful side hustle and encourage them to prioritize their health. They suggest negotiating a reduced workload or taking a break before discussing a raise. Some commenters share similar experiences and advise the author to communicate openly with their employer about their concerns. Others caution against asking for a raise while also mentioning personal struggles. The overall sentiment is one of support and understanding for the author's situation. The comment with the most upvotes reiterates the importance of prioritizing mental and physical health, stating, \"Your health should always come first before work, regardless of how successful your side hustle is.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]