[
  {
    "Link": "The author is reading Walter Deibel's \"Buy then Build,\" which outlines the concept of acquisition entrepreneurship. He presents a scenario where an entrepreneur buys a $1M business with $200k SDE, invests $100k, and finances the rest with a 90% SBA loan. The entrepreneur aims to grow the business's revenue by 10% annually and sell it for $3-4M in ten years. The author questions the feasibility of consistently achieving a 10% growth rate over a decade and seeks insights on business niches that could support this growth.",
    "Subreddit": "",
    "Title": "In this Reddit post, the author discusses the concept of acquisition entrepreneurship presented in Walter Deibel's \"Buy then Build.\" The scenario presented involves an entrepreneur buying a $1M business with $200k SDE and aims to grow its revenue by 10% annually for ten years, eventually selling it for $3-4M. The discussion is centered around the feasibility of consistently achieving a 10% growth rate and potential business niches that could support this growth. \n\nSeveral commenters highlight the positive aspects of the strategy, such as the potential for a significant return on investment and leveraging an SBA loan for financing. They also suggest that the growth rate goal might be achievable with the right business niche and strong management skills. However, many also express concerns about the potential risks and challenges, such as the difficulty of consistently achieving 10% growth and the potential for unexpected obstacles in the business. The overall sentiment seems to be cautious and realistic, with some commenters urging the author to thoroughly research and plan before pursuing this strategy. \n\nThe comment with the most upvotes highlights the need for a solid business plan and thoroughly evaluating market conditions before pursuing this type of strategy, stating, \"The true test is in the execution and the market conditions at that time.\" This comment reflects the overall tone of the discussion, emphasizing the importance of careful consideration and realistic expectations when it comes to acquisition entrepreneurship.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]