[
  {
    "Link": "The owner of a handmade suit shop on Etsy, which generated $54.8K in revenue with around 450 sales, faced suspension in October 2023 due to a backlog of custom orders and customer satisfaction issues. Despite having a good track record and providing detailed sizing guides and consultations, many overdue orders resulted in customer complaints, leading to case openings and automatic refunds from Etsy. A dispute with a Japanese customer over customs fees and a negative review contributed to the situation. With active orders pending, thousands of dollars in fabric stock, and four employees relying on the business, the owner expressed panic and frustration over the suspension, claiming their attempts to communicate with customers were misconstrued. They urged others in the small business community to diversify their platforms and voiced their discontent with Etsy's handling of the matter.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post discusses the suspension of a handmade suit shop on Etsy due to a backlog of custom orders and customer satisfaction issues. Despite providing detailed sizing guides and consultations, the shop received many customer complaints and automatic refunds, leading to a dispute with a Japanese customer and negative reviews. The owner, who expressed panic and frustration, urged others to diversify their platforms and criticized Etsy's handling of the suspension, considering the impact on the business and employees. The main concerns raised revolve around the shop's reputation and financial stability, while key positive points highlight the owner's efforts to communicate with customers and provide quality products. The overall sentiment of the commenters is sympathetic and critical of Etsy's actions, with many expressing frustration and concern for the owner and their business. The comment with the most upvotes reads, \"Etsy should have given the shop a chance to resolve the issue instead of immediately suspending them. This is a small business that relies on the platform for survival and Etsy's actions have added to their struggles.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]