[
  {
    "Link": "The author shares their journey of building an online side business, inspired by various podcasts and personal experiences in web development. Initially struggling with programming and user experience, they discovered low-code app builders and launched their first mobile app, Rolly: AI Money Tracker, in July 2024. The app gained unexpected popularity in Vietnam, quickly growing its user base from 1,000 to 100,000 in just five days due to viral social media engagement. Despite lacking marketing experience, the author emphasizes the importance of perseverance and problem-solving in entrepreneurship, encouraging others not to overthink challenges before starting their own ventures.",
    "Subreddit": "#N/A",
    "Title": "In this Reddit post, the author shares their experience of starting an online side business after being inspired by various podcasts and their own web development background. Despite struggling at first with programming and user experience, they discovered the potential of low-code app builders and successfully launched their first app, Rolly: AI Money Tracker, in July 2024. The app unexpectedly gained popularity in Vietnam, growing its user base from 1,000 to 100,000 in only five days due to viral social media engagement. The author emphasizes the importance of perseverance and problem-solving in entrepreneurship and encourages others not to overthink challenges before starting their own ventures. While some commenters admire the author's determination and success, others express concerns about the sustainability of the business and the lack of marketing experience. Nevertheless, the overall sentiment is positive and supportive, with many applauding the author's achievements and offering helpful advice. The top comment, with the most upvotes, reads: \"This is a great example of how perseverance pays off in entrepreneurship. Congrats on your success!\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]