[
  {
    "Link": "The author has been a freelance design engineer for 13 years, earning an estimated $464,616 before taxes, primarily through Craigslist gigs. Despite loving the work when it?s challenging and collaborative, they?ve struggled with low income, poor treatment, declining health, isolation, and financial stress. In recent years, they started a business focused on securing SBIR (Small Business Innovation Research) grants, which could potentially provide significant income and fulfilling work. However, the process is highly competitive, and they?ve yet to secure funding. Currently, they?re facing severe financial difficulties, with overdue bills and rent, and are considering taking a full-time job offered by a former coworker, though it would distract from their business. Despite the challenges, they remain hopeful about the potential of SBIR funding and are preparing multiple proposals for 2020, aiming for a significant financial turnaround. The author feels stuck but is reluctant to give up on their business due to its potential.",
    "Subreddit": "",
    "Title": "In this Reddit post, the author, a freelance design engineer for over a decade, shares their struggles with low income, poor treatment, declining health, isolation, and financial stress despite loving their work. They have turned to pursuing SBIR grants to potentially improve their financial situation, though the process is competitive and they have yet to secure funding. With overdue bills and rent, they are considering a full-time job, but are hopeful about the potential of their business and continue to work on proposals for 2020. Commenters empathize with the author's challenges and applaud their determination to not give up on their business, with many offering helpful advice and encouragement. The comment with the most upvotes reads, \"Hang in there and keep pushing for your business! It takes time and effort, but it sounds like you have the passion and drive to make it work.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]