[
  {
    "Link": "The author has spent 13 years freelancing as a design engineer, often feeling undervalued and struggling financially, with their health deteriorating over time. They transitioned to starting their own business but have yet to generate income, mainly focusing on securing Small Business Innovation Research (SBIR) funding, which is highly competitive. Despite the challenges, they see potential for significant income if successful. Currently facing financial strain, including late bills and rent, they have been offered a full-time job that may distract from their business efforts, but they feel it necessary for immediate income. They express frustration over their situation, the cyclical nature of their struggles, and the difficulty in finding quality freelance work outside of Craigslist, ultimately seeking advice and support.",
    "Subreddit": "",
    "Title": "The author of the post has been freelancing as a design engineer for 13 years and has faced ongoing challenges, including feeling undervalued and struggling financially. They have transitioned to starting their own business with the hope of generating significant income, but have yet to be successful in securing Small Business Innovation Research (SBIR) funding. They are currently facing financial strain and have been offered a full-time job that may distract from their business efforts. The author expresses frustration over their situation, the cyclical nature of their struggles, and the difficulty in finding quality freelance work. The commenters offer support and advice, highlighting the author's determination and potential for success. However, they also raise concerns about the competitive nature of the SBIR funding and the potential risks of taking a full-time job instead of focusing on their business. The overall sentiment is one of empathy and encouragement, with many commenters sharing their own experiences and offering suggestions for finding quality freelance work. The comment with the most upvotes encourages the author to prioritize their health and well-being above financial stability.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]