[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the struggles of an entrepreneur who accumulated 8 million pesos in debt after achieving success with a physical store but failing to make the shift to online sales due to the COVID-19 pandemic. Despite generating 29 million pesos in sales, mismanagement and subsequent failures led to the business's closure. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes. Comments from fellow Redditors provide words of encouragement, reminding the narrator of their resilience and the potential for future success through freelancing or other business ventures. There is a consensus that failure is a natural part of entrepreneurship, and the narrator should not give up their dreams. Some expressed concerns about the narrator's mindset and emphasized the importance of learning from past mistakes. The overall sentiment is one of empathy and understanding towards the narrator's situation, with many offering practical advice and support. The comment with the most upvotes reads, \"Success is not a linear path, and failure is necessary for growth. You have already shown resilience and determination, and those qualities will serve you well in whatever path you choose next.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]