[
  {
    "Link": "A customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After realizing the item wasn't suitable, they returned it, paying $14 for shipping. However, USPS marked the package as \"unclaimed\" after three delivery attempts, and it was returned to the sender. The customer contacted the business for a refund, but the business refused to pay for the return shipping and insisted on receiving the item to process the refund, resulting in the customer facing an additional $14 cost. The customer is frustrated and considering a chargeback, feeling the business is not honoring its return policy fairly.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post discusses a frustrating situation where a customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After realizing the item was not suitable, the customer returned it, paying $14 for shipping. However, due to USPS marking the package as \"unclaimed,\" the package was returned to the sender. The customer requested a refund from the business, but the business refused to pay for the return shipping and insisted on receiving the item before processing the refund. This resulted in the customer facing an additional $14 cost and considering a chargeback to resolve the situation. \n\nSome key positive points mentioned by commenters include the customer's willingness to pay for return shipping and the business's 100% satisfaction guarantee. However, the main concerns raised revolve around the business not honoring their return policy fairly and the customer facing additional costs due to USPS's mistake. The overall sentiment of the commenters is frustration and disappointment with the business's handling of the situation. The comment with the most upvotes is \"If they have a 100% satisfaction guarantee then they are obligated to refund you in full.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]