[
  {
    "Link": "The author started their business in 2007 after 18 years at a failing company, leveraging 22 years of experience and client loyalty. They worked from home, avoiding real estate costs, and survived the 2008 crash. Both the author and their husband are self-employed. Despite enduring the COVID-19 pandemic, rising costs (up 50% in 2020) made the business unsustainable. They are now considering a part-time 1099 contract with a long-term vendor, acknowledging they were fortunate not to close in 2020 like many other small businesses.",
    "Subreddit": "",
    "Title": "The Reddit post in question brings to light the story of a business owner who started their company in 2007 after many years in a failing company. With 22 years of experience and a strong client base, they were able to survive the 2008 crash by working from home and avoiding real estate costs. However, despite their resilience, the COVID-19 pandemic and a significant increase in costs have made the business unsustainable. As a result, they are now considering a part-time 1099 contract with a long-term vendor, grateful that they did not have to close their business like many others in 2020.\n\nThe key positive points highlighted by commenters include the author's perseverance and resilience in the face of economic challenges, as well as the potential opportunity for a new part-time contract that could provide stability for their business. Additionally, many have praised the author and their husband for being self-employed and successfully navigating the tough business landscape for over a decade.\n\nMain concerns raised by commenters revolve around the rising costs that have made the business unsustainable and the potential risks involved in taking on a 1099 contract as a sole source of income. Some also express sympathy for the difficult decision the author is facing and offer words of encouragement and support.\n\nThe overall sentiment of the commenters is one of understanding and empathy towards the business owner's struggles. Many have shared their own experiences and offered valuable advice and support, highlighting the sense of community within the Reddit platform.\n\nThe comment with the most upvotes reads, \"You didn't give up, and that alone is something to be proud of. Best of luck with the future!\" This comment encapsulates the sentiment of many others, applauding the author's resilience and wishing them the best in their future endeavors.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]