[
  {
    "Link": "A small business owner, struggling with declining sales, implemented an automated email to capture feedback from abandoned carts, revealing that nearly 90% of potential customers cite high shipping costs as the reason for not completing orders. Despite offering various shipping options (USPS and FedEx) and attempting to lower costs, the business is losing money and forced to increase product prices. The owner has been dissatisfied with Unishippers' proposals and is seeking advice on how to secure better shipping rates from FedEx or UPS, as they face challenges with rising shipping costs threatening their operations.",
    "Subreddit": "#N/A",
    "Title": "In a Reddit post discussing the struggles of a small business owner, it was revealed that an automated email was implemented to capture feedback from abandoned carts. The results showed that high shipping costs were cited as the main reason for not completing orders, with almost 90% of potential customers being affected. Despite offering different shipping options and attempting to lower costs, the business is still losing money and is forced to increase product prices. The owner sought out advice on securing better shipping rates from UPS or FedEx, as they have faced challenges with rising shipping costs. There were many suggestions and experiences shared by commenters, with some positive points being the significance of negotiating with carriers and exploring other shipping options. However, the main concerns raised were the financial burden on small businesses and the lack of control over shipping costs. The overall sentiment among commenters was that shipping costs are a major obstacle for small businesses and more needs to be done to address this issue. The comment with the most upvotes stated, \"Unfortunately, shipping costs are a major barrier for many small businesses and it's a tough issue to tackle.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]