[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "In this Reddit post, the author, in their 40s, shared their experience of successfully managing a side hustle that outperforms their full-time job for the past three years. They recently resigned from their job due to declining mental and physical health, without disclosing their side hustle. While their company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they value the remote work flexibility their current job provides.\n\nMany commenters praised the author for their success in managing a profitable side hustle and empathized with their struggle with declining health. Some suggested negotiating for a reduced workload or requesting a sabbatical instead of a raise. Others highlighted the importance of prioritizing one's health over work and the potential risks of asking for a raise in the current job market. Some also shared their own personal experiences and offered advice on how to balance a side hustle and a full-time job. Overall, the sentiment among commenters is supportive and encouraging, with many emphasizing the importance of self-care and finding a balance between work and personal life.\n\nThe most upvoted comment suggests that the author should prioritize their health and not be afraid to ask for a raise if it's necessary for their well-being. It also advises the author to negotiate for a more flexible schedule or a sabbatical instead of quitting altogether, as there are other options to explore before making a drastic decision.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]