[
  {
    "Link": "The owner of a handmade custom suit shop on Etsy, which began operations online in October 2023, reported a suspension of their shop despite achieving $54.8K in sales and 450 orders. The suspension followed an influx of customer complaints primarily due to overdue orders, where clients failed to provide essential custom sizing information. The shop, which operated for 20 years and had a rating of 4.1, had previously faced a false review dispute with a customer from Japan but received no warnings prior to the suspension. The owner expressed concern about financial instability and the potential loss of business, especially for clients awaiting suits for weddings. Multiple requests for appeal have gone unanswered, leading to feelings of panic and anxiety regarding the future of the business.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post regarding the suspension of a handmade custom suit shop on Etsy has sparked a discussion among commenters, with many expressing their support for the owner and concern for the future of the business. Despite achieving $54.8K in sales and 450 orders, the shop was suspended due to an influx of customer complaints about overdue orders and failure to provide custom sizing information. The shop had a previous false review dispute but received no warnings prior to the suspension. Commenters praised the quality of the products and the shop's 20 years of operation, with a rating of 4.1. However, they also acknowledged the concerns raised by the customers who did not receive their orders, particularly those awaiting suits for weddings. Many expressed frustration with the lack of response from Etsy regarding the owner's multiple appeals. The overall sentiment of the commenters is one of sympathy and empathy for the owner's financial instability and uncertainty about the future of the business. The comment with the most upvotes stated, \"It's sad to see smaller businesses being penalized so harshly for minor issues, while larger corporations get away with similar problems.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]