[
  {
    "Link": "A customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After realizing the item wasn't suitable, they returned it, paying $14 for shipping. However, USPS marked the package as \"unclaimed\" after three delivery attempts, and it was returned to the sender. The customer contacted the business for a refund, but the business refused to pay for the return shipping and insisted on receiving the item to process the refund, resulting in the customer facing an additional $14 cost. The customer is frustrated and considering a chargeback, feeling the business is not honoring its return policy fairly.",
    "Subreddit": "",
    "Title": "The discussion on Reddit revolves around a frustrated customer who ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" The customer returned the item, paying $14 for shipping, but USPS marked the package as \"unclaimed\" and returned it to the sender. The customer contacted the business for a refund, but the business refused to pay for return shipping, insisting on receiving the item to process the refund, resulting in the customer facing an additional $14 cost. The main positive points raised by commenters include praising the customer for following the return policy and commending the business for having a satisfaction guarantee. However, the main concerns raised are around the lack of communication and flexibility from the business, with commenters pointing out that it is unfair for the customer to bear the cost of return shipping for a mistake made by USPS. The overall sentiment of the commenters is that the business is not honoring its return policy fairly and that the customer should consider a chargeback. The comment with the most upvotes highlights the frustration of the customer and the lack of empathy from the business, with the commenter sympathizing with the customer's situation.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]