[
  {
    "Link": "A customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After realizing the item wasn't suitable, they returned it, paying $14 for shipping. However, USPS marked the package as \"unclaimed\" after three delivery attempts, and it was returned to the sender. The customer contacted the business for a refund, but the business refused to pay for the return shipping and insisted on receiving the item to process the refund, resulting in the customer facing an additional $14 cost. The customer is frustrated and considering a chargeback, feeling the business is not honoring its return policy fairly.",
    "Subreddit": "",
    "Title": "The Reddit post discusses a customer's frustrating experience with a small business's return policy. The business had advertised a \"30-day return\" and \"100% satisfaction guarantee,\" but when the customer returned the $50 item, USPS marked it as \"unclaimed\" and it was returned to the sender. The customer contacted the business for a refund, but the business refused to pay for the return shipping. The main positive points mentioned by commenters include the importance of clear and transparent return policies, as well as the value of open communication between the customer and the business. However, the main concern raised by commenters is the lack of responsibility and fairness on the part of the small business, as they should have covered the return shipping cost and honored their advertised return policy. Overall, the sentiment of the commenters is one of frustration and disappointment towards the business, with many suggesting that the customer should consider a chargeback. The comment with the most upvotes highlights the importance of customer service and standing by one's promises, stating, \"It?s not just about the item or the money, it?s about good customer service and keeping your word.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]