[
  {
    "Link": "The author has spent 13 years freelancing as a design engineer, often feeling undervalued and struggling financially, with their health deteriorating over time. They transitioned to starting their own business but have yet to generate income, mainly focusing on securing Small Business Innovation Research (SBIR) funding, which is highly competitive. Despite the challenges, they see potential for significant income if successful. Currently facing financial strain, including late bills and rent, they have been offered a full-time job that may distract from their business efforts, but they feel it necessary for immediate income. They express frustration over their situation, the cyclical nature of their struggles, and the difficulty in finding quality freelance work outside of Craigslist, ultimately seeking advice and support.",
    "Subreddit": "",
    "Title": "The author of the Reddit post has spent 13 years freelancing as a design engineer, facing financial struggles and deteriorating health while feeling undervalued. They have transitioned to starting their own business and are currently focusing on securing SBIR funding, but have yet to generate income. Despite the potential for significant income, they are currently facing financial strain and have been offered a full-time job that may distract from their business efforts. This has led to frustration with the cyclical nature of their struggles and the difficulty in finding quality freelance work outside of Craigslist. The commenters offer support and advice, with some highlighting the potential of the author's business and others expressing concerns about taking on a full-time job. The overall sentiment is empathetic, with many commenters sharing similar experiences and offering encouragement. The comment with the most upvotes acknowledges the difficulties the author is facing but also reminds them to focus on their own health and well-being first.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]