[
  {
    "Link": "A small UK engineering company specializing in waterproof cables faced difficulties when an overseas customer in the UAE requested a custom product. After successfully agreeing on specifications, issues arose during the onboarding process, particularly around payment terms. The customer insisted on net 60 payments, which the owner found untenable due to the upfront costs of custom work. After much negotiation, the best offer was net 30, still risky for the owner. Ultimately, the owner chose not to proceed with the order, prioritizing peace of mind over financial risk. They sought to hear from others about similar experiences with large companies.",
    "Subreddit": "",
    "Title": "This Reddit post discusses the challenges faced by a small UK engineering company when dealing with an overseas customer in the UAE. The company specializes in waterproof cables and was requested to provide a custom product. After agreeing on specifications, issues arose during the onboarding process, specifically around payment terms. The customer insisted on net 60 payments, which was deemed unfeasible by the owner due to the upfront costs of custom work. Despite efforts to negotiate, the best offer was net 30, still viewed as risky by the owner. In the end, the owner prioritized peace of mind over financial risk and chose not to proceed with the order. The post garnered a significant number of responses, with many sharing similar experiences with large companies. The key positive points highlighted include the importance of negotiation and standing one's ground, as well as the need for clear communication and transparency in business dealings. The main concerns raised revolve around the unfair power dynamic between small companies and larger clients, and the struggles faced in navigating international business transactions. The overall sentiment of the commenters is one of understanding and support towards the owner's decision to prioritize their company's financial stability. The most upvoted comment reads, \"It's unfortunate that small companies are often at the mercy of larger clients, we need better systems in place to protect small businesses in these kinds of situations.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]