[
  {
    "Link": "The author recounts their journey of starting and eventually selling their first business while being a full-time college student, detailing significant milestones from Spring 2017 to Spring 2018. Initially trading Steam skins with a modest investment, they developed a website for automated trading, scaling their user base and inventory significantly through influencer marketing and partnerships. Despite experiencing periods of profit decline and challenges, such as an unreliable investor and backend issues, they managed to withdraw over $12,000 in profits from total revenue of around $17,000 before selling 90% of the site for $2,200. The experience taught them valuable lessons in entrepreneurship, marketing, and development, inspiring them to continue exploring business opportunities.",
    "Subreddit": "",
    "Title": "In this Reddit post, the author shares their journey of starting and selling their first business while being a full-time college student between Spring 2017 and Spring 2018. They began by trading Steam skins and eventually developed a website for automated trading, achieving success through influencer marketing and partnerships. Despite facing challenges such as profit declines and unreliable investors, they were able to withdraw $12,000 in profits from total revenue of $17,000 before selling the majority of their site for $2,200. This experience taught them valuable lessons and inspired them to continue exploring business opportunities. Positive points highlighted by commenters include the author's determination and success in starting a business while in college, as well as their ability to navigate through challenges. Concerns raised include the potential risks and reliability of online trading, as well as the support and assistance the author received from their university. Overall, commenters show support and admiration for the author's entrepreneurship and determination, with the most upvoted comment stating, \"It's inspiring to see how you were able to make this happen while juggling a full-time college workload. Keep chasing your dreams!\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]