[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "This Reddit post shares the struggles of an entrepreneur who accumulated 8 million pesos in debt while trying to make their business successful. Despite having initial success with a physical store, the shift to online sales during the pandemic resulted in mismanagement and failures that led to the business's closure. The narrator expresses feelings of defeat and regret, questioning their ambitions and purpose. However, many commenters offer positive advice and support, highlighting the narrator's determination and resilience in the face of challenges. They also encourage the narrator to take a step back and focus on their well-being and the well-being of their family, rather than constantly chasing success. Main concerns raised include the pressure of societal expectations and the fear of letting go of a dream. Overall, the sentiment of the commenters is empathetic and understanding, with many offering practical advice and sharing their own experiences. The most upvoted comment highlights the need to acknowledge and process feelings of failure before making any decisions about the future.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]