[
  {
    "Link": "A small business owner with over a decade of experience is struggling with declining sales this year, largely due to high shipping costs. After surveying abandoned cart customers, nearly 90% cited shipping prices as a deterrent. The business primarily ships via FedEx, as most packages exceed a cubic foot, while UPS offers no discounts. Attempts to lower shipping costs resulted in losses, leading to price hikes that didn?t help sales. The owner has received unsolicited offers from Unishippers but found them untrustworthy. They seek advice on obtaining better shipping rates from FedEx and UPS.",
    "Subreddit": "",
    "Title": "The Reddit post highlights a small business owner's struggle with declining sales due to high shipping costs, with almost 90% of abandoned cart customers citing shipping prices as a deterrent. The owner primarily ships via FedEx, but attempts to lower costs have resulted in losses, leading to price hikes that did not improve sales. The owner has received unsolicited offers from Unishippers, but found them untrustworthy and seeks advice on obtaining better shipping rates from FedEx and UPS. The discussion suggests that many small business owners are facing similar issues with high shipping costs and share their experiences and suggestions. Some key positive points include tips on negotiating with shipping carriers, utilizing shipping rate calculators, and exploring alternative options such as USPS. The main concerns raised include the difficulty of negotiating with major shipping carriers, lack of transparency in shipping rates, and the impact of high shipping costs on small businesses. The overall sentiment of the commenters is one of frustration and empathy towards the small business owner's struggles. The most upvoted comment advises the business owner to consider investing in packaging optimization to reduce the size and weight of packages, potentially leading to lower shipping costs.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]