[
  {
    "Link": "The author has spent 13 years freelancing as a design engineer, often feeling undervalued and struggling financially, with their health deteriorating over time. They transitioned to starting their own business but have yet to generate income, mainly focusing on securing Small Business Innovation Research (SBIR) funding, which is highly competitive. Despite the challenges, they see potential for significant income if successful. Currently facing financial strain, including late bills and rent, they have been offered a full-time job that may distract from their business efforts, but they feel it necessary for immediate income. They express frustration over their situation, the cyclical nature of their struggles, and the difficulty in finding quality freelance work outside of Craigslist, ultimately seeking advice and support.",
    "Subreddit": "",
    "Title": "This Reddit post follows the journey of a design engineer who has been freelancing for the past 13 years and has faced challenges in terms of feeling undervalued and struggling financially. Despite transitioning to starting their own business, they have yet to generate income and are primarily focused on securing funding through the Small Business Innovation Research program. The author expresses frustration over their cyclical struggles and the difficulty in finding quality freelance work. Many commenters offer words of support and encouragement, highlighting the author's determination and potential for significant income if their business succeeds. However, concerns are raised about the immediate need for income and the potential distraction of a full-time job. The overall sentiment of the commenters is understanding and sympathetic towards the author's struggles, with many offering practical advice and resources for finding better freelance work. The most upvoted comment is one that offers encouragement and suggests diversifying sources of income rather than relying solely on the SBIR program.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]