[
  {
    "Link": "An assistant manager at a small retail liquor store discovered suspicious patterns in the voided sales log, indicating potential employee theft. After reviewing security footage, he observed an employee scanning products, taking cash from customers, and voiding the sales while keeping the cash in the till. Although the manager couldn't find evidence of the employee pocketing items, he expressed concern about falsely accusing him. Ultimately, the manager shared the findings with the owner, who confirmed that a significant amount of theft occurred. The employee confessed to the theft, and the owner decided not to pursue charges if he paid back the stolen amount, raising concerns about the impact on the employee's career. The assistant manager felt frustration over the situation and urged for stricter theft prevention measures.",
    "Subreddit": "",
    "Title": "In a Reddit post, an assistant manager at a liquor store shares the discovery of suspicious patterns in the voided sales log, indicating potential employee theft. After reviewing CCTV footage, the manager witnessed an employee scanning products, taking cash from customers, and then voiding the sales without returning the cash. While the manager could not find evidence of the employee pocketing items, he expressed concern about falsely accusing the employee. The owner was informed and confirmed that a significant amount of theft had occurred. The employee confessed and the owner decided not to press charges if the stolen amount was repaid, raising concerns about the impact on the employee's career. Commenters praised the manager for taking the necessary steps to uncover the theft and for exercising empathy towards the employee. However, they also expressed frustration over the lack of strict theft prevention measures and the potential for the employee to repeat their actions. The overall sentiment of commenters was one of disappointment and resignation towards the situation. The top upvoted comment highlights the need for stricter measures to prevent future theft.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]