[
  {
    "Link": "The owner of a handmade custom suit shop on Etsy, which had recently achieved $54.8K in revenue from 450 sales, faced suspension due to multiple overdue orders and customer complaints. Despite providing detailed measurement instructions and offering video consultations, many customers did not submit required sizing information, leading to delayed orders. The owner reported receiving no prior warning from Etsy regarding policy violations but had a negative experience with a customer from Japan who left a false review after a disputes about customs fees. They now have 55 active orders, including many for weddings, and are struggling with anxiety and uncertainty about fulfilling these commitments without payment. The owner expressed frustration with Etsy?s automated responses to their appeals and warned others against relying solely on the platform.",
    "Subreddit": "#N/A",
    "Title": "The owner of a handmade custom suit shop on Etsy recently faced suspension from the platform, despite achieving a revenue of $54.8K from 450 sales. The suspension was due to multiple overdue orders and customer complaints, which the owner claims they were not warned about. While they provided detailed measurement instructions and video consultations, many customers failed to submit required sizing information, causing delays. The situation has caused the owner anxiety and uncertainty about fulfilling their 55 active orders, including several for weddings, without payment. They expressed frustration with Etsy's automated responses to their appeals and warned others against relying solely on the platform. \n\nCommenters in the Reddit post praised the owner for offering detailed measurement instructions and video consultations, highlighting their professionalism and dedication. Many expressed sympathy for the owner's situation and urged them to prioritize their mental health over fulfilling orders. Concerns were raised about the lack of communication and assistance from Etsy, as well as the issue of customers not submitting required sizing information. Some commenters also shared their own negative experiences with Etsy's automated responses. The overall sentiment was one of support for the owner and frustration with Etsy's policies and lack of assistance. The top upvoted comment advised the owner to seek legal help and consider other platforms to sell their products.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]