[
  {
    "Link": "The author has been freelancing as a design engineer for 13 years, generating around $464,616 in income but struggling financially and feeling unfulfilled. Despite starting an LLC and pursuing government funding through the Small Business Innovation Research (SBIR) program, they have yet to achieve any income from their business. Their health and social life have deteriorated, and they are currently behind on bills and rent. A potential full-time job opportunity has arisen, but the author is conflicted about taking it due to the perceived distraction from their business. They are preparing to submit new proposals for funding while grappling with feelings of isolation and uncertainty about the future. Overall, the author acknowledges past mistakes but remains hopeful about the potential for future success while expressing frustration and desperation over their current financial situation.",
    "Subreddit": "#N/A",
    "Title": "After 13 years of freelance work in design engineering, the author of the post has generated a total income of $464,616 but is currently struggling financially and feeling unfulfilled. Despite starting an LLC and pursuing government funding through the SBIR program, they have yet to see any income from their business, causing their health and social life to deteriorate. They are behind on bills and rent and are considering a potential full-time job opportunity, but are conflicted about the potential distraction from their business. The author is also preparing to submit new proposals for funding but is dealing with feelings of isolation and uncertainty. While acknowledging past mistakes, the author remains hopeful for future success but expresses frustration and desperation over their current situation. Overall, commenters offered support and advice, highlighting the importance of seeking outside help and resources, the need to prioritize personal well-being, and the potential for learning and growth from setbacks. The comment with the most upvotes encourages the author to focus on finding a steady source of income to alleviate their financial stress and to prioritize self-care.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]