[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "This Reddit post discusses a person in their 40s who has successfully managed a side hustle that has outperformed their full-time job for the past three years. Due to declining mental and physical health, they resigned without disclosing their side hustle. While the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now considering asking for a raise, despite the possibility of future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides. The discussion highlights the positive aspects of the author's successful side hustle, as well as the value of remote work flexibility and the importance of mental and physical health. Concerns raised include the potential consequences of asking for a raise and the feasibility of reduced hours. Most commenters express support for the author's decision and empathize with their struggles, with the top comment being: \"Congratulations on your successful side hustle and making the decision to prioritize your health. Asking for a raise is a good idea, especially with the flexibility your current job provides. Remember to prioritize your well-being above everything else.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]