[
  {
    "Link": "The author started their business in 2007 after 18 years at a failing company, leveraging 22 years of experience and client loyalty. They worked from home, avoiding real estate costs, and survived the 2008 crash. Both the author and their husband are self-employed. Despite enduring the COVID-19 pandemic, rising costs (up 50% in 2020) made the business unsustainable. They are now considering a part-time 1099 contract with a long-term vendor, acknowledging they were fortunate not to close in 2020 like many other small businesses.",
    "Subreddit": "",
    "Title": "This Reddit post discusses the challenges faced by a small business owner who started their venture in 2007 after leaving a failing company. The author and their husband are both self-employed and were able to survive the 2008 financial crisis by working from home and avoiding real estate costs. However, the increasing costs in 2020, coupled with the impact of the COVID-19 pandemic, made the business unsustainable. The author is now considering a part-time 1099 contract with a long-term vendor as a solution, acknowledging that they were fortunate not to have to close like many other small businesses in 2020. \n\nThe main positive points raised by commenters include the author's ability to successfully navigate through the 2008 financial crisis by working from home and their willingness to adapt to the new challenges faced during the COVID-19 pandemic. Many also commend the author for acknowledging their privilege in being able to keep their business afloat during these tough times. \n\nThe main concerns raised revolve around the sustainability of the proposed solution and the impact it may have on the author's business in the long run. Some commenters express concern about losing the personal touch of the business if it becomes a 1099 contract, while others question the stability and longevity of the vendor. \n\nOverall, the sentiment among commenters is sympathetic and understanding towards the struggles of small businesses, with many sharing their own experiences and offering advice and support. The comment with the most upvotes comes from someone who highlights the importance of being adaptable and open to new opportunities in order to survive in the ever-changing business world.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]