[
  {
    "Link": "The author started a small baking business in January 2024, initially selling baked goods at farmers markets, which allowed them to leave their jobs at Starbucks. After obtaining wholesale licensing, they began selling to restaurants, but business has slowed, leading them to take two additional jobs to make ends meet. They now work 16-hour days but feel burnt out and trapped, questioning whether continuing the business is worth it. Despite their husband's support, the author struggles with motivation, faces repeated rejection, and feels like an imposter in their role as a business owner, contemplating whether to abandon their entrepreneurial dreams in favor of a more stable job.",
    "Subreddit": "#N/A",
    "Title": "This Reddit post shares the story of a small business owner who started a baking business in 2020 and eventually left their job at Starbucks. The author obtained wholesale licensing and started selling to restaurants, but business has slowed down, causing them to take on additional jobs. Despite support from their husband, the author is burnt out and questioning whether continuing the business is worth it. Many commenters offered encouragement and praised the author for their determination and hard work. However, key concerns were raised about the author's unsustainable work schedule and potential for burnout. Many also commented on the struggles and challenges of being an entrepreneur, while others advised seeking help and making adjustments to the business model. Overall, the sentiment of the commenters was sympathetic and empathetic towards the author's situation, with a majority encouraging them to stay strong and pursue their dreams. The comment with the most upvotes stated, \"The fact that you have started a business and are sustaining it, while working 16-hour days and maintaining relationships, is a testament to your perseverance and strength.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]