[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "#N/A",
    "Title": "In this Reddit post, a successful side hustle has been the author's main source of income for the past three years, leading them to resign from their full-time job due to declining health. The company offered to adjust their schedule to keep them, but the author is skeptical about maintaining the same workload with reduced hours. They are now considering asking for a raise, despite knowing it may make them a target for future layoffs, as they value the flexibility of remote work. \n\nThe key positive points discussed by commenters include the author's successful side hustle and their determination to prioritize their mental and physical health. Some also praise the author for recognizing their worth and considering asking for a raise. \n\nThe main concerns raised revolve around the feasibility of reduced hours and maintaining the same workload, as well as potential repercussions for asking for a raise. Some commenters also express concern about the author's future job security. \n\nOverall, the sentiment of the commenters is mixed, with some empathizing with the author's struggles and supporting their decisions, while others offer criticism or practical advice. The most upvoted comment is by a user who suggests asking for a raise, stating, \"If you don't ask, you won't receive.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]