[
  {
    "Link": "The author has been a freelance design engineer for 13 years, earning an estimated $464,616 before taxes, primarily through Craigslist gigs. Despite loving the work when it?s challenging and collaborative, they?ve struggled with low income, poor treatment, declining health, isolation, and financial stress. In recent years, they started a business focused on securing SBIR (Small Business Innovation Research) grants, which could potentially provide significant income and fulfilling work. However, the process is highly competitive, and they?ve yet to secure funding. Currently, they?re facing severe financial difficulties, with overdue bills and rent, and are considering taking a full-time job offered by a former coworker, though it would distract from their business. Despite the challenges, they remain hopeful about the potential of SBIR funding and are preparing multiple proposals for 2020, aiming for a significant financial turnaround. The author feels stuck but is reluctant to give up on their business due to its potential.",
    "Subreddit": "",
    "Title": "This Reddit post by a freelance design engineer details their struggles with low income, poor treatment, health issues, and financial stress despite loving their work. They recently started a business focused on securing SBIR grants but have yet to secure funding, leading to severe financial difficulties. While considering a full-time job, they remain hopeful about the potential of SBIR funding and are preparing multiple proposals for 2020. The discussion mainly highlights the author's determination and resilience in the face of adversity, with commenters praising their work ethic and offering support and advice for their business. However, there are concerns about the competitiveness of the SBIR process and the financial strain the author is facing. Overall, the sentiment is empathetic and encouraging, with commenters rooting for the author's success. The most upvoted comment urges them to take the full-time job opportunity to secure stability before pursuing their business again.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]