[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post shares a personal story of an entrepreneur's struggles over the past few years, leading to 8 million pesos ($141,000) in debt. They initially found success with a physical store selling clothing but were forced to shift to online sales due to the COVID-19 pandemic, which resulted in significant loans and mismanagement leading to the closure of their business. Attempts at affiliate marketing and launching an ebook also failed, causing the narrator to feel defeated and regretful. They question their dreams and purpose and seek advice on transitioning to freelancing for stability. Commenters empathize with the narrator's situation, acknowledging their efforts and offering advice on learning from mistakes and not giving up. Many highlight the importance of mental health and seeking support from loved ones. The most upvoted comment suggests taking time to grieve, reflect and learn from the experience, and channeling this knowledge into future ventures. Overall, the sentiment is supportive and encouraging, emphasizing the resilience and resources within the entrepreneurial community. The comment with the most upvotes states, \"Failure is never easy, but it builds character and experience. Use this as a lesson and never give up on yourself.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]