[
  {
    "Link": "The owner of a handmade suit shop on Etsy, which generated $54.8K in revenue with around 450 sales, faced suspension in October 2023 due to a backlog of custom orders and customer satisfaction issues. Despite having a good track record and providing detailed sizing guides and consultations, many overdue orders resulted in customer complaints, leading to case openings and automatic refunds from Etsy. A dispute with a Japanese customer over customs fees and a negative review contributed to the situation. With active orders pending, thousands of dollars in fabric stock, and four employees relying on the business, the owner expressed panic and frustration over the suspension, claiming their attempts to communicate with customers were misconstrued. They urged others in the small business community to diversify their platforms and voiced their discontent with Etsy's handling of the matter.",
    "Subreddit": "#N/A",
    "Title": "This Reddit post is about a handmade suit shop on Etsy that generated over $54K in revenue but faced suspension in October 2023 due to a backlog of custom orders and customer satisfaction issues. The owner had a good track record and provided helpful sizing guides and consultations but still received customer complaints and automatic refunds from Etsy. There was also a dispute with a Japanese customer over customs fees and a negative review. The owner shared their panic and frustration over the suspension, emphasizing the impact it would have on their business and employees. They urged others in the small business community to diversify their platforms and expressed disappointment in Etsy's handling of the situation.\n\nThe key positive points from commenters included sympathy for the owner's predicament, suggestions for legal action and diversifying sales platforms, and praise for their customer service efforts.\n\nThe main concerns raised were the lack of communication from Etsy and the impact on the business and its employees. Many commenters also expressed frustration with Etsy's strict policies and handling of customer complaints.\n\nOverall, the sentiment of commenters was sympathetic towards the owner but critical of Etsy's actions. The comment with the most upvotes stated, \"Etsy should have a better system in place for cases like this. Suspending a shop without proper communication and understanding of the situation is not fair.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]