[
  {
    "Link": "The author has been a freelance design engineer for 13 years, earning an estimated $464,616 before taxes, primarily through Craigslist gigs. Despite loving the work when it?s challenging and collaborative, they?ve struggled with low income, poor treatment, declining health, isolation, and financial stress. In recent years, they started a business focused on securing SBIR (Small Business Innovation Research) grants, which could potentially provide significant income and fulfilling work. However, the process is highly competitive, and they?ve yet to secure funding. Currently, they?re facing severe financial difficulties, with overdue bills and rent, and are considering taking a full-time job offered by a former coworker, though it would distract from their business. Despite the challenges, they remain hopeful about the potential of SBIR funding and are preparing multiple proposals for 2020, aiming for a significant financial turnaround. The author feels stuck but is reluctant to give up on their business due to its potential.",
    "Subreddit": "",
    "Title": "The discussion on this Reddit post centers around a freelance design engineer who has been struggling financially despite having a successful career on Craigslist. This individual recently started a business focusing on securing SBIR grants, but has not been successful in obtaining funding yet. The author is facing severe financial difficulties and is considering taking a full-time job, which would distract from their business. Despite this, they remain hopeful about the potential of SBIR funding and are preparing multiple proposals. The main positive points highlighted by commenters include the author's determination and the potential of SBIR funding to turn their financial situation around. Concerns were raised about the competitiveness of the SBIR process, as well as the toll that low income and financial stress can have on one's mental and physical health. Overall, there is a sense of empathy and support for the author, with many offering words of encouragement and advice. The comment with the most upvotes states, \"Kudos to you for your resilience and determination. Keep pushing and I'm sure things will turn around.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]