[
  {
    "Link": "The owner of a handmade suit shop on Etsy, which generated $54.8K in revenue with around 450 sales, faced suspension in October 2023 due to a backlog of custom orders and customer satisfaction issues. Despite having a good track record and providing detailed sizing guides and consultations, many overdue orders resulted in customer complaints, leading to case openings and automatic refunds from Etsy. A dispute with a Japanese customer over customs fees and a negative review contributed to the situation. With active orders pending, thousands of dollars in fabric stock, and four employees relying on the business, the owner expressed panic and frustration over the suspension, claiming their attempts to communicate with customers were misconstrued. They urged others in the small business community to diversify their platforms and voiced their discontent with Etsy's handling of the matter.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post features a discussion on the suspension of a handmade suit shop on Etsy that generated $54.8K in revenue with around 450 sales. The owner faced suspension in October 2023 due to a backlog of custom orders and customer satisfaction issues. While the owner had a good track record and provided detailed sizing guides and consultations, many overdue orders resulted in customer complaints, case openings, and automatic refunds from Etsy. A dispute with a Japanese customer over customs fees and a negative review also contributed to the situation. With active orders pending, thousands of dollars in fabric stock, and four employees relying on the business, the owner expressed panic and frustration over the suspension and urged others in the small business community to diversify their platforms. Concerns were raised over Etsy's handling of the matter, with many commenters expressing empathy for the owner's situation. The top comment, with the most upvotes, highlighted the need for small businesses to have a backup plan and not rely solely on one platform.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]