[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "The author, a person in their 40s, has shared that they have been successfully managing a side hustle that has outperformed their full-time job for the past three years. They have now resigned from their job due to declining mental and physical health, without disclosing the reason. The company offered to adjust their schedule to retain them, but the author doubts the feasibility of reduced hours while maintaining the same workload. They are now considering asking for a raise, even though it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides. Many commenters applaud the author's success with their side hustle and acknowledge the importance of taking care of one's health. There are also concerns raised about the potential risks of asking for a raise and the impact it could have on their job security. The overall sentiment is one of support and encouragement, with many suggesting that the author prioritize their health and explore other job opportunities that align with their values. The comment with the most upvotes reads, \"Your health and well-being should always come first, especially if you have a successful side hustle. Don't be afraid to explore other options and don't let fear hold you back from asking for what you deserve.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]