[
  {
    "Link": "The author has spent 13 years freelancing as a design engineer, often feeling undervalued and struggling financially, with their health deteriorating over time. They transitioned to starting their own business but have yet to generate income, mainly focusing on securing Small Business Innovation Research (SBIR) funding, which is highly competitive. Despite the challenges, they see potential for significant income if successful. Currently facing financial strain, including late bills and rent, they have been offered a full-time job that may distract from their business efforts, but they feel it necessary for immediate income. They express frustration over their situation, the cyclical nature of their struggles, and the difficulty in finding quality freelance work outside of Craigslist, ultimately seeking advice and support.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the struggles of a freelance design engineer who has been in the industry for 13 years, feeling undervalued and financially strained. Despite transitioning to starting their own business, they have yet to generate income and have been mainly focused on securing Small Business Innovation Research (SBIR) funding. They express frustration over their cyclical struggles and difficulty in finding quality freelance work outside of Craigslist. Despite the challenges, they see potential for significant income if successful. However, they are currently facing financial strain with late bills and rent and have been offered a full-time job that may distract from their business efforts. The commenters offer support and advice, with many offering words of encouragement and sharing their own experiences in the industry. The overall sentiment is one of understanding and empathy, with many pointing out the difficulties of being a freelancer and suggesting alternative ways to find work. The most upvoted comment, with over 500 upvotes, advises the author to not give up on their business and to continue to seek out funding opportunities.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]