[
  {
    "Link": "https://www.reddit.com/r/news/comments/1ec5955/video_game_performers_will_go_on_strike_over/",
    "Subreddit": "video_game_performers_will_go_on_strike_over",
    "Title": "Introduction:\nThe Reddit post discusses the looming strike of video game performers and its potential impact on the gaming industry. The Screen Actors Guild - American Federation of Television and Radio Artists (SAG-AFTRA) has proposed a strike as a result of failed contract negotiations with game companies, leading to a heated discussion among Reddit commenters.\n\nKey positive points:\nMany commenters express gratitude for the bravery and determination of the performers in standing up for their rights and ensuring fair working conditions in the industry. They highlight the importance of this strike in setting a precedent for future negotiations and improving conditions for all workers in the gaming industry.\n\nMain concerns raised:\nThe main concerns raised by commenters revolve around the potential impact of the strike - both on the gaming companies and the performers themselves. Some are worried about the potential loss of some highly anticipated games, while others express concerns about the performers losing their jobs and facing financial difficulties.\n\nOverall sentiment:\nThe overall sentiment of the commenters is positive, with the majority supporting the strike and acknowledging the justness of the performers' demands. They also express hope for a successful negotiation between SAG-AFTRA and game companies, while also acknowledging the difficult decision to go on strike.\n\nMost upvoted comment:\nThe most upvoted comment is from user AndyJWilliams: \"It's about time game companies started treating their performers with the same respect and fairness as other entertainment industries. The amount of profit these companies make from these games is astronomical, and it's only fair that the performers, who play a crucial role in the success of these games, be properly compensated and have better working conditions.\"",
    "CommentsPerDay": 2.6166666666666667,
    "NumberOfComments": 314,
    "URL": "r/news"
  }
]