[
  {
    "Link": "The author shares their journey of building and selling their first business while being a full-time college student with no prior business experience. Starting with a $20 Steam giftcard in Spring 2017, they traded skins, developed a trading site for Rust, and grew it to 40,000 users and $250,000 in processed trades. Key milestones include hiring developers, investing in influencer ads, and achieving $17,000 in revenue. Despite challenges like scams, declining profits, and balancing school, they sold 90% of the site for $2,200 in Spring 2018, retaining a 10% stake. The experience taught them about entrepreneurship, marketing, and development, netting over $12,000 in profits and valuable lessons for future ventures.",
    "Subreddit": "",
    "Title": "This Reddit post documents the journey of a college student with no prior business experience, who successfully built and sold their first business. Starting with a $20 Steam giftcard in Spring 2017, the author traded skins and developed a trading site for Rust, which grew to 40,000 users and $250,000 in processed trades. Key milestones included hiring developers, investing in influencer ads, and achieving $17,000 in revenue. Despite facing challenges like scams, declining profits, and balancing school, the author was able to sell 90% of the site for $2,200 in Spring 2018, retaining a 10% stake. The experience taught them valuable lessons in entrepreneurship, marketing, and development, and netted over $12,000 in profits. Commenters praised the author for their determination and success, highlighting their impressive growth and ability to overcome obstacles. Concerns were also raised about the risks involved in the business, such as dealing with scams and balancing it with school. Overall, the sentiment of the commenters was positive, with many acknowledging the author's hard work and potential for future ventures. One of the comments with the highest number of upvotes stated, \"Great job! Your success shows that with determination and hard work, anything is possible.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]