[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "A side hustle outperforming full-time job\n\nThis Reddit post explores the dilemma of a person in their 40s who has been successfully managing a side hustle that is performing better than their full-time job for the past three years. Due to declining mental and physical health, the individual has resigned from their job without disclosing their side hustle. While the company has offered to adjust their schedule, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now considering asking for a raise, despite the risk of future layoffs, as they see their current job as the end of their corporate career and value its remote work flexibility.\n\nCommenters on this post highlighted the positive aspects of the author's situation, such as their successful side hustle, the flexibility of their current job, and their experience and skills that have enabled them to manage both without disclosure. However, main concerns raised revolve around the author's physical and mental health, and the potential consequences of disclosing their successful side hustle, asking for a raise, or taking on a reduced workload. Some also shared similar experiences and offered advice, suggesting that the author should prioritize their well-being and consider other opportunities for growth and fulfillment.\n\nOverall, the sentiment of the commenters is mostly empathetic, with many expressing support for the author's decision and encouraging them to prioritize their health and well-being. The comment with the most upvotes reads, \"In the end, your health and happiness are more important than any job or money. You've proven that you have the skills and drive to succeed on your own terms, and that is something to be proud of and build upon.\" This reinforces the idea that the author should prioritize their well-being and consider their side hustle as a potential full-time opportunity rather than risking their health and job security at their current company.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]