[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the struggles of an entrepreneur who accumulated 8 million pesos in debt over the past few years. They initially found success with a physical store but the COVID-19 pandemic forced them to shift to online sales, leading to more loans and eventual failure. Despite generating 29 million pesos in sales, mismanagement and failed attempts at affiliate marketing and ebook launch worsened their financial situation, causing them to question their ambitions and purpose. The narrator seeks advice on moving on from their dreams and considering freelancing as a more stable path. \n\nSome key positive points mentioned by commenters include the importance of learning from failures and taking responsibility for financial decisions. They also highlight the courage and determination of the narrator for sharing their story and seeking advice. \n\nThe main concerns raised by commenters revolve around the narrator's use of loans and lack of expertise in online sales and marketing. Some also express concern for the narrator's family and the burden the debt may have on them. \n\nThe overall sentiment seems to be sympathetic towards the struggles of the narrator and at the same time, encouraging and supportive of their future endeavors. Many commenters shared their own experiences of failure and offered practical advice for moving forward. \n\nThe comment with the most upvotes is \"Don't let failure define you, learn from it and keep moving forward. All successful entrepreneurs have failed multiple times before they found success.\" This comment embodies the overall sentiment and highlights the importance of resilience and learning from failure.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]