[
  {
    "Link": "The author has spent 13 years freelancing as a design engineer, often feeling undervalued and struggling financially, with their health deteriorating over time. They transitioned to starting their own business but have yet to generate income, mainly focusing on securing Small Business Innovation Research (SBIR) funding, which is highly competitive. Despite the challenges, they see potential for significant income if successful. Currently facing financial strain, including late bills and rent, they have been offered a full-time job that may distract from their business efforts, but they feel it necessary for immediate income. They express frustration over their situation, the cyclical nature of their struggles, and the difficulty in finding quality freelance work outside of Craigslist, ultimately seeking advice and support.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the struggles of a design engineer turned business owner who has been facing financial strain for the past 13 years, feeling undervalued and struggling to find quality freelance work. The author has transitioned to starting their own business, but it has yet to generate income, with the focus being on securing SBIR funding. Despite potential for significant income, the author is currently facing late bills and rent and has been offered a full-time job, which may distract from their business efforts. The overall sentiment of the commenters is one of empathy and support, with many offering advice and encouragement. Positive points include the potential for success and income with the business, as well as the resilience and determination of the author. Concerns raised include the difficulty of securing SBIR funding and the financial strain the author is currently experiencing. One commenter's sentiment sums up the general consensus of the thread: \"Hang in there - it may be tough now, but your hard work and determination will eventually pay off.\" The comment with the most upvotes was from someone who also faced similar struggles and offered advice on never giving up and continually networking for freelance opportunities.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]