[
  {
    "Link": "The author started their business in 2007 after 18 years at a failing company, leveraging 22 years of experience and client loyalty. They worked from home, avoiding real estate costs, and survived the 2008 crash. Both the author and their husband are self-employed. Despite enduring the COVID-19 pandemic, rising costs (up 50% in 2020) made the business unsustainable. They are now considering a part-time 1099 contract with a long-term vendor, acknowledging they were fortunate not to close in 2020 like many other small businesses.",
    "Subreddit": "",
    "Title": "This Reddit post discusses the experience of an individual who started their business in 2007, leveraging their years of experience and client loyalty. They were able to work from home and survive the 2008 crash, but faced challenges during the COVID-19 pandemic, including a 50% increase in costs that made the business unsustainable. The author is now considering a part-time 1099 contract with a long-term vendor, acknowledging their fortunate position compared to other small businesses that were forced to close in 2020.\n\nThe comment section showcases a mix of positive and negative sentiments. Many commenters praise the author's determination and resilience in navigating through difficult times. Some also commend their wise decision to work from home, which helped them save on real estate costs. There is also appreciation for their consideration of a part-time contract as a way to sustain their business, rather than giving up entirely.\n\nHowever, there are also concerns raised about the instability of running a small business, especially during a pandemic. Commenters highlight the rising costs and acknowledge that it's not feasible for all businesses to survive without outside support. Some express empathy for the challenges faced by the author and others in similar situations.\n\nOverall, the commenters are impressed by the author's success and root for their continued success. There is a sense of camaraderie and support amongst the community, with many offering advice and resources to help the author sustain their business. The comment with the most upvotes is from a fellow self-employed individual who shares their own struggles and offers words of encouragement: \"Hang in there, I know it's tough but you've got this. We are all rooting for you.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]