[
  {
    "Link": "The owner of a custom suit shop on Etsy, with 450 sales and $54.8K revenue since launching online in October 2023, details the sudden suspension of their shop. Despite a history of handmade products and attempts to communicate with customers about overdue custom orders, Etsy suspended the shop without prior warnings. The suspension was triggered by customers opening cases due to overdue orders, leading to immediate refunds from Etsy. The owner suspects a false review from a dissatisfied customer and points out inconsistencies in Etsy's enforcement, such as other shops using stolen images remaining active. The situation has caused severe anxiety, as they have outstanding orders, employees to support, and significant materials on hand. The owner expresses frustration with Etsy's policies and urges caution for other small businesses reliant on the platform.",
    "Subreddit": "",
    "Title": "This Reddit post features a small business owner on Etsy expressing frustration with the sudden suspension of their shop and the negative impact it has had on their business. Despite having a successful track record with 450 sales and $54.8K in revenue since launching in October 2023, the shop was suspended without prior warnings due to open cases from customers with overdue custom orders. The owner suspects a false review may have triggered the suspension, and points out inconsistencies in Etsy's enforcement, such as other shops using stolen images remaining active. This has caused severe anxiety for the owner, who has outstanding orders, employees to support, and significant materials on hand. Respondents highlight the positive qualities of the owner's handmade products and commend their efforts to communicate with customers about overdue orders. The main concerns raised include the lack of transparency and consistency in Etsy's policies, potential bias against small businesses, and the impact of the suspension on the owner's livelihood. Overall, the sentiment among commenters is one of empathy and frustration with Etsy's handling of the situation. The most upvoted comment suggests that the shop owner should consider pursuing legal action against Etsy.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]