[
  {
    "Link": "https://www.reddit.com/r/WGU/comments/1fj97ss/master_in_artificial_intelligence_coming_out_soon/",
    "Subreddit": "master_in_artificial_intelligence_coming_out_soon",
    "Title": "Introduction:\nThe Reddit post is about the announcement of a new Master's program in Artificial Intelligence (AI) by WGU. The post received a lot of comments from users expressing their thoughts and opinions about the program.\n\nKey Positive Points:\nSeveral users were excited about the new Master's program, stating that it is a much-needed program in today's world where the demand for AI experts is increasing. Many users also appreciated WGU's reputation and affordable tuition fees, making the program accessible to a wider range of students. Some users also highlighted the flexibility of the online format, making it easier for working professionals to pursue the program.\n\nMain Concerns Raised:\nOne of the main concerns raised by users was the lack of information about the specific courses and curriculum of the program. Some users also questioned the credibility of the program and whether it would be recognized by employers. Some expressed concerns about the level of difficulty of the program and if it would be suitable for students with no prior experience in AI.\n\nOverall Sentiment:\nThe overall sentiment among commenters was positive, with many expressing their interest and excitement for the new AI Master's program. Some users shared their personal experiences with WGU, praising the university for its competency-based approach and supportive learning environment. However, there were also some concerns and questions raised, indicating a level of cautiousness among commenters.\n\nComment with Most Upvotes:\nThe comment with the most upvotes was from a user who shared their experience with WGU's IT program and stated, \"I completed WGU's IT program last year and couldn't be more impressed with their competency-based model and value for money. Will definitely be keeping an eye on this AI program.\" This comment highlights the positive sentiment towards WGU and its programs among users.",
    "CommentsPerDay": 2.15,
    "NumberOfComments": 129,
    "URL": "r/WGU"
  }
]