[
  {
    "Link": "A civil engineering student received $10,000 in grants from his university to support his dog collar business, which he integrated as part of his co-op requirements. He highlights the benefits of utilizing university resources, mentorship, and funding opportunities while in school, countering the common notion that one must drop out to succeed in business. He encourages others to explore the resources available at their educational institutions.",
    "Subreddit": "",
    "Title": "In this Reddit post, a civil engineering student shares their positive experience with utilizing the resources at their university to support their dog collar business, which was integrated into their co-op requirements. The student highlights the benefits of mentorship, access to funding, and using university resources, debunking the belief that dropping out is necessary for success in business. The post encourages others to explore the opportunities available at their educational institutions. \n\nMany commenters praised the student's success and agreed that universities have valuable resources for entrepreneurship, such as networking events and business development programs. The idea of combining business and education was also positively received, with some commenters sharing their own experiences with starting a business while still in school. The main concern that was raised was the potential conflict of interest and whether the student's co-op requirements were affected. Some also mentioned that not all universities have the same level of support for entrepreneurship. However, the overall sentiment of the commenters was largely positive, with many applauding the student's dedication and initiative. \n\nThe most upvoted comment highlighted the importance of developing valuable skills through the co-op program and utilizing university resources to support entrepreneurial ventures. It also emphasized that starting a business while in school can provide a valuable learning experience and can be a great opportunity for personal and professional growth.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]