[
  {
    "Link": "The author has been a freelance design engineer for 13 years, earning an estimated $464,616 before taxes, primarily through Craigslist gigs. Despite loving the work when it?s challenging and collaborative, they?ve struggled with low income, poor treatment, declining health, isolation, and financial stress. In recent years, they started a business focused on securing SBIR (Small Business Innovation Research) grants, which could potentially provide significant income and fulfilling work. However, the process is highly competitive, and they?ve yet to secure funding. Currently, they?re facing severe financial difficulties, with overdue bills and rent, and are considering taking a full-time job offered by a former coworker, though it would distract from their business. Despite the challenges, they remain hopeful about the potential of SBIR funding and are preparing multiple proposals for 2020, aiming for a significant financial turnaround. The author feels stuck but is reluctant to give up on their business due to its potential.",
    "Subreddit": "",
    "Title": "The author of the Reddit post is a freelance design engineer who has been in the industry for 13 years, earning a substantial amount of money through Craigslist gigs. They have faced financial difficulties, along with health issues and poor treatment, and are now considering taking a full-time job offered by a former coworker. However, they are still hopeful about their business, which focuses on securing SBIR grants. Although the process is competitive and they have yet to secure funding, they have multiple proposals planned for 2020. The main themes among commenters include admiration for the author's perseverance and optimism, concern for their financial struggles and potential burnout, and encouragement for them to consider all options before making a decision. The overall sentiment is one of support and empathy towards the author, with many offering helpful advice for their situation. The most upvoted comment states, \"Hang in there, OP. You've come this far - don't give up now.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]