[
  {
    "Link": "The owner of a custom suit shop on Etsy, with 450 sales and $54.8K revenue since launching online in October 2023, details the sudden suspension of their shop. Despite a history of handmade products and attempts to communicate with customers about overdue custom orders, Etsy suspended the shop without prior warnings. The suspension was triggered by customers opening cases due to overdue orders, leading to immediate refunds from Etsy. The owner suspects a false review from a dissatisfied customer and points out inconsistencies in Etsy's enforcement, such as other shops using stolen images remaining active. The situation has caused severe anxiety, as they have outstanding orders, employees to support, and significant materials on hand. The owner expresses frustration with Etsy's policies and urges caution for other small businesses reliant on the platform.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the suspension of a successful custom suit shop on Etsy, with 450 sales and $54.8K revenue since launching online in October 2023. The owner details their sudden suspension without warning due to customers opening cases for overdue orders. Despite a history of handmade products and attempts to communicate with customers, Etsy suspended the shop and immediately issued refunds. The owner suspects a false review from a dissatisfied customer and points out inconsistencies in Etsy's enforcement, such as other shops using stolen images remaining active. Key positive points brought up by commenters include the shop's success and quality products, as well as the need for more transparency and warning from Etsy. Main concerns raised include the lack of communication and support from Etsy, the potential impact on the shop's employees and materials, and the frustration with Etsy's policies. The overall sentiment of commenters is one of sympathy towards the owner and frustration with Etsy's handling of the situation. The top comment with the most upvotes states \"Etsy needs to do better with communication and enforcement, this is unacceptable for small businesses.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]