[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "The Reddit post shares the struggle of a middle-aged person who has been successfully managing a side hustle that has outperformed their full-time job for the past three years. They recently resigned due to declining mental and physical health but did not disclose their side hustle. The company offered to adjust their schedule to retain them, but the author doubts the feasibility of maintaining the same workload in reduced hours. They are now considering asking for a raise, even knowing it could lead to future layoffs, as they value the remote work flexibility their current job offers and see it as the end of their corporate career.\n\nIn the comments, many applauded the author for their success in their side hustle and expressed empathy for their struggles with their full-time job. They encouraged the author to prioritize their health and not feel guilty for resigning. Some also suggested exploring freelance opportunities or transitioning to the side hustle as a full-time job. On the other hand, some raised concerns about the potential risks of asking for a raise and losing their job. They emphasized the importance of negotiating carefully and considering the long-term implications. \n\nOverall, the sentiment from the commenters was supportive and understanding of the author's difficult decision. They encouraged the author to prioritize their health and consider all options before making any decisions. The comment with the most upvotes was from a user who praised the author for being brave and acknowledged the challenges of juggling a side hustle and a full-time job.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]