[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the struggles of an entrepreneur who accumulated 8 million pesos ($141,000) in debt while trying to run a successful business. Despite generating 29 million pesos ($512,000) in sales, mismanagement and failed ventures such as affiliate marketing and launching an ebook led to the business's closure. The narrator expresses feelings of defeat, regret and concern for their family's well-being and seeks advice on letting go of their dreams. Many commenters sympathize with the narrator's situation and offer words of encouragement to not give up and to learn from past mistakes. Others highlight the importance of proper financial management and the need for a solid business plan. The overall sentiment is mixed, with some expressing sadness and understanding, while others express frustration and the need to move on from their failed business. The most upvoted comment states, \"Failure is not the end of your journey. Learn from your mistakes and keep pushing forward. You are resilient and capable of overcoming this challenge.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]