[
  {
    "Link": "The author has been a freelance design engineer for 13 years, earning an estimated $464,616 before taxes, primarily through Craigslist gigs. Despite loving the work when it?s challenging and collaborative, they?ve struggled with low income, poor treatment, declining health, isolation, and financial stress. In recent years, they started a business focused on securing SBIR (Small Business Innovation Research) grants, which could potentially provide significant income and fulfilling work. However, the process is highly competitive, and they?ve yet to secure funding. Currently, they?re facing severe financial difficulties, with overdue bills and rent, and are considering taking a full-time job offered by a former coworker, though it would distract from their business. Despite the challenges, they remain hopeful about the potential of SBIR funding and are preparing multiple proposals for 2020, aiming for a significant financial turnaround. The author feels stuck but is reluctant to give up on their business due to its potential.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the struggles of a freelance design engineer who has been in the field for 13 years, but has faced challenges with low income, poor treatment, declining health, isolation, and financial stress. The author has recently shifted focus to securing SBIR grants, but has yet to receive funding and is facing severe financial difficulties. Many commenters express sympathy and offer encouragement, highlighting the author's determination and potential for success with SBIR funding. However, there are concerns about the competitiveness of the grants and the potential distraction of a full-time job. The overall sentiment is a mix of understanding and hope, with commenters emphasizing the importance of not giving up on the business. The comment with the most upvotes reads, \"Hang in there, the potential for SBIR funding seems promising and your determination is inspiring.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]