[
  {
    "Link": "The author shares a personal account of pursuing entrepreneurial dreams, ultimately leading to 8 million pesos ($141,000) in debt. Beginning in 2019 with a small clothing store, initial success was met with the pandemic, resulting in a surge in online sales. However, a series of poor financial decisions, including taking out loans and neglecting to track costs, led to mounting debt and repeated business closures. Despite generating significant sales over the years, the entrepreneur faced overwhelming regret and depression, feeling like a failure to her supportive family. After multiple attempts at different ventures, including affiliate marketing and writing an ebook, she recognizes the need for stability and plans to pursue freelancing to manage her debt. The story highlights the struggle between ambition and reality, questioning the pursuit of big dreams when faced with repeated failures.",
    "Subreddit": "#N/A",
    "Title": "This Reddit post shares a personal story of an entrepreneur who pursued their dream, but ended up with 8 million pesos ($141,000) in debt. The entrepreneur started with a small clothing store in 2019 and experienced initial success, but faced challenges due to the pandemic. Poor financial decisions, such as taking out loans and neglecting to track costs, led to mounting debt and repeated business closures. Despite generating significant sales, the entrepreneur faced regret and depression, feeling like a failure to their supportive family. The story raises questions about the pursuit of big dreams when faced with repeated failures. While some commenters applaud the entrepreneur for their determination and resilience in the face of adversity, others question their poor financial decisions and suggest seeking professional advice. The overall sentiment is sympathetic towards the entrepreneur's struggles and the need for stability. The comment with the most upvotes reads, \"It takes courage to share such a personal story. Keep moving forward and learn from your mistakes. You've got this.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]