[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post detailed the experience of a person in their 40s who was successfully managing a side hustle that had been outperforming their full-time job for the past three years. Due to declining mental and physical health, the author resigned from their job without disclosing their side hustle. While the company offered to adjust their schedule to retain them, the author had doubts about the feasibility of reduced hours while maintaining the same workload. They are now considering asking for a raise, even though it may designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides. Many commenters praised the author for their success in their side hustle and for prioritizing their health and well-being. Some highlighted the importance of negotiating for a raise, while others voiced concerns about the long-term stability of the current job and suggested exploring other opportunities. The overall sentiment was one of support and encouragement for the author, with many empathizing with their situation. The most upvoted comment was, \"Take care of yourself first. You can always find another job, but your health is irreplaceable.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]