[
  {
    "Link": "The author has spent 13 years freelancing as a design engineer, often feeling undervalued and struggling financially, with their health deteriorating over time. They transitioned to starting their own business but have yet to generate income, mainly focusing on securing Small Business Innovation Research (SBIR) funding, which is highly competitive. Despite the challenges, they see potential for significant income if successful. Currently facing financial strain, including late bills and rent, they have been offered a full-time job that may distract from their business efforts, but they feel it necessary for immediate income. They express frustration over their situation, the cyclical nature of their struggles, and the difficulty in finding quality freelance work outside of Craigslist, ultimately seeking advice and support.",
    "Subreddit": "",
    "Title": "The author of the Reddit post shared their experience of feeling undervalued and financially struggling as a design engineer for 13 years before transitioning to starting their own business. However, they have yet to generate income and are currently facing financial strain. The main focus of their business efforts is securing Small Business Innovation Research (SBIR) funding, which is highly competitive and seen as a potential source of significant income. While the author expresses frustration over their situation and the cyclical nature of their struggles, they appreciate the advice and support offered by the commenters. The main concerns raised by the commenters include the difficulty in finding quality freelance work outside of Craigslist and the potential distraction of a full-time job offer. The overall sentiment of the commenters is empathetic towards the author's struggles and encouraging them to continue pursuing their business goals. The top-rated comment, with 156 upvotes, advises the author to prioritize their mental and physical health first before making any business decisions.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]