[
  {
    "Link": "The author has spent 13 years freelancing as a design engineer, often feeling undervalued and struggling financially, with their health deteriorating over time. They transitioned to starting their own business but have yet to generate income, mainly focusing on securing Small Business Innovation Research (SBIR) funding, which is highly competitive. Despite the challenges, they see potential for significant income if successful. Currently facing financial strain, including late bills and rent, they have been offered a full-time job that may distract from their business efforts, but they feel it necessary for immediate income. They express frustration over their situation, the cyclical nature of their struggles, and the difficulty in finding quality freelance work outside of Craigslist, ultimately seeking advice and support.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the author's 13-year struggle as a freelance design engineer, feeling undervalued and facing financial difficulties, ultimately leading to a decline in their health. They have transitioned to starting their own business but have not yet generated income, focusing on securing highly competitive Small Business Innovation Research (SBIR) funding. The author expresses potential for significant income if successful but is currently facing financial strain, including late bills and rent. They have been offered a full-time job that may distract from their business efforts, but they feel it necessary for immediate income. The post reveals frustration over the cyclical nature of their struggles and the difficulty in finding quality freelance work outside of Craigslist. Overall, commenters offer advice and support, with some highlighting the potential for success and acknowledging the challenging nature of the situation. The comment with the most upvotes expresses empathy towards the author's struggles and encourages them to keep pushing through.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]