[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "#N/A",
    "Title": "This Reddit post chronicles the struggles of an entrepreneur who has accumulated 8 million pesos in debt over the past few years. They initially found success with a physical store, but the pandemic forced them to shift to online sales and incurred significant debts in the process. Despite generating 29 million pesos in sales, the business ultimately failed due to mismanagement. The narrator also attempted affiliate marketing and launching an ebook, both of which were unsuccessful. The post ends with the narrator questioning their ambitions and purpose, seeking advice on letting go of their dreams and pursuing freelancing instead. \nMany commenters expressed empathy and support for the narrator, applauding their determination and resilience despite the setbacks. Some highlighted the valuable lessons they can learn from this experience and advised against giving up entirely. However, others raised concerns about the narrator's mental health and urged them to seek professional help. Overall, the commenters had a sympathetic and encouraging attitude towards the narrator's situation, with the most upvoted comment offering words of encouragement and reminding them of their past successes. The comment read, \"It's not about how many times you fall, it's about how many times you get back up. You've already achieved success before, and I have no doubt that you will do it again.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]