[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "In this Reddit post, the narrator shares their struggles with entrepreneurship, revealing that despite generating 29 million pesos in sales, they incurred 8 million pesos in debt and ultimately had to close their business due to mismanagement and pandemic-related challenges. The post garnered a lot of attention and sparked a meaningful discussion, with many commenters offering words of support and encouragement to the narrator. Some of the key positive points mentioned included the importance of learning from failures and using them as stepping stones for future success, as well as the value of seeking guidance and considering alternative paths, such as freelancing. However, many also expressed concerns about the narrator's financial situation and the impact it may have on their family, urging them to prioritize their well-being before pursuing their dreams. The overall sentiment of the commenters was one of empathy and understanding, with many sharing their own struggles and offering advice and words of encouragement. The top-voted comment, with 230 upvotes, reminded the narrator to let go of past failures and focus on the present and future, saying \"Your past failures do not define you. You still have potential and a lot to offer the world.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]