[
  {
    "Link": "A customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After realizing the item wasn't suitable, they returned it, paying $14 for shipping. However, USPS marked the package as \"unclaimed\" after three delivery attempts, and it was returned to the sender. The customer contacted the business for a refund, but the business refused to pay for the return shipping and insisted on receiving the item to process the refund, resulting in the customer facing an additional $14 cost. The customer is frustrated and considering a chargeback, feeling the business is not honoring its return policy fairly.",
    "Subreddit": "",
    "Title": "This Reddit post centers around a customer's frustration with a small business's return policy. The customer ordered a $50 item with a \"30-day return\" and \"100% satisfaction guarantee,\" but after deciding the item wasn't suitable, they returned it for a $14 shipping fee. However, USPS marked the package as \"unclaimed\" and returned it to the sender after three delivery attempts. The customer reached out for a refund, but the business refused to cover the return shipping and insisted on receiving the item before processing the refund. This has led the customer to consider a chargeback as they feel the business is not honoring their return policy fairly.\n\nMany commenters on the post empathize with the frustration faced by the customer, stating that the business should have covered the return shipping fees as per their return policy. Some even suggest that the business should have offered a replacement or store credit instead of forcing the customer to pay additional fees. Others raise concerns about the lack of communication and customer service from the business, with some sharing similar experiences. Overall, the sentiment of the commenters is that the business is not being fair to the customer and that their actions could result in negative consequences for their reputation. The most upvoted comment, with over 1.5k upvotes, reads: \"No business should act this way, and I would never buy from them again. It's not worth the risk of dealing with their terrible customer service.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]