[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "#N/A",
    "Title": "In this Reddit post, the author is in their 40s and has successfully managed a side hustle that has outperformed their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. The company offered to adjust their schedule to retain them, but the author doubts the feasibility of reduced hours while maintaining the same workload. They are now considering asking for a raise, even knowing it may put them at risk for future layoffs. The author values the remote work flexibility provided by their job but sees it as the end of their corporate career. \n\nThe discussion on this post reveals positive aspects such as the author's success in their side hustle and the flexibility it offers in terms of remote work. Some commenters also commend the author for prioritizing their mental and physical health by resigning from their job. The main concerns raised by commenters include the potential impact of asking for a raise and the feasibility of reduced hours with the same workload. Others suggest alternative options such as negotiating a reduced workload or exploring new job opportunities. Overall, the sentiment of the commenters is supportive and understanding of the author's dilemma, with many offering advice and sharing their own experiences. The comment with the most upvotes reads, \"Prioritizing your health and happiness is always the right move. Good luck with your decision.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]