[
  {
    "Link": "The owner of a handmade custom suit shop on Etsy, with 450 sales and $54.8K revenue since launching online in October 2023, reported the suspension of their shop without prior warning. This was triggered by overdue orders, primarily due to customers not providing necessary measurements despite the owner offering a detailed sizing guide and free consultations. The shop had no policy violations before the suspension and has faced issues with a false customer review. With numerous active orders and significant fabric inventory, the owner is struggling to fulfill orders or manage employee dependencies and has submitted an appeal with no response. The situation has caused significant anxiety and distress, leading to a cautionary note advising against reliance on a single platform like Etsy.",
    "Subreddit": "#N/A",
    "Title": "This Reddit post discusses the recent suspension of a handmade custom suit shop on Etsy, despite having a successful track record of 450 sales and $54.8K in revenue since October 2023. The owner reported that the suspension was triggered by overdue orders, which were primarily caused by customers not providing necessary measurements despite the owner offering a detailed sizing guide and free consultations. This suspension came as a shock, as the shop had no previous policy violations and had even faced issues with a false customer review. The suspension has caused significant disruption to the business, leading to anxiety and distress for the owner. Numerous commenters expressed their support for the owner and praised the quality of their products and service, highlighting the success and hard work of the business. However, there were also concerns raised about the reliance on a single platform like Etsy, and the lack of communication and support from the site in regards to the suspension and appeal process. The overall sentiment of the commenters was one of frustration and disappointment towards Etsy, with many expressing the need for more support and transparency from the platform. The comment with the most upvotes suggested exploring alternative platforms and focusing on building a brand outside of Etsy.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]