[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the situation of a 40-year-old person who has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. The author is now considering asking for a raise, knowing it may result in future layoffs, as they value the remote work flexibility their current job provides. \n\nMany commenters applauded the author for being able to successfully manage a side hustle, highlighting the author's determination and hard work. They also expressed concern for the author's mental and physical health, encouraging them to prioritize self-care and pursue their side hustle as a full-time job. Others shared similar experiences and offered advice on how to make the transition to self-employment. \n\nHowever, some commenters raised concerns about the potential risks of asking for a raise, such as being labelled as a difficult employee and being targeted for future layoffs. They also questioned the feasibility of reducing work hours while maintaining the same workload and encouraged the author to carefully consider their options. \n\nOverall, the sentiment of the commenters was supportive and encouraging, with many offering words of encouragement and advice to the author. The comment with the most upvotes was from a commenter who shared their own experience of successfully transitioning from a full-time job to self-employment and offered advice on how to navigate potential challenges.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]