[
  {
    "Link": "The author shares their journey of building and selling their first business while being a full-time college student with no prior business experience. Starting with a $20 Steam giftcard in Spring 2017, they traded skins, developed a trading site for Rust, and grew it to 40,000 users and $250,000 in processed trades. Key milestones include hiring developers, investing in influencer ads, and achieving $17,000 in revenue. Despite challenges like scams, declining profits, and balancing school, they sold 90% of the site for $2,200 in Spring 2018, retaining a 10% stake. The experience taught them about entrepreneurship, marketing, and development, netting over $12,000 in profits and valuable lessons for future ventures.",
    "Subreddit": "",
    "Title": "In this Reddit post, the author shares their experience of building and selling their first business while being a full-time college student with no prior business background. Starting with a $20 Steam giftcard in 2017, they successfully traded skins and developed a popular trading site for Rust, which grew to 40,000 users and $250,000 in trades. Key milestones included hiring developers, investing in influencer ads, and reaching $17,000 in revenue. Despite challenges such as scams, declining profits, and balancing school, the author sold 90% of the site for $2,200 and retained a 10% stake in 2018. The experience taught them valuable lessons in entrepreneurship, marketing, and development, and resulted in profits of over $12,000. The majority of commenters praised the author's success as a college student and the valuable lessons they learned. Some concerns raised included potential legal issues, the risks of investing in influencer ads, and questioning the ethics of trading skins. Overall, the commenters had a positive sentiment, admiring the author's determination and drive, with the most upvoted comment stating, \"This is such an inspiring story, congratulations on your success and for sharing valuable insights for others looking to start their own businesses.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]