[
  {
    "Link": "The author started their business in 2007 after 18 years at a failing company, leveraging 22 years of experience and client loyalty. They worked from home, avoiding real estate costs, and survived the 2008 crash. Both the author and their husband are self-employed. Despite enduring the COVID-19 pandemic, rising costs (up 50% in 2020) made the business unsustainable. They are now considering a part-time 1099 contract with a long-term vendor, acknowledging they were fortunate not to close in 2020 like many other small businesses.",
    "Subreddit": "",
    "Title": "The Reddit post in question explores an author's experience running a small business, started in 2007 after 18 years at a failing company. The author and their husband are both self-employed and have been able to survive the 2008 crash and the challenges of the COVID-19 pandemic. However, despite their efforts, rising costs (up 50% in 2020) have made the business unsustainable. The author is now considering a part-time 1099 contract with a long-term vendor, realizing they were fortunate not to have closed in 2020 like many other small businesses. \n\nOverall, commenters expressed admiration for the author's resilience and ability to adapt to challenging circumstances. Many highlighted the benefits of working from home and avoiding real estate costs, which helped the business survive during the 2008 crash and the pandemic. Some also praised the author for acknowledging their privilege and good fortune in not having to close down like many other small businesses in 2020. \n\nHowever, there were also concerns raised about the long-term viability of the business and the decision to shift to a part-time 1099 contract. Some commenters suggested the need for a backup plan or diversification of income streams to ensure stability in the future. Others emphasized the importance of carefully evaluating the contract and its terms before making a decision. \n\nOverall, the commenters were supportive and understanding of the author's situation, offering valuable insights and suggestions for the future. The comment with the most upvotes highlighted the need to focus on the positive aspects of the situation, stating, \"Sometimes in life, we have to make tough changes and sacrifices to move forward. It's important to appreciate the good things that came from your business and look forward to new opportunities.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]