[
  {
    "Link": "A small UK engineering company specializing in waterproof cables faced difficulties when an overseas customer in the UAE requested a custom product. After successfully agreeing on specifications, issues arose during the onboarding process, particularly around payment terms. The customer insisted on net 60 payments, which the owner found untenable due to the upfront costs of custom work. After much negotiation, the best offer was net 30, still risky for the owner. Ultimately, the owner chose not to proceed with the order, prioritizing peace of mind over financial risk. They sought to hear from others about similar experiences with large companies.",
    "Subreddit": "",
    "Title": "The Reddit post discusses a small UK engineering company's challenges with an overseas customer requesting a custom product. While the owner successfully agreed on specifications, issues arose during the onboarding process, particularly around payment terms. The customer insisted on net 60 payments, which the owner found difficult due to upfront costs. After much negotiation, the best offer was net 30, still risky for the owner. Ultimately, the owner chose not to proceed with the order, prioritizing peace of mind over financial risk. Many commenters shared their similar experiences with large companies and the challenges they faced. Some highlighted the importance of clearly outlining payment terms and creating contracts to protect small businesses. The main concerns raised were around the power dynamic between small businesses and large companies and the lack of support for small businesses in such situations. The overall sentiment was one of frustration and empathy towards the owner. The most upvoted comment stated, \"It's unfortunate that small businesses are often put at such a disadvantage when dealing with larger companies. Clear communication and contracts are crucial in these situations.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]