[
  {
    "Link": "There is a suspicion of fake threads being posted on the smallbusiness subreddit, with the top comments always mentioning a solution called Wosily. These threads are posted by new accounts with fake post history, and the posts are promptly deleted once called out. The user suggests banning all mentions of Wosily and implementing measures to prevent fake threads on the subreddit.",
    "Subreddit": "",
    "Title": "In this Reddit post, members of the smallbusiness subreddit discuss their suspicions of fake threads being posted by new accounts promoting a solution called Wosily. The top comments all mention this solution and the posts are promptly deleted once called out. The user proposes banning all mentions of Wosily and implementing measures to prevent fake threads. \n\nThe key positive points raised by commenters include the importance of maintaining the authenticity of the subreddit and the value of open and honest discussions among small business owners. The proposed solution of banning Wosily and implementing measures to prevent fake posts is seen as a step towards ensuring the subreddit remains a reliable source of information and advice for small business owners.\n\nThe main concerns raised revolve around the potential harm to the subreddit's credibility and the impact on genuine posts and discussions. Some fear that banning Wosily or implementing strict measures may also result in innocent posts being removed or members being unfairly flagged. There is also a concern about the perpetrators behind this fake thread scam and how they may adapt to avoid detection.\n\nOverall, commenters express frustration and concern about the situation but also offer practical solutions and suggestions to address it. The top voted comment suggests banning or blocking Wosily and also encourages members to report suspicious posts and accounts. \n\nThe comment with the most upvotes is by user randomguy7777, who suggests, \"I think we should immediately ban all mentions of Wosily and actively monitor for any suspicious posts or accounts. It's important for the subreddit to maintain its authenticity and for genuine discussions to take place among small business owners.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]