[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the struggles of an entrepreneur who accumulated 8 million pesos in debt after initially achieving success with a physical store selling clothing. The pandemic forced a shift to online sales, resulting in mismanagement and failures that led to the closure of the business. Despite generating 29 million pesos in sales, attempts at affiliate marketing and an ebook were unsuccessful. The narrator expresses defeat and regret, questioning their purpose and seeking advice on transitioning to freelancing. Many commenters sympathized with the narrator's struggles and offered words of encouragement, reminding them to not give up and learn from their mistakes. Some suggested seeking professional help and evaluating financial decisions, while others recommended focusing on personal well-being before pursuing entrepreneurship again. The overall sentiment was empathetic and supportive, with the top comment receiving the most upvotes being, \"Do not give up, just rest, recover (mentally and physically) and start over.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]