[
  {
    "Link": "The owner of a custom suit shop on Etsy, with 450 sales and $54.8K revenue since launching online in October 2023, details the sudden suspension of their shop. Despite a history of handmade products and attempts to communicate with customers about overdue custom orders, Etsy suspended the shop without prior warnings. The suspension was triggered by customers opening cases due to overdue orders, leading to immediate refunds from Etsy. The owner suspects a false review from a dissatisfied customer and points out inconsistencies in Etsy's enforcement, such as other shops using stolen images remaining active. The situation has caused severe anxiety, as they have outstanding orders, employees to support, and significant materials on hand. The owner expresses frustration with Etsy's policies and urges caution for other small businesses reliant on the platform.",
    "Subreddit": "",
    "Title": "In a recent Reddit post, a custom suit shop owner on Etsy shared their experience with the sudden suspension of their shop. Despite having 450 sales and $54.8K in revenue since October 2023, the owner was surprised by their shop being suspended without prior warnings by Etsy. The post highlights the owner's attempts to communicate with customers about overdue custom orders and mentions the suspicion of a false review from a dissatisfied customer triggering the suspension. The owner also points out inconsistencies in Etsy's enforcement, such as other shops using stolen images remaining active. This sudden suspension has caused severe anxiety for the owner, as they have outstanding orders and employees to support, as well as significant materials on hand. Many commenters expressed frustration with Etsy's policies and urged caution for other small businesses reliant on the platform. The overall sentiment of the commenters was one of disappointment and concern for the owner's situation. The comment with the most upvotes was from a user who shared their own similar experience with Etsy's enforcement policies and offered support to the owner of the shop.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]