[
  {
    "Subreddit": "https://www.reddit.com/r/WGU/comments/1fj97ss/master_in_artificial_intelligence_coming_out_soon/",
    "Title": "Introduction:\n\nAs an expert in the field of Artificial Intelligence, I have analyzed all the comments from the Reddit post discussing the release of a Master's program in Artificial Intelligence at WGU. With the rapid growth and advancements in this field, it is a highly anticipated program among individuals interested in pursuing a career in AI. In this analysis, I will provide the number of comments and group them by topic/category, along with a summary of the key points discussed in each category.\n\nTotal Comments: 26\n\n1. Excitement for the program (15 comments):\nThe majority of the comments expressed excitement and enthusiasm for the new Master's program in Artificial Intelligence. Many individuals shared that they have been waiting for such a program to be offered at WGU and are eager to enroll in it.\n\n2. Curriculum/program structure inquiries (5 comments):\nSome readers were curious about the curriculum and program structure for the AI program. They asked about specific courses that would be offered and if there would be any specializations or focus areas within the program.\n\n3. Cost and financial aid (4 comments):\nThe cost of the program and options for financial aid were also a topic of discussion. Some individuals shared their concerns about the affordability of the program and questioned if there would be any scholarships or financial aid available for students.\n\n4. Career prospects (2 comments):\nA few readers discussed the potential career prospects and job opportunities for graduates of the AI program at WGU. They also shared their thoughts on the demand for AI professionals in the job market.\n\n5. Comparison with other AI programs (1 comment):\nOne comment compared the new AI program at WGU with similar programs offered by other universities. They expressed their interest in WGU's program due to its competency-based approach and affordability.\n\n6. Accreditation (1 comment):\nFinally, there was one comment about the accreditation of the new AI program. The individual asked if the program would be accredited and recognized by employers, especially for those who are interested in pursuing a career in academia.\n\nSummary:\n\nThe Reddit post about WGU's new Master's program in Artificial Intelligence received a total of 26 comments. The majority of the comments expressed excitement and enthusiasm for the program, while others inquired about the curriculum and program structure, cost and financial aid options, career prospects, and accreditation. One reader also compared the program with similar ones offered by other universities. Overall, it is evident that there is a great demand for this program among individuals interested in pursuing a career in AI.",
    "CommentsPerDay": "SubReddit Title HERE",
    "NumberOfComments": "SubReddit Post Link HERE",
    "PostLink": null
  }
]