[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the author, in their 40s, who has been able to successfully manage a side hustle that surpasses their full-time job for the past three years. Due to declining mental and physical health, they made the decision to resign from their job without divulging their side hustle. While the company offered to adjust their schedule to retain them, the author questions the feasibility of reduced hours with the same workload. Now, they are considering asking for a raise, even though it could potentially result in future layoffs. This is because they view their current job as the end of their corporate career and highly value the flexibility of remote work. Overall, the commenters were generally supportive of the author's decision to prioritize their health and pursue their successful side hustle. While some suggested negotiating for a lower workload or raise, others warned about the potential consequences of doing so and encouraged the author to carefully consider their options. The top comment with the most upvotes was, \"Your health is the most important thing. Don't let your current job hold you back from living a fulfilling life. If asking for a raise means losing your job, maybe it's time to move on to bigger and better things.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]