[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "#N/A",
    "Title": "Introduction: The Reddit post discusses a person in their 40s who has been successfully managing a side hustle for the past three years, which has been outperforming their full-time job. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. The person is now contemplating asking for a raise and is torn between the benefits of their current job and the potential for future layoffs.\n\nKey positive points: Many commenters applaud the author for their success in managing a side hustle and commend their bravery in leaving their full-time job. They highlight the importance of prioritizing mental and physical health and encourage the author to focus on their side hustle as it has already proven to be successful.\n\nMain concerns raised: Some commenters express concern over asking for a raise while knowing it might lead to layoffs in the future. They also question the feasibility of reducing work hours while maintaining the same workload. Additionally, there is a discussion about the potential risks of not disclosing the side hustle to the previous employer.\n\nOverall sentiment: The overall sentiment is empathetic towards the author's situation and supportive of their decision to prioritize their health and happiness. Many commenters share similar experiences and offer words of encouragement, while others caution against potential risks.\n\nComment with the most upvotes: \"Your mental and physical health should always come first. You have already proven your success in managing a side hustle. I would suggest focusing on that and not worrying about the potential for layoffs. Your well-being is more important than job security.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]