[
  {
    "Link": "The owner of a handmade custom suit shop on Etsy detailed their sudden suspension from the platform after achieving $54.8K in sales with around 450 orders since launching online in October 2023. Despite having a solid operation, they received multiple emails from customers opening cases due to overdue orders, primarily because many buyers failed to provide necessary measurements for custom suits. The owner highlighted that they had not received any prior warnings from Etsy and had numerous satisfied customers, although there were some negative reviews, including a false claim from a customer in Japan. The shop?s suspension has created significant financial strain, as they have outstanding orders and fabric stock, leading to anxiety and uncertainty about fulfilling commitments. The owner expressed frustration with Etsy and cautioned others about relying too heavily on a single platform for their business.",
    "Subreddit": "#N/A",
    "Title": "The discussion on the Reddit post revolves around a handmade custom suit shop on Etsy that was abruptly suspended from the platform after achieving great success. The owner, who had received $54.8K in sales and 450 orders since launching in October 2023, expressed frustration with Etsy for not warning them about the suspension and causing financial strain on their business. \n\nThe key positive points highlighted in the comments include the owner's solid operation and numerous satisfied customers, as well as their cautionary advice for others not to rely too heavily on a single platform. Commenters also empathized with the owner's situation and expressed concern for their outstanding orders and fabric stock. \n\nThe main concerns raised by commenters were the lack of communication and warning from Etsy before the suspension, as well as the issue with customers not providing necessary measurements for custom suits. Some commenters also questioned Etsy's policies and handling of the situation.\n\nThe overall sentiment of the commenters is one of sympathy and support for the owner, with many sharing their own experiences with similar issues on Etsy and offering advice and suggestions. Commenters also expressed disappointment with Etsy and urged the owner to take necessary actions to resolve the situation. \n\nThe comment with the most upvotes highlighted the need for a backup plan and not relying solely on Etsy for business, as well as suggesting the owner to seek advice from legal counsel.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]