[
  {
    "Link": "The owner of a custom suit shop on Etsy, with 450 sales and $54.8K revenue since launching online in October 2023, details the sudden suspension of their shop. Despite a history of handmade products and attempts to communicate with customers about overdue custom orders, Etsy suspended the shop without prior warnings. The suspension was triggered by customers opening cases due to overdue orders, leading to immediate refunds from Etsy. The owner suspects a false review from a dissatisfied customer and points out inconsistencies in Etsy's enforcement, such as other shops using stolen images remaining active. The situation has caused severe anxiety, as they have outstanding orders, employees to support, and significant materials on hand. The owner expresses frustration with Etsy's policies and urges caution for other small businesses reliant on the platform.",
    "Subreddit": "",
    "Title": "In October 2023, the owner of a custom suit shop on Etsy with 450 sales and $54.8K in revenue launched their online shop, but was suddenly suspended due to customers opening cases for overdue orders which Etsy promptly issued refunds for. Despite the owner's attempts to communicate with customers and a history of handmade products, the suspension came without prior warning and was apparently triggered by a false review from a dissatisfied customer. This has caused severe anxiety for the owner who has outstanding orders, employees to support, and significant materials on hand. Frustration with Etsy's policies and inconsistent enforcement, such as other shops using stolen images remaining active, has been expressed, and caution has been urged for other small businesses relying on the platform. The overall sentiment of commenters is one of sympathy for the owner and criticism towards Etsy's actions. The comment with the most upvotes states, \"Etsy needs to better support and protect its small businesses instead of jumping to refunds and suspensions.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]