[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "This Reddit post shares the story of a 40-year-old individual who has been successfully managing a side hustle for the past three years, surpassing their full-time job. However, due to declining physical and mental health, the author resigned from their job without disclosing their side hustle. The company offered to adjust their schedule to retain them, but the author doubts the feasibility of reduced hours with the same workload. As they see their current job as the end of their corporate career and value its remote work flexibility, they are now contemplating asking for a raise, even though it might lead to future layoffs. The main positive points raised by commenters include the author's success with their side hustle and the potential for a raise, while the main concerns revolve around the feasibility of reduced hours, the risk of future layoffs, and the impact on the author's mental and physical health. The overall sentiment of the commenters is sympathetic and supportive, with many recognizing the author's difficult situation and offering words of advice and encouragement. The top upvoted comment is, \"You should prioritize your health above everything else. Don't let a job stress you to a point where you can't enjoy your life.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]