[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "The author, in their 40s, has been successfully managing a side hustle that exceeds their full-time job for the past three years. However, due to declining mental and physical health, they resigned from their job without disclosing their side hustle. While the company offered to adjust their schedule, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it could result in future layoffs, as they value the remote work flexibility their current job provides. \n\nThe discussion highlighted the admirable success of the author's side hustle and the courage it took to resign from their job. Many commenters commended the author for prioritizing their health and seeking a better work-life balance. Others shared similar experiences and offered helpful advice, such as negotiating for a higher raise or exploring other job opportunities. \n\nHowever, there were also concerns raised about potential retaliation from the company if the author were to ask for a raise. Some shared stories of being penalized for asking for a raise and warned the author to tread carefully. Additionally, there were discussions about the challenges of maintaining a demanding side hustle and a full-time job, suggesting that it may not be sustainable in the long term. \n\nOverall, the sentiment of the commenters was overwhelmingly supportive and empathetic towards the author. Many expressed admiration for the author's hustle and encouraged them to prioritize their health and happiness over corporate success. The comment with the most upvotes was from a commenter who urged the author to move on from their current job and focus on their side hustle, as it proved to be more fulfilling and profitable for them.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]