[
  {
    "Link": " The author recounts their journey of building and selling their first business, Rustplus, a platform for trading in-game skins for \"Rust,\" starting with a $20 investment in 2017. Over two years, they grew the inventory from $500 to $6,000, attracted over 40,000 users, and processed $250,000 in trades. They experimented with influencer ads, Google AdWords, and hired developers for site improvements, earning around $17,000 in revenue. However, declining profits, increased competition, and the need to focus on school led to selling 90% of the business for $2,200. Despite challenges, the author highlights the valuable entrepreneurial experience, problem-solving skills, and earnings, concluding with optimism for future ventures.",
    "Subreddit": "",
    "Title": "In the Reddit post, the author shares their experience of building and selling their first business, Rustplus, a platform for trading in-game skins for \"Rust.\" With a $20 investment, they were able to grow the inventory from $500 to $6,000 and attract over 40,000 users, processing $250,000 in trades. They also experimented with various marketing strategies and hired developers, earning $17,000 in revenue. However, declining profits, increased competition, and the need to focus on school led to selling 90% of the business for $2,200. Despite this, the author emphasizes the valuable entrepreneurial experience, problem-solving skills, and earnings, concluding with optimism for future ventures. While commenters praised the author for their success and determination, they also raised concerns about the challenges of running a business and the need for a balanced workload. The overall sentiment of the commenters is supportive and encouraging, with one commenter stating, \"Great job for making it this far with just a $20 investment, that's truly incredible.\" This comment received the most upvotes, highlighting the community's admiration for the author's achievements.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]