[
  {
    "Link": "The author shares their frustrations working for a family-owned organic grocer that expanded its product line after a sudden surge in popularity around 2018. Hired as a social media manager after being let go from a previous job, the author has faced challenges in getting their posts approved, as the owners see social media as merely a casual tool rather than a marketing strategy. Despite having made only one notable wholesale sale, the owners mistakenly attribute low sales to the author's social media efforts, disregarding its potential as a supplement to business growth. The author seeks advice on how to navigate management issues and effectively communicate the benefits of social media to the owners.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post discusses the frustrations of working for a family-owned organic grocer that experienced a sudden surge in popularity in 2018. The author, who was hired as a social media manager after being let go from a previous job, has faced challenges in getting their posts approved by the owners who do not see social media as a serious marketing tool. Despite their efforts, the owners attribute low sales to the author's social media efforts and fail to recognize its potential for business growth. Many commenters empathize with the author's situation and offer advice on how to navigate management issues and highlight the benefits of social media. Some positive points mentioned include the importance of using social media for brand awareness and building customer relationships, as well as the potential for increased sales and customer engagement. However, concerns are raised about the lack of understanding and support from the owners and the need for effective communication and education. The overall sentiment of the commenters is one of support and encouragement for the author to continue advocating for social media. The comment with the most upvotes states, \"Great job advocating for social media as a valuable tool for your business. Keep pushing and eventually the owners will see the results.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]