[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "In a Reddit post, an author in their 40s shared their experience of successfully managing a side hustle that outperforms their full-time job for the past three years. However, due to declining mental and physical health, they resigned from their job without disclosing their side hustle. The company offered to adjust their schedule, but the author doubts the feasibility of reduced hours with the same workload. They are now considering asking for a raise, despite the possibility of future layoffs, as they see this job as their final corporate career and value the remote work flexibility. The discussion in the comments section largely focused on the positive aspects of the author's successful side hustle and the potential for a raise due to their skills and dedication. However, concerns were raised about the author's mental and physical health and the risks involved in asking for a raise and possible layoffs. Overall, the sentiment among commenters was supportive and encouraging, with many expressing admiration for the author's hard work and determination. The top voted comment stated, \"If you're making more with your side hustle, it's definitely worth considering negotiating for a raise or finding another job with better compensation.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]