[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "The Reddit post discusses a 40-year-old who has been successfully managing a side hustle that outperforms their full-time job for the last three years. Due to declining mental and physical health, the author resigned from their job without disclosing their side hustle. Despite the offer of adjusting their schedule to retain them, the author has doubts about the feasibility of reducing their hours while maintaining the same workload. They are now considering asking for a raise, even though it may mean being designated for future layoffs. The author values the remote work flexibility their current job provides as they see it as the end of their corporate career. The comments primarily focus on the positive aspects of the author's successful side hustle and their decision to prioritize their physical and mental health. Concerns were raised about the feasibility of reducing work hours and the potential consequences of asking for a raise. The overall sentiment of the commenters is supportive and empathetic towards the author's struggles and decisions. The comment with the most upvotes reads, \"Congrats on taking control of your health and prioritizing your side hustle. You deserve to ask for a raise and make the best choice for your future.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]