[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the situation of an individual in their 40s who has had a successful side hustle for the past three years, outperforming their full-time job. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. The company offered to adjust their schedule to retain them, but the author is unsure if this would be feasible while maintaining the same workload. They are now considering asking for a raise, even though it may put them at risk for future layoffs, as they see this job as the end of their corporate career and value the remote work flexibility. \n\nThe key positive points raised by commenters include the author's successful management of their side hustle and their recognition of their own mental and physical health. Many also applaud their decision to prioritize their well-being and acknowledge the potential challenges of reduced hours with the same workload. \n\nThe main concerns raised are the potential negative consequences of asking for a raise, such as being designated for future layoffs and losing the remote work flexibility. Some commenters also express skepticism about the feasibility of reduced hours and suggest seeking a new job instead. \n\nOverall, the sentiment of the commenters is sympathetic and supportive of the author taking care of their mental and physical health. Many also applaud their previous success with their side hustle and offer words of encouragement. \n\nThe highest upvoted comment comes from user stuckinthemiddleman, who advises the author to consider seeking a new job with more flexible hours or starting their own business, rather than asking for a raise in their current job.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]