[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "In a recent Reddit post, a person in their 40s shared their experience of managing a successful side hustle that has outperformed their full-time job for the past three years. Due to declining mental and physical health, they decided to resign from their job without disclosing their side hustle. The company offered to adjust their schedule to retain them, but the author is unsure if reduced hours would be manageable with the same workload. They are now considering asking for a raise, despite the potential for future layoffs, as they view their current job as the end of their corporate career and value the remote work flexibility it provides. Commenters expressed admiration for the author's successful side hustle and the fact that they were able to prioritize their health and well-being. However, many raised concerns about the potential consequences of asking for a raise, including damaging their relationship with the company and jeopardizing their employment. The overall sentiment was one of support and understanding for the author's difficult decision. The most upvoted comment stated, \"It's admirable that you've been able to successfully run a side hustle and prioritize your health. It's also understandable that you value the remote work flexibility. Just be careful about asking for a raise, as it may come with consequences.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]