[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "#N/A",
    "Title": "This Reddit post discusses the struggles of an entrepreneur who has accumulated 8 million pesos ($141,000) in debt due to multiple failed business ventures. The individual initially found success with a physical store but faced challenges when the COVID-19 pandemic forced a shift to online sales. Despite generating 29 million pesos ($512,000) in sales, mismanagement and further failures led to the closure of the business. Additional attempts at affiliate marketing and launching an ebook also failed, resulting in feelings of defeat, regret, and concern for their family's financial burden. The narrator questions the idea of letting go of their dreams and considering freelancing as a more stable path. Commenters offer support and advice, highlighting the individual's resilience and determination to learn from their mistakes. Concerns are raised over the individual's mindset and decision-making in regards to managing their business and finances. The overall sentiment is one of empathy and encouragement, with commenters sharing their own failures and offering words of comfort and motivation. The comment with the most upvotes states, \"I know it may seem impossible now, but you have already accomplished so much by starting your own business. Don't give up on your dreams, but take a step back and reassess your strategy.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]