[
  {
    "Link": "The author, a budding designer since high school, shares a pivotal experience that shattered their confidence when a major client underpaid for a significant branding project due to personal reasons. Despite having dedicated immense effort to the project, the disappointing outcome led them to pause their design work and focus on college. As they near graduation, they struggle with low self-esteem, charging low rates out of fear of rejection, and facing persistent doubts about their value. They seek advice from others who have faced similar challenges, expressing a desire to overcome these issues and rebuild their confidence.",
    "Subreddit": "",
    "Title": "The Reddit post is a personal reflection of a designer's pivotal experience that shattered their confidence when a major client underpaid for a significant branding project. The discussion is filled with supportive comments from designers who have faced similar challenges and offer advice on how to overcome low self-esteem, charging low rates, and persistent doubts about their value.\n\nKey positive points from the comments include:\n- The importance of recognizing one's own worth and not letting others undermine it\n- The need to set boundaries and not settle for less than what the work is worth\n- The value of experiences, even negative ones, in building resilience and growth as a designer\n- The power of seeking help and support from others in the industry\n\nMain concerns raised revolve around the struggles of facing rejection and low self-esteem in the creative industry. Many commenters empathize with the author's experience and share their own struggles with imposter syndrome and fear of not being good enough. Some also point out the harsh realities of the design industry, where clients may not always value a designer's work as much as they should.\n\nThe overall sentiment of the commenters is one of understanding, support, and encouragement. Many offer their own stories and advice on how to overcome similar challenges and rebuild confidence as a designer. The top comment, with the most upvotes, highlights the importance of valuing oneself and not selling oneself short for the sake of pleasing others.\n\nTop comment: \"Remember that you have the power to set your own value and worth, and don't let others undermine it. Stay true to yourself and your work, and the right clients will come. Don't settle for less than what you deserve.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]