[
  {
    "Link": "The author is discussing Walter Deibel's book \"Buy then Build,\" which introduces the concept of acquisition entrepreneurship. Deibel presents a hypothetical example where an entrepreneur buys a $1M business, investing $100K and financing the rest with a 90% SBA loan. The entrepreneur projects a 10% annual revenue growth, culminating in a sale price of $3-4M in ten years. The author poses questions about the realism of consistent 10% growth and identifies potential small business niches that could achieve this growth trajectory.",
    "Subreddit": "#N/A",
    "Title": "Introduction:\n\nIn this Reddit post, the author discusses Walter Deibel's book \"Buy then Build,\" which introduces the concept of acquisition entrepreneurship. Deibel presents a hypothetical example where an entrepreneur buys a $1M business and projects a 10% annual revenue growth, culminating in a profitable sale in ten years. The author questions the feasibility of consistent 10% growth and asks for potential small business niches that could achieve this.\n\nPositive points:\nMany commenters were interested in Deibel's book and the concept of acquisition entrepreneurship. They appreciated Deibel's realistic approach and his emphasis on financing, rather than solely relying on personal funds. Some also found the hypothetical example to be a good starting point for understanding the concept.\n\nMain concerns:\nThe main concern raised by commenters was the feasibility of sustained 10% growth. Some were skeptical of the projection and pointed out the unpredictable nature of businesses. Others suggested diversifying the portfolio to mitigate risk and increase chances of success. Additionally, some commenters expressed concern about the potential lack of control over the acquired business and its ability to maintain the projected growth.\n\nOverall sentiment:\nThe majority of commenters were intrigued by the concept of acquisition entrepreneurship but raised valid concerns about its feasibility and success rate. Some shared their own experiences with buying and growing businesses, while others debated the pros and cons of this approach. Some were cautiously optimistic, while others were more skeptical. The conversation remained respectful and insightful, with many acknowledging that there are no guarantees in the world of entrepreneurship.\n\nMost upvoted comment:\nThe most upvoted comment came from a user who mentioned being an experienced entrepreneur and shared their personal success story of acquiring and growing businesses in niches that could potentially achieve the projected 10% growth. They also advised against solely relying on projections and emphasized the importance of being flexible and adapting to market changes.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]