[
  {
    "Link": "The author shares their journey of starting and selling their first business while being a full-time college student, beginning with trading Steam skins in Spring 2017. They developed a site for trading Rust skins, growing from an initial $500 inventory to $6,000 within months through influencer marketing and development improvements. Despite facing downturns in profit and challenges with an investor, the author learned valuable lessons in business and marketing. They eventually sold 90% of the site for $2,200 in Spring 2018, having generated over $12,000 in profits and building a user base of 40,000. The experience ignited their interest in entrepreneurship, as they reflected on their learning and personal growth throughout the process.",
    "Subreddit": "",
    "Title": "This Reddit post follows the author's journey of starting and selling their first business while being a full-time college student, beginning with trading Steam skins in Spring 2017. The author shares how they developed a site for trading Rust skins and grew their initial $500 inventory to $6,000 through influencer marketing and development improvements. Despite facing challenges with an investor and downturns in profit, the author learned valuable lessons in business and marketing. They eventually sold 90% of the site for $2,200 in Spring 2018, having generated over $12,000 in profits and building a user base of 40,000. The experience sparked their interest in entrepreneurship and led to personal growth. The commenters applauded the author's determination and entrepreneurial spirit, with many sharing their own similar stories of starting a business while in college. Some raised concerns about the risks involved and advised cautiousness in investing. The overall sentiment was positive, with the top comment praising the author for their success and offering words of encouragement for their future endeavors. The top comment, with 52 upvotes, reads, \"That's impressive. Starting and selling a business while in college takes a lot of hard work and dedication. Congrats on the success and best of luck in your future ventures!\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]