[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post shares the struggles of a narrator who is in debt of 8 million pesos due to their failed attempts at entrepreneurship. Despite initially finding success with a physical store, the shift to online sales during COVID-19 led to massive loans and mismanagement, resulting in the closure of the business. The narrator also faced failures in affiliate marketing and ebook launching, causing them to question their purpose and ambitions. Many commenters empathize with the narrator, praising them for their determination and resilience in the face of adversity. They also offer practical advice such as seeking help from financial experts and considering freelancing as a stable path forward. The main concerns raised include the consequences of financial risks and the impact on family and loved ones. The overall sentiment of the commenters is one of understanding and support, with many sharing personal experiences and encouraging the narrator to keep moving forward. The most popular comment, with 14 upvotes, expresses the importance of asking for help and not giving up: \"Don't be afraid to ask for help and learn from your mistakes. You have the strength to pick yourself up and succeed in whatever you do.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]