[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "#N/A",
    "Title": "This Reddit post shares the struggles of an entrepreneur who accumulated 8 million pesos ($141,000) in debt over the past few years. Their initial success with a physical store selling clothing was overshadowed by the COVID-19 pandemic, leading to failed attempts at transitioning to online sales and expanding with loans. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. The narrator expresses feelings of defeat, regret, and concern for their family's burden, questioning their ambitions and purpose. Commenters offered words of encouragement, highlighting the narrator's resilience and determination to find a stable path forward through freelancing. Key concerns raised included financial mismanagement, pivoting strategies, and mental health. The overall sentiment was one of empathy and support, with commenters sharing their own experiences and advice for the narrator. The comment with the most upvotes reads, \"While it's a tough decision, letting go of your dreams doesn't mean giving up on them. It takes courage to pivot and find a new path towards success.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]