[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post describes the struggles of an entrepreneur who has accumulated 8 million pesos in debt over the past few years. Despite initial success with a physical store, the shift to online sales during the pandemic led to mismanagement and the eventual closure of the business. The narrator expresses feelings of defeat and regret, and seeks advice on whether to let go of their dreams and pursue freelance work instead. Commenters empathize with the narrator's situation and offer words of encouragement, emphasizing the importance of learning from failure and not being too hard on oneself. They also suggest seeking guidance from mentors and considering alternative paths towards financial stability. Concerns are raised about the narrator's well-being and the impact on their family but overall, the tone of the comments is supportive and understanding. The comment with the most upvotes reinforces the idea of not giving up and believing in one's abilities, with the user saying, \"Keep going, one day you'll look back on this and be grateful for the lessons learned.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]