[
  {
    "Link": "The author has spent 13 years freelancing as a design engineer, often feeling undervalued and struggling financially, with their health deteriorating over time. They transitioned to starting their own business but have yet to generate income, mainly focusing on securing Small Business Innovation Research (SBIR) funding, which is highly competitive. Despite the challenges, they see potential for significant income if successful. Currently facing financial strain, including late bills and rent, they have been offered a full-time job that may distract from their business efforts, but they feel it necessary for immediate income. They express frustration over their situation, the cyclical nature of their struggles, and the difficulty in finding quality freelance work outside of Craigslist, ultimately seeking advice and support.",
    "Subreddit": "",
    "Title": "The author of the post has been freelancing as a design engineer for 13 years and has faced financial struggles, health issues, and difficulty finding quality work. They have now transitioned to starting their own business, focused on securing SBIR funding, but have yet to generate income. They are currently facing financial strain and have been offered a full-time job which may distract from their business efforts. The discussion on this post is mainly focused on offering advice and support to the author. Some positive points mentioned include the potential for significant income if successful and the courage it takes to start a business. However, there are also concerns raised about the competitiveness of SBIR funding and the potential for burnout with the added stress of a full-time job. The overall sentiment of the commenters is empathetic towards the author's struggles and offers support and encouragement. The top upvoted comment mentions the importance of self-care and taking care of one's health in the midst of financial struggles.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]