[
  {
    "Link": "The author has spent 13 years freelancing as a design engineer, often feeling undervalued and struggling financially, with their health deteriorating over time. They transitioned to starting their own business but have yet to generate income, mainly focusing on securing Small Business Innovation Research (SBIR) funding, which is highly competitive. Despite the challenges, they see potential for significant income if successful. Currently facing financial strain, including late bills and rent, they have been offered a full-time job that may distract from their business efforts, but they feel it necessary for immediate income. They express frustration over their situation, the cyclical nature of their struggles, and the difficulty in finding quality freelance work outside of Craigslist, ultimately seeking advice and support.",
    "Subreddit": "",
    "Title": "In this Reddit post, the author shares their 13-year journey as a design engineer, highlighting the struggles they've faced in terms of feeling undervalued, financial strain, and declining health. While they have transitioned to starting their own business, they have yet to generate income as they focus on securing highly competitive SBIR funding. The author expresses frustration over their cyclical struggles and the difficulty in finding quality freelance work outside of Craigslist. They have been offered a full-time job for immediate income, but it may distract from their business efforts. Commenters offer supportive advice and highlight the potential for significant income if the author is successful in securing SBIR funding. Some also raise concerns about the author's health and wellbeing and suggest seeking guidance from a financial advisor. The overall sentiment of the commenters is empathetic and encouraging, with many sharing their own experiences and offering words of support. The top voted comment reads, \"As someone who has been there, I understand the frustration. Keep pushing and believe in yourself. It may not be easy, but know that you have the ability to succeed.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]