[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "In this Reddit post, the author, in their 40s, shares their successful experience managing a side hustle that outperforms their full-time job for the past three years. However, due to declining mental and physical health, they resigned from their job without disclosing their side hustle. The company offered to adjust their schedule to retain them, but the author doubts the feasibility of reduced hours while maintaining the same workload. They are now considering asking for a raise, despite possible future layoffs, as they value the remote work flexibility in their current job, which they see as the end of their corporate career.\n\nThe discussion highlights the positive aspects of the author's successful side hustle and the flexibility of their remote work. Many comments also applaud the author for prioritizing their mental and physical health. However, there are concerns about the feasibility of reduced hours and asking for a raise while facing potential layoffs. Some commenters suggest exploring other work options, such as freelancing or starting a business. The overall sentiment is supportive of the author's decision and appreciation for their transparency and vulnerability in sharing their story.\n\nThe top upvoted comment states, \"It's time for you to take a leap of faith and focus on your side hustle. It's already outperforming your full-time job, and you have the potential to grow it even more.\" This comment encourages the author to prioritize their side hustle and take a risk in pursuing it as their main source of income.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]