[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post reflects the struggles of an entrepreneur facing 8 million pesos ($141,000) in debt after failed attempts at expanding their clothing store during the COVID-19 pandemic. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. The post garnered a lot of attention, with commenters offering advice and support. Some positive points mentioned include the importance of learning from past failures and using them as motivation to succeed in the future. However, there were also concerns raised about the financial risks and uncertainties of entrepreneurship, and the potential toll it can take on personal and family life. The overall sentiment among the commenters was sympathy and understanding, with many sharing similar experiences and offering words of encouragement. The comment with the most upvotes advised the narrator to take a break and focus on freelancing as a more stable path forward.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]