[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "The Reddit post discusses a 40-year-old individual who has successfully managed a side hustle that outperforms their full-time job for the past three years. They recently resigned from their job due to declining mental and physical health, without disclosing their side hustle. The company offered to adjust their schedule to retain them, but the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, knowing it could designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides. \nMany commenters praise the author for being successful in their side hustle and acknowledge the challenges they faced while managing both their full-time job and side hustle. The discussion highlights the importance of mental and physical health and the need to prioritize it over work. Some suggest the author should have disclosed their side hustle to their employer, while others argue that it is their personal choice. They are urged to consider negotiating a flexible schedule or seeking a higher position rather than asking for a raise. The comment with the most upvotes advises the author to prioritize their well-being and not let fear hold them back from demanding a raise. Overall, the commenters express understanding and sympathy towards the author's situation and encourage them to make the best decision for themselves.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]