[
  {
    "Link": "The author has spent 13 years freelancing as a design engineer, generating approximately $464,616 before taxes, but struggling financially and feeling undervalued. Their health has declined, and social connections have diminished. In recent years, they started an LLC focusing on Small Business Innovation Research (SBIR) funding but have yet to generate income. While pursuing the competitive funding opportunities, they face immediate financial distress, including overdue bills and rent. They were recently offered a full-time job by a former co-worker, which they feel compelled to accept despite concerns about it detracting from their entrepreneurial goals. The author expresses frustration with their situation, feeling stuck in a cycle of holding on and hopes for future success while contemplating freelance options to enhance their income.",
    "Subreddit": "#N/A",
    "Title": "The original poster has been freelancing as a design engineer for 13 years and has generated over $464,616 but is struggling financially and feeling undervalued. They have started an LLC focusing on SBIR funding but have not yet generated income, causing immediate financial distress. A former co-worker has offered them a full-time job which they feel obligated to accept, despite concerns about it affecting their entrepreneurial goals. Commenters expressed empathy for the OP's situation and offered advice on alternative sources of income, such as finding a mentor or taking on smaller projects. Concerns were raised about the potential burnout and loss of passion that may come with taking on a full-time job, and the importance of self-care was emphasized. Overall, the sentiment of commenters was understanding and supportive, recognizing the struggles of entrepreneurship and offering words of encouragement. The most upvoted comment urged the OP to take a step back and reassess their priorities, reminding them that their mental and physical health should always come first.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]