[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post shares the struggles of the narrator, who accumulated 8 million pesos ($141,000) in debt due to unsuccessful entrepreneurship endeavors. While initially successful with a physical store selling clothing, the shift to online sales during the pandemic led to mismanagement and failure, despite generating 29 million pesos ($512,000) in sales. The narrator's attempts at affiliate marketing and launching an ebook also failed, leading to feelings of defeat and regret, and concern for their family's financial burden. Many commenters offered advice and support, with some suggesting the narrator seek professional help and others advocating for the importance of failure and perseverance in entrepreneurship. The most upvoted comment acknowledged the difficult choices the narrator is facing and encouraged them to consider potential opportunities and their own well-being in deciding their next steps. Overall, the sentiment from the commenters was empathetic and understanding, recognizing the struggles of entrepreneurship and offering hope for the future.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]