[
  {
    "Link": "The owner of a custom suit shop on Etsy, with over $54K in sales since launching online in October 2023, faced suspension due to numerous case requests initiated by buyers after the shop was frozen. The owner attributes the issues to 20-25 overdue orders, mainly from customers who failed to provide necessary custom measurements. Despite offering consultations and maintaining good customer feedback, the shop's suspension followed a dispute involving a false review by a customer. The owner expressed distress over the inability to fulfill active orders, the financial impact on their team, and concerns over Etsy?s lack of communication regarding the suspension reasons. They emphasized the importance of diversifying business platforms and expressed frustration with Etsy's automated responses to their appeals.",
    "Subreddit": "#N/A",
    "Title": "This Reddit post discusses the suspension of a custom suit shop on Etsy, which had garnered over $54K in sales since its launch in October 2023. The owner shares that the suspension was due to numerous case requests, primarily from customers who did not provide custom measurements. Despite offering consultations and receiving good customer feedback, a dispute involving a false review by a customer led to the suspension. The owner expresses distress over the inability to fulfill active orders, financial impact on their team, and frustration with Etsy's lack of communication regarding the reasons for the suspension. The main concerns raised by commenters revolve around the effects of the suspension on the owner's business and the lack of support from Etsy. The overall sentiment of the commenters leans towards empathy for the owner's situation and criticism towards Etsy's handling of the situation. The top voted comment suggests that the owner should consider branching out to other platforms for their business to avoid relying solely on Etsy.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]