[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "#N/A",
    "Title": "The post discusses a situation where the author has a successful side hustle that outperforms their full-time job, but due to declining mental and physical health, they resign from their job without disclosing their side hustle. The company offers to adjust their schedule to retain them, but the author does not believe this is feasible. They are now considering asking for a raise, even though it may designate them for future layoffs, as they value the remote work flexibility of their current job as the end of their corporate career. \n\nThe main positive points mentioned by commenters include the author's success with their side hustle and their ability to balance it while working full-time. Many also express admiration for the author's decision to leave their job due to mental and physical health concerns. \n\nThe main concerns raised include the feasibility of reduced hours while maintaining the same workload and the potential consequences of asking for a raise. Some commenters suggest looking into alternative options, such as working part-time or finding a new job that accommodates their needs. There is also discussion about the value of remote work and the impact of layoffs on the author's future career prospects.\n\nOverall, the sentiment of the commenters is one of support for the author and their decision to prioritize their health and their side hustle. There is a recognition of the challenges they may face in the future, but also suggestions for finding a solution that works for them. \n\nThe comment with the most upvotes states, \"Your health and well-being should always come first. It sounds like you have a solid plan and it's inspiring to see someone taking control of their career and happiness. Good luck!\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]