[
  {
    "Link": "The author has maintained a side hustle that outperforms their 9-5 job for three years but has decided to resign due to health concerns from the demanding dual workload. Despite receiving offers for a reduced schedule to stay, they believe the workload would remain unchanged. They are now contemplating negotiating for a raise before leaving, knowing it could make them vulnerable to future layoffs. Ultimately, they prioritize their health and remote work flexibility over corporate advancement.",
    "Subreddit": "#N/A",
    "Title": "Introduction:\nThe Reddit post discusses the author's decision to resign from their 9-5 job due to health concerns caused by maintaining a successful side hustle for three years. They have been offered a reduced schedule to stay, but believe the workload would remain unchanged. The author is considering negotiating for a raise before leaving, despite potential vulnerability to future layoffs. They prioritize their health and remote work flexibility over corporate advancement.\n\nKey Positive Points:\nMany commenters applaud the author for prioritizing their health and making the difficult decision to resign from their job. They also admire the author's success with their side hustle. Some suggest using their side hustle as their main source of income, while others suggest taking a break to focus on their health.\n\nMain Concerns:\nThe main concern raised by commenters is the potential vulnerability of negotiating for a raise before resigning. Some warn that it may lead to negative consequences in future job opportunities. Others express concern for the author's well-being and urge them to prioritize their health over financial gains.\n\nOverall Sentiment:\nThe overall sentiment of the commenters is supportive and empathetic towards the author's situation. Many share their own experiences and offer words of encouragement. Some suggest alternative options to consider before resigning, while others believe the author's priorities are in the right place.\n\nComment with Most Upvotes:\nThe comment with the most upvotes suggests that the author's well-being should always come first, and that they should not feel guilty for prioritizing their health and work-life balance. The commenter advises the author to take care of themselves and not let work consume them.\n\nIn conclusion, the discussion on the Reddit post centers around the author's difficult decision to resign from their 9-5 job due to health concerns caused by a successful side hustle. While many admire the author's achievements and prioritize their health, the potential vulnerability of negotiating for a raise before leaving is a concern for some. The overall sentiment is one of support and understanding, with the reminder to prioritize personal well-being over corporate advancement.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]