[
  {
    "Link": "The author has spent 13 years freelancing as a design engineer, often feeling undervalued and struggling financially, with their health deteriorating over time. They transitioned to starting their own business but have yet to generate income, mainly focusing on securing Small Business Innovation Research (SBIR) funding, which is highly competitive. Despite the challenges, they see potential for significant income if successful. Currently facing financial strain, including late bills and rent, they have been offered a full-time job that may distract from their business efforts, but they feel it necessary for immediate income. They express frustration over their situation, the cyclical nature of their struggles, and the difficulty in finding quality freelance work outside of Craigslist, ultimately seeking advice and support.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the struggles of a freelance design engineer, who has been undervalued and financially strained for the past 13 years, leading to deteriorating health. The author has started their own business but has yet to generate income, focusing on securing competitive SBIR funding. However, with mounting financial strain and an offer for a full-time job, they express frustration over their cyclical struggles and difficulty in finding quality freelance work. Despite the challenges, the potential for significant income if successful is seen. The commenters offer various advice, with many acknowledging the author's determination and potential for success. The main concerns raised include the author's health and the impact of taking a full-time job on their business efforts. The overall sentiment is one of empathy and support, with many offering helpful suggestions and encouraging the author to stay resilient. The top comment, with the most upvotes, states, \"Hang in there. It's tough in the short run but worth it in the long run.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]