[
  {
    "Link": "The owner of a custom suit shop on Etsy, with 450 sales and $54.8K revenue since launching online in October 2023, details the sudden suspension of their shop. Despite a history of handmade products and attempts to communicate with customers about overdue custom orders, Etsy suspended the shop without prior warnings. The suspension was triggered by customers opening cases due to overdue orders, leading to immediate refunds from Etsy. The owner suspects a false review from a dissatisfied customer and points out inconsistencies in Etsy's enforcement, such as other shops using stolen images remaining active. The situation has caused severe anxiety, as they have outstanding orders, employees to support, and significant materials on hand. The owner expresses frustration with Etsy's policies and urges caution for other small businesses reliant on the platform.",
    "Subreddit": "",
    "Title": "The Reddit post tells the story of a small business owner who runs a custom suit shop on Etsy and has faced sudden suspension of their shop without any prior warning. Despite a history of handmade products and efforts to communicate with customers about late custom orders, Etsy took action when customers opened cases for the overdue orders, resulting in immediate refunds. The owner suspects a false review from a dissatisfied customer and calls out the inconsistencies in Etsy's enforcement, where other shops using stolen images are still active. This situation has caused severe anxiety for the owner as they have outstanding orders, employees to support, and significant materials on hand. The overall sentiment of the commenters is one of frustration and disappointment with Etsy's policies, with many cautioning other small businesses to be careful when relying on the platform. The comment with the most upvotes reads, \"Etsy claims to support and promote small businesses, but their actions show a lack of understanding and empathy towards their sellers. It's unfair and unjust.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]