[
  {
    "Link": "A customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After realizing the item wasn't suitable, they returned it, paying $14 for shipping. However, USPS marked the package as \"unclaimed\" after three delivery attempts, and it was returned to the sender. The customer contacted the business for a refund, but the business refused to pay for the return shipping and insisted on receiving the item to process the refund, resulting in the customer facing an additional $14 cost. The customer is frustrated and considering a chargeback, feeling the business is not honoring its return policy fairly.",
    "Subreddit": "",
    "Title": "In this Reddit post, a customer shared their experience with a small business that had a \"30-day return\" and \"100% satisfaction guarantee\" policy. The customer ordered a $50 item, but after realizing it wasn't suitable, they returned it for a $14 shipping fee. However, USPS marked the package as \"unclaimed\" and returned it to the sender after three delivery attempts. When the customer contacted the business for a refund, they were told to return the item at their own expense before a refund could be processed, resulting in an additional $14 cost to the customer. The main concerns raised by commenters were the inconsistency and lack of transparency in the business's return policy, and the frustration and inconvenience faced by the customer. Many felt that the business should have covered the return shipping cost, as stated in their return policy, and honored their guarantee without making the customer incur additional expenses. The overall sentiment of the commenters was one of disappointment and dissatisfaction with the business's handling of the situation. The most upvoted comment stated, \"A return policy is only as good as the company's willingness to follow through with it. In this case, the customer is being unfairly burdened with the cost and inconvenience of returning the item, despite the business's stated policies.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]