[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "This Reddit post centers around a 40-year-old individual who has been successfully managing a side hustle for the past three years, which has outperformed their full-time job. However, due to declining mental and physical health, they decided to resign from their job without disclosing their side hustle. The company offered to adjust their schedule to retain them, but the author doubts the feasibility of reduced hours with the same workload. They are now considering asking for a raise, despite the possibility of future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides. \n\nThe major positive points discussed by commenters include the individual's success in managing their side hustle and the flexibility that their job provides. Some also appreciate the author's honesty and decision to prioritize their health. \n\nThe main concerns raised revolve around the potential consequences of revealing their side hustle and asking for a raise, such as being designated for future layoffs or jeopardizing the remote work arrangement they value. There are also discussions about the practicality of reduced hours and workload adjustments. \n\nOverall, the sentiment of the commenters is mostly understanding and supportive of the author's situation. Many share their own experiences and suggest alternative options such as finding a new job or using the side hustle as a primary source of income. A highly upvoted comment advises the author to prioritize their health and not make decisions based on fear of potential future layoffs.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]