[
  {
    "Link": "The post provides an update on the accomplishments and opportunities of a general contractor over the past year. Major accomplishments include finishing a spec house during Covid and landing a high-profit margin job. Opportunities include partnerships for flips and new construction. Learning experiences include the importance of subcontractors carrying their own insurance and outsourcing debris removal. The work week involves checking job progress, meeting with clients, sending bids, and ordering materials. The contractor is open to advice and feedback.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post discusses the accomplishments and opportunities of a general contractor over the past year. The post highlights major successes such as completing a spec house during Covid and landing a high-profit margin job. The contractor also mentions opportunities for partnerships in flips and new construction. Some of the key learning experiences noted include the importance of subcontractors having their own insurance and outsourcing debris removal. A typical work week for the contractor includes tasks such as checking job progress, meeting with clients, sending bids, and ordering materials. The post ends by inviting advice and feedback from the community. \n\nCommenters were generally positive about the contractor's accomplishments and expressed admiration for their success during the challenging time of Covid. Many also praised their strong work ethic and dedication to providing high-quality work. Concerns raised included the potential risks and challenges of partnering for flips and new constructions, as well as the importance of carefully selecting trustworthy subcontractors. Overall, the sentiment was encouraging and supportive, with commenters offering helpful insights and suggestions for improvement. The comment with the most upvotes was one that commended the contractor's determination and hard work, saying \"Kudos to you for navigating through such a tough year and coming out on top!\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]