[
  {
    "Link": "The author has spent 13 years freelancing as a design engineer, often feeling undervalued and struggling financially, with their health deteriorating over time. They transitioned to starting their own business but have yet to generate income, mainly focusing on securing Small Business Innovation Research (SBIR) funding, which is highly competitive. Despite the challenges, they see potential for significant income if successful. Currently facing financial strain, including late bills and rent, they have been offered a full-time job that may distract from their business efforts, but they feel it necessary for immediate income. They express frustration over their situation, the cyclical nature of their struggles, and the difficulty in finding quality freelance work outside of Craigslist, ultimately seeking advice and support.",
    "Subreddit": "",
    "Title": "The Reddit post follows the journey of an author who has struggled financially and with their health as a freelance design engineer for 13 years. They have now transitioned to starting their own business, focussing on securing competitive Small Business Innovation Research (SBIR) funding, with the hope of significant income. However, they are facing financial strain, including late bills and rent, and are considering taking a full-time job for immediate income. The author expresses frustration with their cyclical struggles and difficulty finding quality freelance work outside of Craigslist, seeking advice and support. \n\nThe key positive points raised by commenters include support for the author's determination to succeed and encouragement to continue pursuing their dreams. Many also offer practical advice and resources for finding freelance work, as well as recommending grants and other funding options. \n\nThe main concerns raised by commenters are the author's current financial situation, the competitive nature of obtaining SBIR funding, and the potential distraction of a full-time job from their business efforts. Some also express concern over the author's declining health and the ongoing struggle of surviving as a freelancer. \n\nOverall, the sentiment of the commenters is empathetic and supportive, with many sharing their own experiences and offering words of encouragement. The comment with the most upvotes highlights the difficult reality of freelancing and the need for better support and resources for those in similar situations. It reads, \"Freelancing can be a tough road, and it sounds like you've been through a lot. Hang in there and keep pushing towards your goals.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]