[
  {
    "Link": "The author started a small baked goods business in January 2024, transitioning from a job at Starbucks. While initially successful, business slowed down, leading them to take on two additional jobs to make ends meet. They now work 16-hour days but feel trapped and burnt out, struggling to maintain motivation and questioning their identity as a business owner. Despite support from their husband, the daunting challenges of cold calling and financial strain have left them feeling overwhelmed and considering whether to continue their business. They express a desire to vent and be understood amidst their frustrations.",
    "Subreddit": "#N/A",
    "Title": "The post on Reddit discusses the struggles faced by a small baked goods business owner who started their venture in January 2024 after leaving their job at Starbucks. While initially successful, the business has slowed down, leading the owner to take on two additional jobs, resulting in 16-hour workdays. The owner expresses feeling trapped, burnt out, and questioning their identity as a business owner. Despite support from their husband, the challenges of cold calling and financial strain have taken a toll, leaving them overwhelmed and considering whether to continue their business. The comment section showcases empathy and support for the business owner, with many offering words of encouragement, advice, and sharing similar experiences. The main concerns raised revolve around the difficulties of starting and maintaining a business, especially in the face of financial struggles and burnout. The overall sentiment of the commenters is one of understanding and offering a listening ear, highlighting the struggles and sacrifices that come with being a business owner. The comment with the most upvotes reads, \"Starting a business is tough, and it takes a toll on you physically and emotionally. Don't be afraid to take a break and prioritize your well-being.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]