[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post in question highlights the struggles of an entrepreneur who accumulated 8 million pesos (~$141,000) in debt while pursuing their dreams. Despite initially achieving success with a physical store, the COVID-19 pandemic forced them to shift to online sales, resulting in significant debts from loans used to expand. They eventually had to close their business, and subsequent attempts at affiliate marketing and releasing an ebook were also unsuccessful. The narrator expresses feelings of defeat and regret for the impact on their family, questioning their ambitions and purpose. The comments on this post express empathy and understanding for the narrator's situation, highlighting the harsh reality and challenges of entrepreneurship. Many suggest that freelance work may be a more stable and practical option, while others offer words of encouragement and advice to pick themselves back up and keep trying. The top-rated comment urges the narrator to remember that success is not a straight path and to use their failures as lessons for future endeavors.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]