[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post shares the struggles of an entrepreneur who amassed 8 million pesos in debt after initially finding success with a physical store selling clothing, but being forced to shift to online sales during the COVID-19 pandemic. Despite generating 29 million pesos in sales, mismanagement and failed attempts at affiliate marketing and launching an ebook led to the business's closure. The narrator expresses feelings of defeat and regret, concerned about the burden their financial misfortunes put on their family. They seek advice on letting go of their dreams and considering freelancing as a more stable path forward. Positive points highlighted by commenters include the narrator's determination and resilience, as well as their potential for success in freelancing. Concerns raised include the risks and challenges of entrepreneurship, the importance of proper planning and management in business, and the impact of financial struggles on mental health and relationships. The overall sentiment of commenters is one of empathy and support for the narrator, with many offering words of encouragement and advice to overcome their setbacks. The most upvoted comment reflects this sentiment, saying, \"It takes great courage to share your struggles with others. Keep pushing and don't give up. You have the skills and resilience to succeed, just need to find the right path.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]