[
  {
    "Link": "The author shares their journey of selling their first business, which involved trading Steam skins while being a full-time college student. They started with a $20 gift card in Spring 2017 and gradually built an inventory worth $6,000 through strategic marketing and influencer ads. Over time, they faced challenges like declining profits and issues with an investor, ultimately leading to a slowdown in business activity to focus on school. They sold 90% of the site for $2,200 in Spring 2019. Key highlights include a user base growth to over 40,000, $12,000 in withdrawals, and a total revenue of approximately $17,000. The experience exposed them to entrepreneurship, marketing, and development, and they are now considering future business opportunities.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post in review is from an author who shares their journey of selling their first business, which involved trading Steam skins while being a full-time college student. Despite starting with just a $20 gift card in Spring 2017, the author was able to gradually build an inventory worth $6,000 through strategic marketing and influencer ads. They faced challenges along the way, such as declining profits and issues with an investor, but were able to grow their user base to over 40,000 and make $12,000 in withdrawals, with a total revenue of approximately $17,000. The experience introduced them to entrepreneurship, marketing, and development, and they are now considering future business opportunities. The overall sentiment of the commenters is positive, with many commending the author's determination and success as a full-time student. Some concerns raised include the potential for increased competition in the market and the reliability of the site's investor. The comment with the most upvotes notes the impressive growth and success of the business despite the challenges faced.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]