[
  {
    "Link": "A customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After realizing the item wasn't suitable, they returned it, paying $14 for shipping. However, USPS marked the package as \"unclaimed\" after three delivery attempts, and it was returned to the sender. The customer contacted the business for a refund, but the business refused to pay for the return shipping and insisted on receiving the item to process the refund, resulting in the customer facing an additional $14 cost. The customer is frustrated and considering a chargeback, feeling the business is not honoring its return policy fairly.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post discusses a customer's frustration with a small business that did not honor its return policy. The customer ordered a $50 item with a 30-day return and 100% satisfaction guarantee, but after paying $14 for return shipping, the package was marked as \"unclaimed\" and returned to the sender by USPS. The business refused to pay for the return shipping and insisted on receiving the item before processing a refund, leading to an additional $14 cost for the customer. \n\nPositive points mentioned in the comments include the importance of clear and fair return policies for customers, the need for businesses to take responsibility for shipping issues, and the benefits of offering free returns. Several commenters also highlighted the frustration and inconvenience faced by the customer in this situation. \n\nThe main concerns raised revolve around the lack of communication and flexibility from the business, as well as the financial burden placed on the customer. Many commenters expressed disappointment in the business for not standing by their return policy and not taking responsibility for the shipping error. \n\nOverall, the sentiment of the commenters is one of support for the customer and disappointment in the business. The top-rated comment sums up this sentiment, stating \"The customer did everything that was asked of them, and the business is not holding up their end of the bargain. That's not right.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]