[
  {
    "Link": "The author, who recently started a women's clothing small business, expresses disappointment over the lack of support and encouragement from others during her journey. Despite her previous experiences with women's competition in business, she still feels heartbroken that those she expected to celebrate her achievements are indifferent, treating her efforts as insignificant. She seeks validation but emphasizes that she isn?t looking for insincere praise, just a bit of acknowledgment.",
    "Subreddit": "",
    "Title": "Introduction:\nThe author of the Reddit post, a woman who recently started her own small business in women's clothing, expresses disappointment over the lack of support and encouragement from others. Despite her previous experiences with women's competition in business, she feels heartbroken and seeks validation from those around her.\n\nKey positive points:\nMany commenters applaud the author for having the courage and determination to start her own business. They also admire her resilience in the face of challenges and her willingness to share her experiences. Some offer words of encouragement and advice to keep pushing forward.\n\nMain concerns raised:\nThe main concern raised by commenters is the seemingly lack of support and understanding from others, especially from those who are also in the same industry. They express disappointment and frustration that instead of celebrating her achievements, the author is met with indifference. Some commenters also relate their own experiences of feeling unsupported and offer their solidarity to the author.\n\nOverall sentiment of the commenters:\nThe overall sentiment of the commenters is one of empathy and understanding. Many express their support for the author and share their own struggles of being a woman in business. They also offer words of encouragement and advice to keep pushing forward. However, there is also a sense of disappointment and frustration towards the lack of support from others, especially from women in the same industry.\n\nComment with the most upvotes:\nThe comment with the most upvotes reads: \"I feel your pain. It's so disheartening when the people you expect the most support from are indifferent. But remember, your success is not dependent on their validation. Keep pushing forward and proving them wrong.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]