[
  {
    "Link": "The author started their business in 2007 after 18 years at a failing company, leveraging 22 years of experience and client loyalty. They worked from home, avoiding real estate costs, and survived the 2008 crash. Both the author and their husband are self-employed. Despite enduring the COVID-19 pandemic, rising costs (up 50% in 2020) made the business unsustainable. They are now considering a part-time 1099 contract with a long-term vendor, acknowledging they were fortunate not to close in 2020 like many other small businesses.",
    "Subreddit": "",
    "Title": "This Reddit post discusses the challenges faced by a small business owner who started their business in 2007 after working at a failing company for 18 years. They were able to leverage their 22 years of experience and client loyalty to work from home and survive the 2008 crash. However, despite their success, the business became unsustainable due to rising costs (up 50% in 2020) and the impact of the COVID-19 pandemic. The author and their husband are now considering a part-time 1099 contract with a long-term vendor to stay afloat. \n\nThe discussion highlights several positive aspects of the author's journey, such as their ability to adapt and survive the 2008 crash, their loyal client base, and their willingness to explore alternative options to keep their business going. Many commenters also praise the author for their resilience and determination to make their business work. \n\nSome of the main concerns raised include the challenges faced by small businesses in the current economy, the impact of rising costs on their profitability, and the uncertainty of the future due to the pandemic. Several commenters also share similar experiences and offer their support and advice to the author. \n\nOverall, the sentiment of the commenters is sympathetic and understanding, with many expressing gratitude for the author's transparency and sharing their story. \n\nThe most upvoted comment reads, \"It's unfortunate to see another small business struggling, but it's also inspiring to see their resilience. Wishing them the best in their future endeavors.\" This comment captures the overall sentiment of the discussion and showcases the empathy and support shown by the community towards the author.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]