[
  {
    "Link": "The author, a budding designer since high school, shares a pivotal experience that shattered their confidence when a major client underpaid for a significant branding project due to personal reasons. Despite having dedicated immense effort to the project, the disappointing outcome led them to pause their design work and focus on college. As they near graduation, they struggle with low self-esteem, charging low rates out of fear of rejection, and facing persistent doubts about their value. They seek advice from others who have faced similar challenges, expressing a desire to overcome these issues and rebuild their confidence.",
    "Subreddit": "",
    "Title": "This Reddit post shares the story of a designer who lost confidence after a disappointing experience with a major client. Despite their passion and dedication to the project, the underpayment due to personal reasons caused them to pause their design work and focus on college. As they near graduation, they struggle with low self-esteem and fear of rejection, leading them to charge low rates. They seek advice from others who have faced similar challenges and express a desire to rebuild their confidence. The key positive points raised by commenters include empathy for the author's situation, encouragement to not let a single negative experience define their worth, and suggestions to seek support and find a mentor or community. The main concerns raised include the impact of undervaluing their work on the industry and the need to learn from this experience to set boundaries and stand up for their worth. The overall sentiment of the commenters is one of understanding and support for the author's journey towards rebuilding their confidence and finding their worth as a designer. The most upvoted comment was \"Don't let one bad experience dictate your worth, especially when it's out of your control. Reflect, learn and grow.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]