[
  {
    "Link": "The author has spent 13 years freelancing as a design engineer, often feeling undervalued and struggling financially, with their health deteriorating over time. They transitioned to starting their own business but have yet to generate income, mainly focusing on securing Small Business Innovation Research (SBIR) funding, which is highly competitive. Despite the challenges, they see potential for significant income if successful. Currently facing financial strain, including late bills and rent, they have been offered a full-time job that may distract from their business efforts, but they feel it necessary for immediate income. They express frustration over their situation, the cyclical nature of their struggles, and the difficulty in finding quality freelance work outside of Craigslist, ultimately seeking advice and support.",
    "Subreddit": "",
    "Title": "In this Reddit post, the author shares their experience as a design engineer freelancing for 13 years and struggling financially and with their health. They have recently transitioned to starting their own business but have yet to generate income, focusing on securing highly competitive Small Business Innovation Research (SBIR) funding. Despite the potential for significant income, they are currently facing financial strain and have been offered a distracting full-time job for immediate income. Commenters offer advice and support while expressing understanding for the author's frustration and concerns. Positive points include recognition of the author's hard work and potential for success, as well as advice on diversifying income sources and seeking assistance from resources such as Small Business Development Centers. Main concerns raised include the lack of recognition and support for freelance work and difficulties in finding quality work outside of Craigslist. The overall sentiment is empathetic and encouraging, with many commenters offering words of support and sharing their own struggles and successes. The comment with the most upvotes highlights the importance of seeking assistance and advice from experts and experienced individuals in the field.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]