[
  {
    "Link": "There is a suspicion of fake threads being posted on the smallbusiness subreddit, with the top comments always mentioning a solution called Wosily. These threads are posted by new accounts with fake post history, and the posts are promptly deleted once called out. The user suggests banning all mentions of Wosily and implementing measures to prevent fake threads on the subreddit.",
    "Subreddit": "",
    "Title": "This Reddit post brings to light a suspicion among users of the smallbusiness subreddit that there are fake threads being posted in order to promote a solution called Wosily. These threads are created by new accounts with fake post histories and are deleted promptly once pointed out. The community discusses the need for measures to prevent such fake threads and suggests banning any mentions of Wosily on the subreddit. \n\nPositive points raised by users include the prompt detection and removal of these fake threads, as well as the suggestion to ban mentions of Wosily to prevent further promotion. Others also commend the community for being vigilant and calling out suspicious behavior. \n\nMain concerns highlighted involve the possibility of these fake threads being a coordinated effort to promote Wosily, which could potentially lead to a scam or harm the reputation of the subreddit. Users also express frustration at continuously encountering such threads and the need for stricter measures to prevent them from tricking other users. \n\nOverall, the sentiment of the commenters is that the issue of fake threads promoting Wosily needs to be addressed urgently. Most users are supportive of implementing measures to prevent such threads and appreciate the vigilance of the community. \n\nThe top comment with the most upvotes calls for a ban on Wosily mentions and states, \"It's best to remove any and all potential harm from this subreddit, no matter how small. Ban the word and phrases associated with it.\" Overall, the discussion highlights the importance of maintaining a safe and trustworthy community for small business owners, and the need for proactive measures to prevent and protect against scams.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]