[
  {
    "Link": "The author started their business in 2007 after 18 years at a failing company, leveraging 22 years of experience and client loyalty. They worked from home, avoiding real estate costs, and survived the 2008 crash. Both the author and their husband are self-employed. Despite enduring the COVID-19 pandemic, rising costs (up 50% in 2020) made the business unsustainable. They are now considering a part-time 1099 contract with a long-term vendor, acknowledging they were fortunate not to close in 2020 like many other small businesses.",
    "Subreddit": "",
    "Title": "The author of this Reddit post shared their experience of starting a business in 2007 after working for a failing company for 18 years. They were able to leverage their 22 years of experience and client loyalty to work from home and avoid real estate costs, and also survive the 2008 crash. The post also mentions their and their husband's self-employment status. However, despite enduring the COVID-19 pandemic, the rising costs (up 50% in 2020) have made the business unsustainable. The author is now considering a part-time 1099 contract with a long-term vendor, but also acknowledges their fortunate position compared to other small businesses that had to close in 2020. \n\nMany commenters praised the author for their resilience and ability to survive the 2008 crash and the current pandemic. Some also highlighted the benefits of working from home and avoiding real estate costs. However, there were also concerns raised about the rising costs and the possible impacts on the business. Some commenters suggested finding a new niche or diversifying the business to stay afloat. \n\nOverall, the sentiment of the commenters was empathetic towards the author, with many acknowledging the challenges of running a small business during uncertain times. The comment with the most upvotes was from a commenter who shared a similar experience and offered words of encouragement and advice to the author.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]