[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the struggles of the narrator, who accumulated 8 million pesos in debt while trying to establish their clothing store business after the COVID-19 pandemic. The narrator initially succeeded with their physical store but faced financial difficulties when they shifted to online sales and took out loans to expand. Despite making 29 million pesos in sales, the business eventually closed due to mismanagement and subsequent failures. The narrator also faced failure in their attempts at affiliate marketing and launching an ebook, leading to feelings of defeat, regret, and concern for their family's well-being. They sought advice on letting go of their dreams and potentially freelancing for a more stable income. The top comment with the most upvotes empathized with the narrator's struggles and offered words of encouragement to continue pursuing their passion while also considering practical options for financial stability. The overall sentiment in the comments was supportive and understanding, with many sharing similar experiences and recommending perseverance and resilience.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]