[
  {
    "Link": "A customer ordered a $50 item from a small business with a \"30-day return\" and \"100% satisfaction guarantee.\" After realizing the item wasn't suitable, they returned it, paying $14 for shipping. However, USPS marked the package as \"unclaimed\" after three delivery attempts, and it was returned to the sender. The customer contacted the business for a refund, but the business refused to pay for the return shipping and insisted on receiving the item to process the refund, resulting in the customer facing an additional $14 cost. The customer is frustrated and considering a chargeback, feeling the business is not honoring its return policy fairly.",
    "Subreddit": "",
    "Title": "This Reddit post sparked a heated discussion about a customer's frustration with a small business's return policy. The customer ordered a $50 item and returned it within the 30-day return window, but due to USPS marking the package as \"unclaimed,\" the customer had to pay an additional $14 for return shipping. The business refused to cover the cost and insisted on receiving the item back before issuing a refund, causing the customer to consider a chargeback. Many commenters expressed empathy for the customer and praised the customer for trying to resolve the issue directly with the business before resorting to a chargeback. They also pointed out the flaw in the return policy and the need for businesses to take responsibility for shipping errors. Others raised concerns about the potential abuse of return policies and the need for clear communication between businesses and customers. The overall sentiment of the commenters was frustration with the business's handling of the situation and agreement that the customer's frustration and potential chargeback were valid. The comment with the most upvotes highlighted the importance of businesses treating customers fairly and honoring their return policies, regardless of any mishaps with shipping.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]