[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "In a recent Reddit post, the author, a person in their 40s, shared their success managing a side hustle that surpassed their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. While the company offered to accommodate a reduced schedule, the author doubts the feasibility of maintaining the same workload. Now, they are considering asking for a raise, despite potential future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides. \nOverall, the commenters were supportive of the author's decision to prioritize their health and side hustle. Many praised the author for their success and encouraged them to negotiate for a higher salary. Some also suggested seeking medical advice and discussing accommodations with HR. The main concern raised was the potential risk of asking for a raise and the author's long-term stability. The overall sentiment was positive, with many commenting that the author's success and autonomy in their side hustle were admirable. The comment with the most upvotes encouraged the author to prioritize their health and happiness over fears of job security and to have confidence in their abilities.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]