[
  {
    "Link": "The author, a sole W2 employee running a one-man marketing agency that recently transitioned from an LLC to an S-Corp, is facing a dilemma regarding expense categorization on the 1120S form. There?s a disagreement between their bookkeeper and tax preparer on how to categorize subcontractor expenses. Historically categorized as \"Contract Labor\" on Schedule C, there is no such option on the 1120S form. The CPA suggests labeling these expenses as \"Other Deductibles\" and setting \"Cost of Goods Sold\" to zero, while the bookkeeper argues they should fall under \"Cost of Goods Sold\" (CoGS) due to their direct link to business revenue. The author is inclined to agree with the bookkeeper, who believes that excessive use of \"Other Deductibles\" could raise audit flags. They seek additional opinions on this matter.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post discusses a dilemma faced by the author, a marketing agency owner, regarding the categorization of subcontractor expenses on the 1120S form. The CPA suggests labeling these expenses as \"Other Deductibles,\" while the bookkeeper argues they should fall under \"Cost of Goods Sold.\" The main point made by commenters is that the categorization of these expenses ultimately depends on the nature of the subcontractor's work and their level of involvement in the business's revenue generation. Some argue that categorizing them as \"Other Deductibles\" may raise audit flags and that \"Cost of Goods Sold\" may be more appropriate. Some also suggest consulting with the IRS or a tax professional for guidance. The main concern raised is the potential consequences of incorrect categorization, with most commenters agreeing that avoiding attention from the IRS should be a priority. The overall sentiment is that this is a complex issue and that seeking professional advice would be the best course of action. The comment with the most upvotes suggests consulting with both the bookkeeper and the CPA to find a compromise that accurately reflects the subcontractor expenses.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]