[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "#N/A",
    "Title": "The author, a successful manager in their 40s, has been balancing a side hustle that surpasses their full-time job for three years now. However, due to declining physical and mental health, they recently resigned from their job without disclosing their side hustle. Although offered a reduced schedule, the author doubts the feasibility of maintaining the same workload. They are now considering asking for a raise, even though it may put them at risk for future layoffs, as they value the flexibility of remote work and see their current job as the end of their corporate career. \nPositive points raised by commenters include the author's dedication to their side hustle and their ability to outperform their full-time job. Many commend the author for prioritizing their health and the importance of self-care. Some also emphasize the value of flexibility and remote work options in today's workplace. \nMain concerns raised are the potential consequences of asking for a raise in the midst of a pandemic and economic uncertainty, and the feasibility of balancing a full-time workload with a side hustle. Some commenters also express concern for the author's future job security, especially if they are designated for layoffs. \nOverall, sentiment among commenters is supportive and understanding of the author's decision to prioritize their health and value their remote work situation. \nThe comment with the most upvotes highlights the importance of mental and physical well-being and encourages the author to prioritize themselves over their job.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]