[
  {
    "Link": "In Spring 2017, a college student began trading Steam skins with a small investment, eventually developing a trading site for Rust with the help of a programmer, Michel. By the end of 2017, the business had grown significantly, reaching 16,000 users and generating $1,100 monthly profit. However, by Winter 2018, profits declined due to marketing challenges and increased expenses. After ceasing development to focus on school, the owner sold 90% of the site for $2,200 in Spring 2019. Key takeaways include learning about development, marketing, and entrepreneurship, and ultimately withdrawing over $12,000 in profits from initial investments. The experience fostered a newfound interest in the business world.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the experience of a college student who started trading Steam skins and eventually developed a successful trading site for the game Rust. With the help of a programmer, the business grew to 16,000 users and generated $1,100 in monthly profit by the end of 2017. However, there were challenges with marketing and increased expenses, which led to a decline in profits by Winter 2018. The owner decided to sell 90% of the site for $2,200 in Spring 2019, ultimately withdrawing over $12,000 in profits from their initial investments. The post highlighted the importance of learning about development, marketing, and entrepreneurship, and how the experience sparked an interest in the business world. \n\nPositively, commenters admired the student's determination and ability to turn a small investment into a successful business. They also appreciated the valuable lessons learned in development, marketing, and entrepreneurship. However, concerns were raised about the decline in profits and the decision to sell off most of the site after investing so much time and effort into it. Some also questioned the low selling price and whether it was a fair deal. \n\nOverall, the sentiment of the commenters was supportive and informative. They recognized the achievements of the student and offered advice for future business endeavors. The most upvoted comment was one that praised the student for their hard work and expressed hope for future successes in the business world.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]