[
  {
    "Link": "The author recounts a tumultuous journey of entrepreneurship, beginning in 2019 with the opening of a clothing store that initially flourished but ultimately led to overwhelming debt of 8 million pesos (about $141,000). Driven by aspirations for success, they borrowed extensively to expand, only to face setbacks during the pandemic and subsequent financial mismanagement. Despite generating 29 million pesos in sales, the business eventually failed, prompting repeated attempts at new ventures, including affiliate marketing and an ebook launch, all of which failed to turn a profit and deepened their debt.\n\nThroughout this struggle, the author grappled with feelings of inadequacy, depression, and the burden of disappointing their supportive family. They reflect on their relentless pursuit of dreams and question their ambitious mindset, feeling exhausted and unsure of their identity outside of these aspirations. In their concluding remarks, they express gratitude for the empathy received from others and reveal plans to shift focus toward freelancing to achieve financial stability.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post recounts a turbulent journey of entrepreneurship, with the author sharing their struggle to achieve success through various ventures that ultimately failed, leaving them with a significant debt of 8 million pesos. Readers expressed empathy and support for the author, acknowledging their determination and resilience in the face of adversity. However, there were concerns raised about the author's financial management and ambitious mindset, which may have contributed to their downfall. The overall sentiment among commenters was one of understanding and compassion, with many relating to the author's experiences and offering words of encouragement. The top upvoted comment was someone recounting their own difficult journey in entrepreneurship and reminding the author to not give up.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]