[
  {
    "Link": "The author, who runs a one-man marketing agency and recently elected S-Corp status, is seeking advice on how to categorize subcontractor expenses for the 1120S tax form. Previously categorized as \"Contract Labor\" on Schedule C, such an option is unavailable on 1120S. The CPA suggests categorizing them as \"Other Deductibles\" with a note detailing the expenses, while the bookkeeper argues this could lead to an audit and advocates for categorizing these costs under \"Cost of Goods Sold\" (CoGS) since they are tied to revenue generation. The author is inclined to support the bookkeeper's recommendation for better clarity in reflecting net profit.",
    "Subreddit": "#N/A",
    "Title": "In this Reddit post, the author, who runs a one-man marketing agency and recently elected S-Corp status, is seeking advice on how to categorize subcontractor expenses for the 1120S tax form. The author's previous practice of categorizing these expenses as \"Contract Labor\" on Schedule C is no longer an option for the 1120S. A CPA suggests categorizing them as \"Other Deductibles\" with a note explaining the expenses, while a bookkeeper argues for categorizing them under \"Cost of Goods Sold\" (CoGS) since they are tied to revenue generation. The author is inclined to support the bookkeeper's suggestion for better clarity in reflecting net profit. \n\nCommenters generally support the bookkeeper's recommendation, citing the potential for an audit if the expenses are classified under \"Other Deductibles.\" Many highlight the importance of accurately reflecting net profit and the potential consequences of misclassifying expenses. Some also suggest consulting with a tax attorney for further advice. \n\nThe top upvoted comment states, \"I would go with CoGS just to stay safer on the audit side. If you have a documented argument for categorizing it as other, I think it?s fine either way though.\" This comment reflects the overall sentiment of the discussion, with most commenters recommending caution and following the bookkeeper's suggestion for categorizing expenses under CoGS.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]