[
  {
    "Link": "The owner of a handmade custom suit shop on Etsy, which has been operating for 20 years, reported the suspension of their shop following around 450 sales and $54.8K in revenue since launching online in October 2023. Despite providing custom sizing consultations and communicating delays, about 20-25 orders became overdue due to customers not submitting necessary measurements. The suspension was unexpected, with no prior warnings, and was prompted by numerous customer case openings after Etsy notified buyers of the shop's status. The owner cited a dispute with a customer over a false review and alleged that similar shops with stolen images remain active. They expressed concern over pending orders, employee livelihoods, and ongoing anxiety while attempting to appeal Etsy's decision. The owner warns others not to rely solely on Etsy for their business.",
    "Subreddit": "#N/A",
    "Title": "This post on Reddit features the owner of a handmade custom suit shop on Etsy, who reported the suspension of their shop after 20 years of operation and around 450 sales totaling $54.8K in revenue. The shop had been successfully operating online since October 2023 and provided custom sizing consultations, but faced delays due to customers not submitting necessary measurements. The suspension was unexpected and prompted by multiple customer complaints after Etsy notified them of the shop's status. The owner claims the dispute with a customer over a false review and alleges that similar shops with stolen images are still active. They express concerns over pending orders, employee livelihoods, and the ongoing stress of appealing Etsy's decision. The overall sentiment of commenters is empathetic and supportive of the shop owner, with many expressing frustration with Etsy's handling of the situation. The top upvoted comment states, \"It's ridiculous that Etsy wouldn't give the owner a chance to rectify the issue before suspending their shop.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]