[
  {
    "Link": "The author is reading Walter Deibel's \"Buy then Build,\" which outlines the concept of acquisition entrepreneurship. He presents a scenario where an entrepreneur buys a $1M business with $200k SDE, invests $100k, and finances the rest with a 90% SBA loan. The entrepreneur aims to grow the business's revenue by 10% annually and sell it for $3-4M in ten years. The author questions the feasibility of consistently achieving a 10% growth rate over a decade and seeks insights on business niches that could support this growth.",
    "Subreddit": "#N/A",
    "Title": "In this Reddit post, the author is discussing the concept of acquisition entrepreneurship from Walter Deibel's book \"Buy then Build.\" The scenario presented is that of an entrepreneur buying a $1M business with $200k SDE, investing $100k, and financing the rest with a 90% SBA loan. The goal is to achieve a 10% annual revenue growth and sell the business for $3-4M in ten years. The feasibility of consistently achieving the growth rate and identifying niche markets that can support it are the main discussion points.\n\nThe key positive points raised by commenters include the low financial risk involved in the acquisition entrepreneurship method and the potential for substantial returns in the long run. Some also suggest that the 10% growth rate may be achievable with the right strategies and market conditions. Others mention the potential for gaining expertise and experience in a new industry through acquisition.\n\nThe main concerns raised revolve around the potential challenges of consistently achieving a 10% growth rate over a decade, as it heavily depends on market conditions and external factors. Some also question the limited focus on financial returns and the lack of discussion on building a sustainable and successful business.\n\nOverall, the sentiment of commenters leans towards cautious optimism. While many recognize the potential opportunities of acquisition entrepreneurship, they also acknowledge the challenges and uncertainties it presents. The most upvoted comment expresses the need for a more comprehensive and sustainable approach beyond just financial returns. The comment mentions that \"buying then building\" should also prioritize creating value and building a strong foundation for long-term success.",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]