[
  {
    "Link": "The author has been a freelance design engineer for 13 years, earning an estimated $464,616 before taxes, primarily through Craigslist gigs. Despite loving the work when it?s challenging and collaborative, they?ve struggled with low income, poor treatment, declining health, isolation, and financial stress. In recent years, they started a business focused on securing SBIR (Small Business Innovation Research) grants, which could potentially provide significant income and fulfilling work. However, the process is highly competitive, and they?ve yet to secure funding. Currently, they?re facing severe financial difficulties, with overdue bills and rent, and are considering taking a full-time job offered by a former coworker, though it would distract from their business. Despite the challenges, they remain hopeful about the potential of SBIR funding and are preparing multiple proposals for 2020, aiming for a significant financial turnaround. The author feels stuck but is reluctant to give up on their business due to its potential.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the struggles of a freelance design engineer who has been in the industry for 13 years but has faced financial difficulties, poor treatment, declining health, and isolation. However, they have started a business focused on securing SBIR grants, which has the potential to provide significant income and fulfilling work. The post highlights the high level of competition for these grants and the author's current financial difficulties, leading them to consider taking a full-time job. Despite these challenges, the author remains hopeful and is preparing proposals for 2020. The key positive points raised by commenters include the author's determination and potential success through SBIR grants. However, concerns were raised about the author's wellbeing and the uncertainty of securing these grants. Overall, the sentiment of the commenters is empathetic and supportive towards the author's struggle. The comment with the most upvotes reads, \"It takes a lot of courage to start a business and take on such a competitive market. Keep pushing and never give up!\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]