[
  {
    "Link": "A small UK engineering company specializing in waterproof cables faced difficulties when an overseas customer in the UAE requested a custom product. After successfully agreeing on specifications, issues arose during the onboarding process, particularly around payment terms. The customer insisted on net 60 payments, which the owner found untenable due to the upfront costs of custom work. After much negotiation, the best offer was net 30, still risky for the owner. Ultimately, the owner chose not to proceed with the order, prioritizing peace of mind over financial risk. They sought to hear from others about similar experiences with large companies.",
    "Subreddit": "",
    "Title": "The Reddit post discussed a small UK engineering company facing difficulties with a large overseas customer in the UAE who requested a custom product with a net 60 payment term. After negotiations, the owner chose not to proceed with the order due to the financial risk involved. The commenters shared their similar experiences with large companies and offered advice and support for the owner's decision.\n\nSome key positive points raised by the commenters include applauding the owner for prioritizing their peace of mind and not succumbing to the pressure of a potentially risky business deal. Others emphasized the important principle of being paid on time for products and services rendered. One commenter also highlighted the potential red flags that could indicate the customer's insincerity and advised the owner to be cautious in such situations.\n\nThe main concerns raised by the commenters were the unfair payment terms imposed by large companies and the impact it can have on small businesses. Many shared their personal experiences of being burned by similar payment terms and the negative effect it had on their cash flow and overall business operations. Others expressed frustration at the power dynamics between small and large companies, with the latter often dictating unreasonable terms.\n\nThe overall sentiment of the commenters was supportive and understanding of the owner's decision. Many empathized with the challenges faced by small businesses when dealing with large companies and offered words of encouragement and solidarity. One commenter's sentiment was summed up by their comment: \"Good on you for standing your ground! Remember, your mental health and peace of mind is far more important than any business deal.\" This comment received the most upvotes, with many others echoing the sentiment.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]