[
  {
    "Link": "The owner of a handmade custom suit shop on Etsy faces suspension after their shop, which had generated $54.8K in revenue and 450 sales, received numerous case open requests from buyers due to overdue orders. The delay mainly stemmed from customers not providing necessary measurements for custom suits. Despite offering detailed sizing guides and video consultations, 55 active orders remain in limbo. The owner had previously argued with a dissatisfied customer, leading to a negative review that triggered a warning from Etsy. They have filed an appeal but received only automated responses. The suspension has caused significant distress, as many customers expected suits for important events. The owner cautions others against relying solely on Etsy for their businesses.",
    "Subreddit": "#N/A",
    "Title": "This Reddit discussion revolves around the suspension of a handmade custom suit shop on Etsy, which had garnered substantial revenue and sales. The multiple case open requests from buyers were due to delays caused by customers failing to provide necessary measurements for their custom suits, despite extensive sizing guides and video consultations being offered. As a result, the owner received a warning from Etsy after arguing with a dissatisfied customer, ultimately leading to a negative review. The owner's attempts to appeal the suspension have only resulted in automated responses, causing significant distress as many customers had important events approaching. Some concerns raised included the lack of communication from Etsy despite the owner's efforts to rectify the situation, as well as the reality of relying solely on Etsy for business. The overall sentiment of commenters was sympathetic towards the distressed business owner and critical of Etsy's handling of the situation. The top upvoted comment that encapsulates this sentiment reads, \"It's a shame that this is happening as a result of something beyond the owner's control. Etsy should be more understanding and supportive of their sellers.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]