[
  {
    "Link": "The owner of a handmade suit shop on Etsy, which generated $54.8K in revenue with around 450 sales, faced suspension in October 2023 due to a backlog of custom orders and customer satisfaction issues. Despite having a good track record and providing detailed sizing guides and consultations, many overdue orders resulted in customer complaints, leading to case openings and automatic refunds from Etsy. A dispute with a Japanese customer over customs fees and a negative review contributed to the situation. With active orders pending, thousands of dollars in fabric stock, and four employees relying on the business, the owner expressed panic and frustration over the suspension, claiming their attempts to communicate with customers were misconstrued. They urged others in the small business community to diversify their platforms and voiced their discontent with Etsy's handling of the matter.",
    "Subreddit": "#N/A",
    "Title": "The Reddit post discusses the suspension of a handmade suit shop on Etsy, which generated $54.8K in revenue and had a good track record but faced customer satisfaction issues and a backlog of custom orders. While the owner provided detailed sizing guides and consultations, many overdue orders resulted in complaints, case openings, and automatic refunds. A dispute with a Japanese customer over customs fees and a negative review also contributed to the situation. The owner expressed panic and frustration over the suspension, with active orders pending, thousands of dollars in fabric stock, and four employees relying on the business. They urged others to diversify their platforms and criticized Etsy's handling of the matter. While some commenters offered support and praised the owner's efforts to communicate with customers, others raised concerns about the management of the business and its impact on customers. Overall, there was a mix of sympathy and frustration towards the owner's situation, with some calling for Etsy to reconsider the suspension and others advising the owner to take responsibility and improve their business practices. The comment with the most upvotes states, \"Etsy has been known to make hasty decisions without proper communication or consideration for small business owners. It's frustrating to see them treat their sellers so poorly and with such little support.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]