[
  {
    "Link": "The author started their business in 2007 after 18 years at a failing company, leveraging 22 years of experience and client loyalty. They worked from home, avoiding real estate costs, and survived the 2008 crash. Both the author and their husband are self-employed. Despite enduring the COVID-19 pandemic, rising costs (up 50% in 2020) made the business unsustainable. They are now considering a part-time 1099 contract with a long-term vendor, acknowledging they were fortunate not to close in 2020 like many other small businesses.",
    "Subreddit": "",
    "Title": "In a post on Reddit, a business owner shared their experience of starting their own business in 2007 after 18 years at a failing company. Leveraging their 22 years of experience and client loyalty, they were able to work from home and survive the 2008 crash. Despite being self-employed and enduring the challenges of the COVID-19 pandemic, the business became unsustainable due to rising costs (up 50% in 2020). The author is now considering a part-time 1099 contract with a long-term vendor, realizing that they were fortunate not to close in 2020 like many other small businesses. \n\nThe commenters highlighted the resilience and determination of the business owner to succeed in the face of various challenges. They also appreciated the cost-saving strategies employed by the author, such as working from home, which allowed them to survive the 2008 crash and the COVID-19 pandemic. Some also admired the author's loyalty to their clients and their longevity in the industry. \n\nHowever, there were concerns raised about the viability of the new contract and whether it would be enough to sustain the business in the long run. The rising costs were also a significant concern, with some commenters empathizing with the author's struggle to keep the business afloat. Some suggested alternative solutions such as diversifying the business or seeking financial assistance. \n\nOverall, the commenters displayed a mix of empathy and admiration towards the author and their journey. While acknowledging the challenges faced, there was an overall sentiment of hope and support for the author's future endeavors. The most upvoted comment was from a former small business owner who shared their own experience and offered words of encouragement and advice. They stated, \"It's tough out there for small businesses. But keep pushing, you've got this!\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]