[
  {
    "Link": "The author, in their 40s, has been successfully managing a side hustle that outperforms their full-time job for the past three years. Due to declining mental and physical health, they resigned from their job without disclosing their side hustle. Although the company offered to adjust their schedule to retain them, the author doubts the feasibility of reduced hours while maintaining the same workload. They are now contemplating asking for a raise, even knowing it might designate them for future layoffs, as they see their current job as the end of their corporate career and value the remote work flexibility it provides.",
    "Subreddit": "",
    "Title": "The Reddit post centers around an individual in their 40s who has been managing a successful side hustle for three years, surpassing their income from their full-time job. However, due to declining mental and physical health, they resigned without disclosing their side hustle to their employer. While their company offered to adjust their schedule, they doubt the feasibility of reduced hours maintaining the same workload. The author is now considering asking for a raise, knowing it could lead to future layoffs, as they value the remote work flexibility their current job provides, and see it as the end of their corporate career.\n\nOverall, commenters were supportive of the author's decision to prioritize their health and pursue their side hustle. Many highlighted the benefits of working for oneself, including freedom, flexibility, and increased income potential. Others encouraged the author to have an open and honest conversation with their employer about their side hustle, as they may be able to work out a compromise. However, some expressed concern about the potential backlash of asking for a raise and the possibility of being labeled as \"difficult\" or \"disloyal.\" The most popular comment, with 174 upvotes, advises the author to prioritize their well-being and not worry about potential layoffs.\n\nIn summary, the discussion revolves around the importance of prioritizing one's health and happiness, the benefits of self-employment, and the potential consequences of asking for a raise. The overall sentiment is one of understanding and support for the author's decision to leave their job and pursue their side hustle, with a consensus that they should prioritize their well-being over job security.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]