[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "The Reddit post shares the struggles of an entrepreneur who accumulated 8 million pesos in debt despite achieving initial success with a physical store. After the COVID-19 pandemic hit, the shift to online sales and subsequent mismanagement led to the business's closure despite generating 29 million pesos in sales. The narrator expresses feelings of defeat and regret, questioning the purpose of their ambitions and the burden it has placed on their family. Commenters provided support and advised on ways to continue pursuing entrepreneurship, such as seeking mentorship or finding a new niche. However, the majority advised the narrator to let go of their dreams and focus on more stable options, like freelancing. The overall sentiment was one of empathy and understanding towards the struggles of entrepreneurship, with the top commenter sharing their own experience and advice: \"Sometimes we need to pivot and find a new path to achieve our goals. Don't be afraid to start something new and learn from your mistakes.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]