[
  {
    "Link": "The owner of a custom suit shop on Etsy, with 450 sales and $54.8K revenue since launching online in October 2023, details the sudden suspension of their shop. Despite a history of handmade products and attempts to communicate with customers about overdue custom orders, Etsy suspended the shop without prior warnings. The suspension was triggered by customers opening cases due to overdue orders, leading to immediate refunds from Etsy. The owner suspects a false review from a dissatisfied customer and points out inconsistencies in Etsy's enforcement, such as other shops using stolen images remaining active. The situation has caused severe anxiety, as they have outstanding orders, employees to support, and significant materials on hand. The owner expresses frustration with Etsy's policies and urges caution for other small businesses reliant on the platform.",
    "Subreddit": "",
    "Title": "The Reddit post discusses the sudden suspension of a small custom suit shop on Etsy, despite its history of handmade products and attempts to communicate effectively with customers about overdue orders. The main positive points raised by commenters are the success of the shop in terms of sales and revenue since launching in October 2023 and the close attention the owner pays to communicating with customers. However, the main concerns are the inconsistency in Etsy's enforcement policies, such as allowing other shops with stolen images to remain active, and the severe impact of the suspension on the shop, its employees, and outstanding orders. The overall sentiment expressed by commenters is frustration with Etsy's policies and a cautionary warning to other small businesses reliant on the platform. The most upvoted comment highlights the impact of the suspension on the owner's mental health and emphasizes the need for Etsy to be more transparent and consistent in their enforcement actions.",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]