[
  {
    "Link": "The author shares a personal narrative of pursuing entrepreneurial dreams that ultimately led to significant financial struggles. Beginning in 2019 with a clothing store that initially thrived, they quickly took out loans to expand. However, the COVID-19 pandemic necessitated a shift to online sales, which initially succeeded before profits dwindled in 2021 due to mismanagement and excessive spending. Despite generating substantial sales over the years, the business was shut down, leaving them with 8 million pesos ($141,000) in debt. Subsequent ventures, including affiliate marketing and launching an eBook, also failed, deepening their despair. The author experiences depression and a sense of failure, particularly feeling they have let their supportive family down. They now grapple with the challenge of letting go of unfulfilled dreams while seeking stability through freelancing. Grateful for community support, they reflect on their journey and consider a shift in mindset.",
    "Subreddit": "#N/A",
    "Title": "In the Reddit post, the author shares a personal story of pursuing entrepreneurial dreams, which ultimately led to significant financial struggles. Despite initially thriving with a clothing store in 2019, the COVID-19 pandemic forced a shift to online sales, resulting in mismanagement and excessive spending. This led to the closure of the business and 8 million pesos in debt. Subsequent ventures, such as affiliate marketing and launching an eBook, also failed, causing the author to experience depression and a sense of failure. The supportive community reflects on the journey and offers encouragement while emphasizing the importance of a shift in mindset and the challenge of letting go of unfulfilled dreams. Overall, the commenters highlight the positive aspects of the author seeking stability through freelancing and acknowledge the valuable lesson learned through this experience. The top upvoted comment states, \"It takes immense courage to share such a personal and vulnerable story. Your resilience is beyond inspiring.\"",
    "CommentsPerDay": "#N/A",
    "NumberOfComments": "#N/A",
    "URL": "#N/A"
  }
]