[
  {
    "Link": "The author started their business in 2007 after 18 years at a failing company, leveraging 22 years of experience and client loyalty. They worked from home, avoiding real estate costs, and survived the 2008 crash. Both the author and their husband are self-employed. Despite enduring the COVID-19 pandemic, rising costs (up 50% in 2020) made the business unsustainable. They are now considering a part-time 1099 contract with a long-term vendor, acknowledging they were fortunate not to close in 2020 like many other small businesses.",
    "Subreddit": "",
    "Title": "This Reddit post discusses the author's experience starting their business in 2007, after years at a failing company. They were able to leverage their 22 years of experience and client loyalty to work from home and avoid real estate costs, surviving the 2008 crash. Despite being self-employed and enduring the challenges of the COVID-19 pandemic, rising costs made the business unsustainable. The author is now considering a part-time 1099 contract with a long-term vendor, and acknowledges their fortune in not having to close in 2020 like many other small businesses. \n\nKey positive points from the commenters include the author's determination and resilience in building their business and finding ways to survive during difficult times. Many commenters also commend the author for considering alternative options, such as a part-time contract, to keep their business afloat. \n\nSome main concerns raised by commenters include the impact of rising costs on small businesses, the challenges of being self-employed, and the potential risks of relying on a single long-term vendor for income. \n\nOverall, the sentiment of commenters is sympathetic and understanding towards the author's situation. Many share similar experiences and offer words of encouragement and support. \n\nThe comment with the most upvotes acknowledges the author's resilience and determination, stating, \"It takes a lot of strength and hard work to keep a business afloat for so long, especially during tough times. You should be proud of what you have accomplished.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]