[
  {
    "Link": "The narrator shares their struggles with entrepreneurship over the past few years, culminating in 8 million pesos ($141,000) in debt. They initially achieved success with a physical store selling clothing, but after the COVID-19 pandemic forced a shift to online sales, they incurred significant debts by taking out loans to expand. Despite generating 29 million pesos ($512,000) in sales, mismanagement and subsequent failures led to the business's closure. Attempts at affiliate marketing and launching an ebook also failed, worsening their financial situation. The narrator expresses feelings of defeat, regret, and concern for their family's burden due to their financial misfortunes, questioning their ambitions and purpose. They seek advice on letting go of their dreams in light of continuous failures and are now considering freelancing as a more stable path forward.",
    "Subreddit": "",
    "Title": "In this Reddit post, the narrator shares their struggles with entrepreneurship, which have led them to accumulate 8 million pesos in debt. Despite initial success with a physical store, the COVID-19 pandemic forced a shift to online sales, resulting in financial troubles from taking out loans for expansion. Although their business generated 29 million pesos in sales, mismanagement and subsequent failures led to its closure. The narrator expresses feelings of defeat, regret, and concern for their family, as well as questioning their ambitions and purpose. They seek advice on letting go of their dreams and considering freelancing as a more stable path forward.\n\nThe discussion included many empathetic and understanding responses, with several commenters acknowledging the difficult situation the narrator is facing and expressing support and encouragement. Some key positive points raised include the importance of learning from past failures, the resilience and strength of the narrator for seeking advice and considering freelancing, and the valuable skills they have gained through their experiences.\n\nThe main concerns raised by commenters revolve around the impact of debt and failure on the narrator's mental health and well-being, as well as the potential risks and challenges of freelancing. Many also emphasize the importance of seeking professional advice and support, and making informed decisions.\n\nOverall, the sentiment of the commenters is one of compassion and understanding. While some express sadness and regret for the narrator's struggles, they also offer practical advice and encouragement to move forward. The most upvoted comment, with 146 upvotes, reads, \"Don't give up. You've learned a lot and have valuable experience. Keep trying and learning from your mistakes. Freelancing may be a good option but don't give up on your dreams either.\"",
    "CommentsPerDay": "",
    "NumberOfComments": "",
    "URL": ""
  }
]